{
  "header": {
    "Travel Destination": "Travel  Destination",
    "Cultural Heritage": "Cultural Heritage",
    "Contemporary Life": "Contemporary Life",
    "Heritage Award": "Heritage Award",
    "podcart": "podcart",
    "Advertising": "Advertising",
    "vietnam heritage": "vietnam heritage",
    "Select Language": "Select Language",
    "Destination": "Destination",
    "Itinerary": "Itinerary",
    "Retreat": "Retreat",
    "Weather": "Weather",
    "Search": "Search"
  },
  "banner": {
    "Ho Chi Minh Mausoleum": "Ho Chi Minh Mausoleum",
    "Giong Temple in Soc Son": "Giong Temple in Soc Son",
    "Hanoi’s Signature Cuisine": "Hanoi’s Signature Cuisine",
    "Relaxing Retreat at West Lake": "Relaxing Retreat at West Lake",
    "Domestic": "Domestic",
    "Sightseeing": "Sightseeing",
    "History": "History",
    "Cuisine": "Cuisine",
    "Relaxation": "Relaxation",
    "When to Visit": "When to Visit",
    "detail": "Founded over 1000 years ago, Vietnam’s capital city is rich in history, with the streets of its rambling Old Quarter dating back to the 14th century. Wandering these tree-lined lanes past crumbling colonial facades will transport you back in time. However, today's Hanoi is about much more than the past. The ancient city is being invigorated with modern cafes, world-class restaurants, and cool art galleries. When the sun goes down, you have your pick of watering holes, from sophisticated rooftop bars to buzzing bia hơi. If you're traveling to Hanoi for the first time, these are experiences you must try at least once in your life. From ancient temples to buzzing markets, Hanoi's got it all. It's basically the cultural heartbeat of Vietnam."
  },
  "footer": {
    "detail": "Explore the beauty of Vietnam with memorable journeys. We bring the best travel experiences with professional and dedicated service.",
    "Quick link": "Quick link",
    "Home": "Home",
    "Hotel": "Hotel",
    "Restaurant": "Restaurant",
    "About Us": "About Us",
    "Popular destination": "Popular destination",
    "Ha Long Bay": "Ha Long Bay",
    "Hoi An ancient town": "Hoi An ancient town",
    "Quang Ninh": "Quang Ninh",
    "Quang Nam": "Quang Nam",
    "Lao Cai": "Lao Cai",
    "Contact & Newsletter": "Contact & Newsletter",
    "Address": "Address",
    "Rights": "All rights reserved",
    "Privacy": "Privacy Policy",
    "Terms of Use": "Terms of Use",
    "Payment Methods": "Payment Methods",
    "Cookie Policy": "Cookie Policy",
    "Ha Noi": "Ha Noi",
    "Viet Nam": "Viet Nam"
  },
  "Travel Destinations": {
    "Travel Destinations": "Travel Destinations",
    "The Temple of Literature": "The Temple of Literature",
    "detail": "The Temple of Literature – Imperial Academy is one of the most diverse and significant historical complexes in Hanoi, located to the south of the Thang Long Imperial Citadel. It is recognized as Vietnam’s very first university. The complex is surrounded by a brick wall and divided into five courtyards, each with unique architectural features. These courtyards are separated by brick walls with three gates connecting them. From the outermost to the innermost areas, the gates are: Van Mieu Gate, Dai Trung Gate, Khue Van Pavilion, Dai Thanh Gate, and Thai Hoc Gate.",
    "Vietnam Museum of Ethnology": "Vietnam Museum of Ethnology",
    "Ho Chi Minh’s Stilt House": "Ho Chi Minh’s Stilt House",
    "Vietnam Women’s Museum": "Vietnam Women’s Museum",
    "Tay Ho Temple": "Tay Ho Temple",
    "Hoan Kiem Lake": "Hoan Kiem Lake",
    "Hoa Lo Prison": "Hoa Lo Prison",
    "National Day September 2: Hanoi Offers Free Admission to 5 Attractions": "National Day September 2: Hanoi Offers Free Admission to 5 Attractions",
    "Long Bien Bridge – A Witness of History": "Long Bien Bridge – A Witness of History",
    "The Hanoi Old Quarter – Renewed Every Day": "The Hanoi Old Quarter – Renewed Every Day",
    "Thay Pagoda – Sacred, Majestic, and Beautiful": "Thay Pagoda – Sacred, Majestic, and Beautiful",
    "Hanoi Old Quarter": "Hanoi Old Quarter",
    "Dong Xuan Market": "Dong Xuan Market",
    "West Lake": "West Lake",
    "Long Bien Bridge": "Long Bien Bridge",
    "Ho Chi Minh Museum": "Ho Chi Minh Museum",
    "Giong Temple": "Giong Temple",
    "Ba Da Pagoda": "Ba Da Pagoda"
  },
  "Travel Journey": {
    "Travel Journey": "Travel Journey",
    "Ancient City Tour": "Ancient City Tour",
    "Culture And Spiritual": "Culture And Spiritual",
    "Premium And Night": "Premium And Night",
    "Vacation And Relax": "Vacation And Relax",
    "Spa And Relax Ancient Town": "Spa And Relax Ancient Town",
    "Hoan Kiem Lake Family Resort": "Hoan Kiem Lake Family Resort",
    "Luxury West Lake Resort": "Luxury West Lake Resort",
    "Relax Spa Old Quarter And Hoan Kiem Lake": "Relax Spa Old Quarter And Hoan Kiem Lake",
    "Spiritual And Cultural Retreat": "Spiritual And Cultural Retreat",
    "Traditional Hanoi Cuisine": "Traditional Hanoi Cuisine",
    "Night Cuisine of Hanoi Old Quarter": "Night Cuisine of Hanoi Old Quarter",
    "3 Days 2 Nights Hanoi Culinary Journey": "3 Days 2 Nights Hanoi Culinary Journey"
  },
  "Hanoi Old Quarter": {
    "name": "Hanoi Old Quarter",
    "introduction": "The Hanoi Old Quarter is the historic heart of the capital, famous for its 36 streets associated with traditional crafts. It preserves ancient tube houses, sacred temples and pagodas, and the bustling atmosphere of local markets. Walking through its streets, visitors can discover a thousand-year-old culture, enjoy signature dishes such as pho, bun cha, and banh cuon, and immerse themselves in the simple yet distinctive lifestyle of Hanoians.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d7447.887925057722!2d105.84514704191967!3d21.03492808638189!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abbf21b895f7%3A0x641bc6c48732c7a4!2zUGjhu5EgY-G7lSBIw6AgTuG7mWksIEhvw6BuIEtp4bq_bSwgSMOgIE7hu5lpLCBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759475090004!5m2!1svi!2s",
    "location": "The area covers about 100 hectares with 10 wards and 76 streets, forming a triangle: to the north bordering Hang Dau Street, to the west bordering Phung Hung Street, to the south bordering Hang Bong - Hang Gai - Cau Go - Hang Thung streets, and to the east bordering Tran Quang Khai and Tran Nhat Duat streets. The Old Quarter is near Hoan Kiem Lake and the Red River.",
    "description": [
      {
        "title": "History and Overview",
        "image": "OldTownHistory",
        "content": [
          "The Old Quarter was formed during the Ly - Tran dynasties (11th century) as a densely populated residential area east of Thang Long Imperial Citadel, where handicrafts and trade flourished, giving rise to specialized guild streets (such as Hang Ma selling votive items, Hang Bac selling silver, Hang Dao selling silk). Under the Le dynasty, it belonged to Phung Thien Prefecture; under French rule, it was renovated with French, Chinese, and Indian architectural influences. Today, it remains Hanoi’s busiest trading area, characterized by narrow tube houses (2-3m wide, 50-60m deep), tiled roofs, skylight courtyards, and monuments such as O Quan Chuong Gate, Bach Ma Temple, Cau Dong Pagoda, and Quang Dong Assembly Hall. It reflects the ancient trading culture with streets like Hang Buom and Hang Ngang (where President Ho Chi Minh drafted the Declaration of Independence in 1945)."
        ]
      }
    ],
    "image": "OldTown",
    "activities": [
      {
        "image": "OldTown1",
        "content": [
          "Stroll through the 36 guild streets (Hang Ma, Hang Dao, Ta Hien); visit landmarks such as O Quan Chuong Gate, Bach Ma Temple, and the Ancient House at 87 Ma May (exhibitions, handicraft workshops); shop at Dong Xuan Market; walk around Hoan Kiem pedestrian streets (photography, performances); take a cyclo tour or food tour (street food); experience Train Street (cafes along the railway – check train schedule); join festivals such as Mid-Autumn Festival (lantern parade).",
          "The Hanoi Old Quarter holds a unique position with abundant tangible and intangible cultural heritage. Over time, its small, tiled houses continue to live on in the memory of generations of Hanoians. Within it lie unique homes, distinctive lifestyles, and streets filled with nostalgia.",
          "The Old Quarter of Hanoi is an urban heritage with unique architecture, traditional craft streets, specialized trading streets, and many cultural and historical monuments tied to Thang Long – Dong Do – Hanoi. Dr. Architect To Thi Toan, former Vice Director of the Old Quarter Management Board, stated that while Hanoi has developed greatly, the Old Quarter still preserves every architectural detail, from the smallest to the grandest tangible and intangible legacies passed down by ancestors."
        ]
      },
      {
        "image": "OldTown2",
        "content": [
          "Architecturally, most houses in the Old Quarter are tube houses with narrow facades, skylight courtyards, and sloping tiled roofs painted in yellow lime. Daily life of thousands of residents continues within these ancient houses, each bearing the cultural identity and traditional lifestyle of Hanoians."
        ]
      },
      {
        "image": "OldTown3",
        "content": [
          "The arrangement and interior design of traditional houses reflect the aesthetic taste and refinement of Hanoians. The ancestral altar is the most sacred space, decorated with parallel sentences, wooden panels, and the scent of incense year-round. Ancient furniture such as carved wooden beds, cabinets, old books, antique vases, and an old pendulum clock highlight the depth, elegance, and contemplative spirit of old Trang An people."
        ]
      }
    ]
  },
  "Dong Xuan Market": {
    "name": "Dong Xuan Market",
    "introduction": "Dong Xuan Market is the largest and oldest market in Hanoi, located in the heart of the Old Quarter. Built in 1889 during the French colonial period, it is not only a bustling trading hub with goods ranging from fabrics, clothing, souvenirs to traditional food, but also a cultural destination closely tied to the life of Hanoians. Visitors can enjoy the lively atmosphere, explore street food, and discover a history of more than 100 years.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.863466040991!2d105.84746377515339!3d21.03814838745631!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abb8e6c24487%3A0xd9def483e7f217e6!2zQ2jhu6MgxJDhu5NuZyBYdcOibiwgxJDhu5NuZyBYdcOibiwgSG_DoG4gS2nhur9tLCBIw6AgTuG7mWkgMTAwMDAwLCBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759475170965!5m2!1svi!2s",
    "location": "Dong Xuan Market is located in Hanoi’s Old Quarter, in Dong Xuan Ward, Hoan Kiem District. To the East is Dong Xuan alley, to the West is Dong Xuan street, to the South is Cau Dong street, and to the North is Hang Khoai street. The market is only about 800m from Hoan Kiem Lake, close to Long Bien station and Hang Ma street.",
    "image": "DongXuanMarket",
    "description": [
      {
        "title": "History:",
        "content": [
          "According to records, Dong Xuan Market existed before 1888, originally located south of the To Lich River flowing from Hang Ca street along Ngo Gach. Around 1889, when the To Lich River and Thai Cuc Lake were filled in, the French planned and relocated all shops into the empty land in Dong Xuan ward, forming Dong Xuan Market.",
          "In 1890, the French officially built Dong Xuan Market with 5 arched gates and 5 market halls, each 52m long, 19m high, and 25m wide, covering about 6,500 m². The façade followed French architectural style with 5 triangular sections, honeycomb-shaped ventilation holes, and corrugated iron roofs.",
          "Initially, the market opened every two days, but with growing economic demand, it later opened daily from morning to night.",
          "Around 1990, the market was reconstructed: two side rows were demolished, and the three central rows rebuilt into three floors. In 1994, a devastating fire destroyed nearly all stalls inside the market.",
          "In 1995, Dong Xuan Market was rebuilt with an investment of 68 billion VND. The three floors cover nearly 14,000 m² with about 2,000 stalls. Today, the market has trading areas, many staircases, entrances on all sides, two outdoor staircases, five staircases leading to upper floors, and an elevator system."
        ],
        "image": "DongXuanMarketHistory"
      }
    ],
    "activities": [
      {
        "image": "DongXuanMarketActivities",
        "content": [
          "Shopping at Dong Xuan Market is an exciting experience. As one of the largest wholesale markets in Northern Vietnam, it offers a wide variety of goods — from food, electronics, clothing, footwear to household products. Visitors can stroll through countless stalls, discovering the diversity and unique atmosphere of the market."
        ]
      },
      {
        "image": "DongXuanMarketActivities1",
        "content": [
          "Dong Xuan Night Market stretches from Hoan Kiem Lake through Hang Ngang, Hang Dao to the end of Hang Duong street, operating until midnight. Along the way, you will find countless stalls selling clothes, shoes, and food at affordable prices.",
          "Don’t miss the food alley near Dong Xuan Market, often called a 'food paradise in a small alley'. Though only about 200m long, it is packed with eateries serving countless delicious dishes at very reasonable prices, showcasing authentic Hanoi flavors."
        ]
      }
    ]
  },
  "West Lake": {
    "name": "West Lake",
    "introduction": "West Lake – the largest natural lake in Hanoi – is considered the 'green lung' of the capital. It not only offers poetic beauty but is also associated with many legends. Surrounding the lake are tree-lined roads, romantic lakeside cafés, and famous sites such as Tran Quoc Pagoda and Tay Ho Palace. Visitors can cycle, stroll, watch the sunset, and enjoy fresh air right in the heart of the city.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d29786.921698599304!2d105.80322226624347!3d21.058070808122626!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aafe7260066b%3A0x4c2c988309aaa3db!2zSOG7kyBUw6J5!5e0!3m2!1svi!2s!4v1759475214634!5m2!1svi!2s",
    "image": "WestLake",
    "location": "West Lake is located in the northwest of Hanoi, in Tay Ho District, about 11 km from the city center. It is the largest natural lake in Hanoi, covering about 500 hectares. The road around the lake is 18 km long, shaded by green trees. West Lake was formed from a branch of the Red River after the river changed course, leaving behind a vast freshwater lake.",
    "description": [
      {
        "title": "Formation History:",
        "image": "WestLake",
        "content": [
          "West Lake has existed since the time of the Hung Kings, then known as Lam Ap Wharf, a riverside wharf connected to the Red River. During the Ly and Tran dynasties, West Lake became a scenic retreat for kings and nobles, with many palaces built along its banks.",
          "Throughout history, West Lake has had many different names linked with legends and folklore: Dam Xac Cao (Fox Corpse Marsh), Lang Bac, Dam Dam, Tay Ho, Doai Ho.",
          "From wilderness and swamps, thanks to the reclamation efforts of many generations, including contributions from royal concubines of various dynasties, West Lake became a famous cultural and tourist attraction of Thang Long – Hanoi. If West Lake is considered the flower’s pistil, then the 'Thap Tam Trai' (13 hamlets) are its beautiful petals spreading fragrance."
        ]
      },
      {
        "title": "Historical Sites:",
        "image": "TranQuocPagoda",
        "content": [
          "Thuy Hoa Palace (Ly Dynasty): now part of Tran Quoc Pagoda area.",
          "Tu Hoa Palace (Ly Dynasty): now Kim Lien Pagoda.",
          "Thuy Chuong Palace (Le Dynasty): now the Chu Van An High School."
        ]
      },
      {
        "title": "Historical Stories:",
        "image": "WestLake3",
        "content": [
          "West Lake, previously known as Dam Xac Cao, Kim Nguu Lake, Lang Bac, Dam Dam, Doai Ho, is the largest natural lake in Hanoi’s inner city. It covers more than 500 hectares with a circumference of 18 km, located northwest of Hanoi’s center. Historical geography proves West Lake was once part of the Red River before its course changed.",
          "According to the 'Tay Ho Chronicles', West Lake dates back to the Hung Kings era when it was a wharf along the Red River, called Lam Ap Wharf in Long Do village. During the Trung Sisters’ time, the wharf was connected to the Red River. Surrounding the lake were dense forests of bamboo, ebony, reed, and valuable wildlife. The western shore had Gia La Cave (now Quan La, Xuan La ward), the eastern shore had Nha Lam Cave (now Yen Ninh and Hoe Nhai streets), and the southern shore had Binh Sa Cave (later Giap Co Xa, now part of Hoan Kiem District). The population here was sparse, living mainly by hunting and fishing.",
          "Geographically, West Lake is an exogenous lake with a basin-like shape, proven to be part of the ancient Red River. The 'Dai Viet Chronicles' record that in 1044, Emperor Ly Thai Tong used West Lake (then called Dam Dam) as a place to trap wild elephants using a tamed elephant from Champa.",
          "For centuries, West Lake has been a famous landscape. During the Ly and Tran dynasties, kings built palaces around it as resorts and entertainment venues, such as Thuy Hoa and Tu Hoa Palaces (Ly Dynasty, now Kim Lien Pagoda) and Ham Nguyen Palace (Tran Dynasty, now Tran Quoc Pagoda). Legend says Princess Tu Hoa, daughter of King Ly Than Tong, turned the area into mulberry and silk farms with her maidens, establishing Nghi Tam village as a silk-weaving center.",
          "During the Tran Dynasty, Princess Tuc Trinh, daughter of King Tran Thanh Tong, contributed to reclaiming land around West Lake, helping poor peasants establish settlements like Co Nhue Village.",
          "In the 17th century, Concubine Vu Thi Ngoc Xuyen, wife of Lord Trinh Tac, helped people reclaim wastelands in Minh Cao – Xuan Dinh (now Tay Ho District). In the past, migratory birds such as coots from West Lake were considered delicacies offered to the king, but due to overhunting and environmental changes, the birds disappeared around 1994."
        ]
      }
    ]
  },
  "Hoa Lo Prison": {
    "name": "Hoa Lo Prison",
    "introduction": "Hoa Lo Prison was built in the late 19th century during the French colonial period. It was a place where many Vietnamese revolutionary soldiers were imprisoned. Today, the site has become one of Hanoi’s most notable historical attractions, allowing visitors to learn about the struggle for independence, admire precious artifacts, and feel the resilient and indomitable spirit of the Vietnamese people.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.1836948816194!2d105.84390317515307!3d21.02533468789649!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab96aa51de95%3A0x9701e10bee31af54!2zRGkgdMOtY2ggTmjDoCB0w7kgSOG7j2EgTMOy!5e0!3m2!1svi!2s!4v1759475254542!5m2!1svi!2s",
    "location": "Hoa Lo Prison is located at No. 1 Hoa Lo Street, Tran Hung Dao Ward, Hoan Kiem District, Hanoi City.",
    "image": "HoaLoPrison",
    "description": [
      {
        "title": "Opening Hours",
        "content": [
          "The site is open daily, including holidays and weekends, from 8:00 AM to 5:00 PM.",
          "The entrance fee is quite reasonable, around 30,000 VND per person. Discounts or free admission are available for certain groups such as students, the elderly, and people with contributions to the revolution."
        ]
      },
      {
        "title": "History",
        "image": "HoaLoPrisonHistory",
        "content": [
          "Hoa Lo Prison was built in 1896 and was originally named Prison Centrale. However, to avoid public curiosity and agitation, the name was changed to Maison Centrale, which is still inscribed on the main gate. The prison was constructed on the outskirts of Hanoi as a central detention facility for both Tonkin and Annam. It mainly held political prisoners and patriotic activists opposing colonial rule. In the bustling capital, Hoa Lo Prison stood as a grim reminder of Vietnam’s turbulent history. Known as 'Hell on Earth,' the prison became infamous for its brutal architecture designed for torture and coercion. The guillotine used here made Hoa Lo one of the world’s most notorious prisons."
        ]
      },
      {
        "title": "Architecture of Hoa Lo Prison",
        "image": "HoaLoPrisonArchitecture",
        "content": [
          "The prison originally covered an area of more than 12,000 m². Today, only 2,434 m² has been preserved as a historical relic. The prison was built on the land of Phu Khanh village, a traditional pottery village where kilns once burned day and night, giving the area its name 'Hoa Lo' (literally 'furnace'). During the French colonial era, the prison was designed with 4-meter-high, 0.5-meter-thick stone walls reinforced with electrified barbed wire. The compound was divided into four sections: - Zones A and B: for prisoners under investigation, minor offenders, or those violating prison discipline. - Zone C: for French or foreign prisoners. - Zone D: for prisoners awaiting execution."
        ]
      },
      {
        "title": "Stories of Hoa Lo Prison",
        "image": "HoaLoPrison2",
        "content": [
          "Nicknamed 'Hell on Earth,' Hoa Lo Prison was designed to hold about 500 prisoners. Cells were built with harsh and inhumane conditions of detention and torture.",
          "From a once-famous pottery village, the French turned Hoa Lo into a place of physical and mental torment for thousands of patriotic fighters. Despite harsh imprisonment, Vietnamese revolutionaries transformed the prison into a school of revolution, spreading political theory and maintaining resistance.",
          "Many prominent Vietnamese leaders were imprisoned here, including Phan Boi Chau, Luong Van Can, Nguyen Quyen, Ho Tung Mau, Nguyen Luong Bang, as well as five General Secretaries of the Communist Party of Vietnam: Nguyen Van Cu, Truong Chinh, Le Duan, Nguyen Van Linh, and Do Muoi.",
          "Visitors can still see many brutal tools of torture once used here: guillotines, electric shock machines, and clubs. All prison doors, locks, and shackles were specially imported from France and strictly managed.",
          "The massive guillotine was the most infamous instrument, making Hoa Lo one of the world’s most notorious prisons. Visitors often feel chills at the sight of reconstructed scenes of torture and execution.",
          "Prisoners were shackled for hours, days, even years. Despite enduring unimaginable suffering, political prisoners remained steadfast, inspiring admiration for their resilience.",
          "The images of brutal floggings, trials, and tortures remain etched in the memory of the Vietnamese people. Every corner of Hoa Lo vividly depicts the suffering and sacrifice of revolutionaries in their struggle for independence.",
          "The prison was surrounded by 4-meter-high stone and reinforced concrete walls topped with electrified barbed wire. Guard towers at each corner enabled total surveillance. Iron doors, locks, and shackles were all imported from France. Cells and dark solitary confinement rooms were overcrowded and suffocating, ruled by notorious wardens who did not hesitate to crush prisoners mercilessly.",
          "Yet, despite the repression, the spirit of patriotism and revolution never died. Secret revolutionary meetings, political education, and propaganda activities continued, even under brutal conditions.",
          "Revolutionary publications such as 'Prison Life' and 'Prison Magazine' were created inside the prison itself, spreading awareness and igniting the flame of revolution even within the enemy’s stronghold. These efforts brought hope and light to an otherwise dark prison life."
        ]
      }
    ]
  },
  "Long Bien Bridge": {
    "name": "Long Bien Bridge",
    "introduction": "Long Bien Bridge, built by the French in 1902, was the first steel bridge across the Red River and has become a historical symbol of Hanoi. For more than a century, it has stood as a witness to wars and the resilience of the capital through many ups and downs. Today, Long Bien Bridge is not only a site rich in historical value but also an ideal place to watch the sunrise, sunset, and enjoy the poetic beauty of the Red River.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.7406202206075!2d105.85526187515349!3d21.043061987287384!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abc8ca5f2f8f%3A0x6952d77987cbb0b!2zQ-G6p3UgTG9uZyBCacOqbiwgSMOgIE7hu5lpLCBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759475296359!5m2!1svi!2s",
    "image": "LongBienBridge",
    "location": "Long Bien Bridge crosses the Red River, connecting Hoan Kiem, Ba Dinh, and Long Bien districts of Hanoi. Although located near the Old Quarter, traveling to the bridge often faces heavy traffic congestion during rush hours from 06:00 – 09:00 and 16:00 – 19:30.",
    "description": [
      {
        "title": "Construction Period",
        "content": [
          "Long Bien Bridge was initiated by the French colonial government on September 12, 1898, with the aim of connecting transportation and facilitating colonial exploitation. After more than three years, construction was completed on February 3, 1902, and the inauguration ceremony took place on February 28, 1902. At that time, the bridge was named after the Governor-General of Indochina, Paul Doumer, but local people commonly called it 'Cau Song Cai' (Big River Bridge). In 1945, Hanoi Mayor Tran Van Lai renamed it Long Bien Bridge."
        ]
      },
      {
        "title": "Unique Architecture",
        "image": "LongBienBridge1",
        "content": [
          "Long Bien Bridge is 2,290 meters long across the river and has 896 meters of approach spans, consisting of 19 steel trusses and 20 tall piers. At the time of its inauguration, it was compared to a horizontal Eiffel Tower, being the second-longest bridge in the world after the Brooklyn Bridge in the US.",
          "The bridge is 4.75 meters wide, divided into three main lanes: a single railway track in the middle, two side lanes for cars, motorbikes, bicycles, and pedestrian walkways on the outermost edges.",
          "Architecturally, the bridge is remarkable for its harmonious design, with a layered steel structure resembling a winding dragon — strong, proud, yet graceful. The entire bridge was built with high-quality steel using advanced construction techniques, ensuring both aesthetics and safety.",
          "Today, Hanoi has many other bridges crossing the Red River such as Chuong Duong, Thang Long, Thanh Tri, Vinh Tuy, and Nhat Tan bridges. However, Long Bien Bridge remains an irreplaceable symbol of the capital, thanks to its historic architecture and more than 120 years of legacy."
        ]
      },
      {
        "title": "Historical Background",
        "image": "LongBienBridgeHistory",
        "content": [
          "The bridge, now over 120 years old, originated from an idea of the Governor-General of Indochina. In 1897, Paul Doumer ordered a study and quick decision on building a bridge across the Red River in Hanoi.",
          "At that time, Hanoi was separated from the provinces on the left bank of the Red River by a river more than 1,700 meters wide with shifting sandbanks. Crossing the river was difficult, costly, and often dangerous, as the Red River was known for its ferocity, especially during flood season.",
          "With a depth of over 20 meters and rising up to 8 meters during floods, the constantly shifting riverbed posed a great engineering challenge. Many skeptics considered building piers in such conditions a risky venture.",
          "A public tender for the construction was published in the Indochina Gazette in 1897. Six companies submitted bids, and Daydé & Pillé won with Proposal B, costing nearly 5.4 million francs, featuring 19 cantilever spans — a design first applied in the Tolbiac Bridge on the Paris-Orleans railway. Daydé & Pillé had extensive experience, having built Briare Canal Bridge, Mirabeau Bridge, Bordeaux-Saint-Jean Station, and the Grand Palais in Paris.",
          "On September 12, 1898, the foundation stone was laid. The most difficult task was building piers at depths of 30 meters, achieved using compressed air techniques invented by engineer Jacques Triger. Archival documents and illustrations depict the entire process, from sinking compressed-air caissons, regulating pressure, soil excavation, to pouring concrete. Construction was carried out within seven months each year, pausing during flood season."
        ]
      },
      {
        "title": "Witness of History",
        "image": "LongBienBridge2",
        "content": [
          "For 120 years, Long Bien Bridge has been a witness to many historical events in Hanoi. In 1902, Emperor Thanh Thai and the new Governor-General boarded a train from Hanoi station to officially inaugurate the bridge. Over the years, the bridge underwent several repairs and expansions, including widening the two sidewalks from 1.3m to 2.2m to accommodate more traffic and pedestrians.",
          "In 1945, Dr. Tran Van Lai, the first Vietnamese Mayor of Hanoi, renamed the bridge from Doumer Bridge to Long Bien Bridge. In 1946–1947, both French and Vietnamese troops guarded the bridge. In 1954, the bridge witnessed history once again when French troops withdrew to Hai Phong via the bridge while Vietnamese soldiers took over after the Liberation of Hanoi on October 10.",
          "During the resistance war against the US, Long Bien Bridge endured fierce battles and heavy bombings, which repeatedly destroyed parts of the bridge.",
          "In 1972, during the 12-day US bombing campaign, the bridge was heavily damaged. The crossing of large military vehicles also contributed to its deterioration, requiring multiple repairs. Rare photographs show the collapsed spans after bombings, alongside documents and images of reconstruction efforts.",
          "Alongside these historical stories, community memories of Long Bien Bridge have also been preserved, including photographs by five photographers, paintings by artist Tran Anh Tuan, and a bamboo model of the bridge donated to the National Archives Center I.",
          "Today, Long Bien Bridge remains a symbol of Hanoi’s wartime resilience. Exhibitions and stories about the bridge help younger generations understand not only its historic role but also a vital part of Hanoi’s past."
        ]
      }
    ]
  },
  "Ho Chi Minh Museum": {
    "name": "Ho Chi Minh Museum",
    "introduction": "Ho Chi Minh Museum is one of the largest cultural projects in Vietnam, inaugurated in 1990 to celebrate the 100th birthday of President Ho Chi Minh. The museum displays tens of thousands of valuable artifacts and documents about his life, revolutionary career, and ideology. Visiting the museum gives visitors an opportunity to learn more deeply about this great leader as well as Vietnam's struggle for independence.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.9260209792596!2d105.83008817515338!3d21.035645887542305!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba02e1deb6f%3A0x949d893f040b49d1!2zQuG6o28gdMOgbmcgSOG7kyBDaMOtIE1pbmg!5e0!3m2!1svi!2s!4v1759475330555!5m2!1svi!2s",
    "image": "HoChiMinhMuseum",
    "location": "Located at No.19 Ngoc Ha, Ba Dinh District, Hanoi, near Ho Chi Minh Mausoleum, this museum is an essential stop for any Hanoi itinerary. Construction started in 1985, and the museum officially opened on May 19, 1990, to commemorate the 100th anniversary of President Ho Chi Minh's birth.",
    "description": [
      {
        "title": "Opening Hours",
        "content": [
          "Tuesday, Wednesday, Thursday, Saturday, Sunday: 8:00 AM - 12:00 PM | 2:00 PM - 4:30 PM. The museum charges an entrance fee for foreign visitors: 40,000 VND/person. There is a 50% discount for students and children under 14. Admission is free for Vietnamese veterans, people with disabilities, and members of the International Council of Museums (ICOM)."
        ]
      },
      {
        "title": "Construction Period",
        "image": "HoChiMinhMuseum1",
        "content": [
          "Ho Chi Minh Museum construction began on August 31, 1985, and was completed to coincide with the 100th anniversary of Ho Chi Minh's birth on May 19, 1990. The Soviet people contributed significantly to the design and construction. The museum has three floors and impresses visitors with its unique architecture and a vast collection of artifacts."
        ]
      },
      {
        "title": "Museum Architecture",
        "image": "HoChiMinhMuseum2",
        "content": [
          "Floor 1 – displays the biography of Ho Chi Minh: Visitors enter the main hall to see an impressive bronze portrait of President Ho Chi Minh. The exhibition continues with images, documents, and artifacts depicting his life and major milestones in the revolutionary movement and nation-building according to his will. The exhibits are organized into nine main themes:",
          "Theme 1: Artifacts and images depicting Ho Chi Minh's childhood and youth in Nghe An from 1890–1910. Theme 2: Exhibits on his challenging journey abroad from 1911–1920 to find a way to save the nation. During this period, he worked, studied, and researched revolutionary methods. Theme 3: Images and documents about Ho Chi Minh’s activities in France. Theme 4: Materials on the formation of Ho Chi Minh’s ideology and his practical activities leading to the establishment of the Communist Party of Vietnam. Theme 5: Artifacts from the period of party formation and independence struggle, including documents from his imprisonment in Hong Kong and Guangxi. Theme 6: Items illustrating Ho Chi Minh’s life during the 9-year resistance in the Northwest forests from 1945–1954 to protect the new government. Theme 7: Exhibits on his diplomatic activities and nation-building efforts in the North and the struggle for independence in the South. Theme 8: Documents about his final years and passing in 1969. Theme 9: Summarizes his activities and legacy left for the nation."
        ]
      },
      {
        "image": "HoChiMinhMuseum3",
        "content": [
          "Floor 2 – recreates the glorious victories led by Ho Chi Minh: The themes from Floor 1 are expanded to provide a deeper understanding of the independence struggle and victories under his leadership. Artifacts and documents depict Vietnam and the world at that time, as well as the significance of the Russian October Revolution and Vietnam's role in the global revolutionary movement. The remaining space on the second floor displays exhibits about Vietnam during the renovation period."
        ]
      },
      {
        "content": [
          "Floor 3 – highlights important historical milestones in Ho Chi Minh's life: The third floor presents exhibits on regional and world historical events that greatly influenced the young Nguyen Tat Thanh on his path to becoming the revered national leader."
        ]
      },
      {
        "title": "Visitor Guidelines",
        "content": [
          "As a solemn museum of great historical significance, visitors must strictly follow the rules:",
          "Dress respectfully and neatly, do not wear hats, follow guided routes, avoid pushing, and give way to elderly or disabled visitors.",
          "Do not bring drugs, flammable materials, weapons, hazardous substances, or pollutants into the museum.",
          "Place luggage, backpacks, and bags in designated areas.",
          "Maintain cleanliness, do not smoke or eat, and avoid making noise.",
          "Do not touch images, documents, artifacts, or equipment in the museum.",
          "Children under 10 must be accompanied by adults or organized groups.",
          "Contact the museum management for filming or photography requests."
        ]
      }
    ]
  },
  "Ho Chi Minh Stilt House": {
    "name": "Ho Chi Minh Stilt House",
    "introduction": "Ho Chi Minh Stilt House, located within the Presidential Palace complex, was built in 1958 and served as the residence and working place of President Ho Chi Minh for the last 11 years of his life. This simple wooden house, surrounded by gardens and a serene fish pond, reflects his modest lifestyle and closeness to nature. Visiting the house allows tourists to learn about his daily life and deeply appreciate the ethical example and simple lifestyle of this revered leader.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.8630960645824!2d105.83059557515342!3d21.03816318745575!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba6cb40909b%3A0x15d0fe7c07f55c3b!2zTmjDoCBzw6BuIELDoWMgSOG7kw!5e0!3m2!1svi!2s!4v1759475373642!5m2!1svi!2s",
    "image": "StiltHouse",
    "location": "Ho Chi Minh Stilt House is located within the Presidential Palace Historical Site, in Ngoc Ha Ward, Ba Dinh District, Hanoi.",
    "description": [
      {
        "image": "StiltHouse2",
        "content": [
          "In addition to Ho Chi Minh’s stilt house in Nghe An, the stilt house in Hanoi is also a popular tourist attraction. With great historical and cultural value, it has become one of the most famous destinations in Hanoi.",
          "Ho Chi Minh Stilt House was inaugurated on May 17, 1958, to celebrate the 68th birthday of President Ho Chi Minh. Hidden beneath the lush trees behind the Presidential Palace garden, the house is surrounded by green hibiscus fences and a welcoming gate made of interwoven branches. Located in the midst of a green garden, the house stands as a clear symbol of his simple lifestyle.",
          "This is where President Ho Chi Minh lived and worked the longest during his revolutionary activities. It was also a place to welcome state leaders, official delegations, and millions of Vietnamese visitors from across the country.",
          "Getting there: The house is near Ho Chi Minh Mausoleum and can be easily reached by personal or public transport. If traveling by personal vehicle, visitors can take various routes. After arriving at the Mausoleum, park at No.19 Ngoc Ha Street, near the entrance of Ho Chi Minh Museum, or on Ong Ich Khiem Street opposite the Ministry of Defense. If using public buses, take routes 09, 18, 22, 33, 45, or 50; all stop at No.18A Le Hong Phong Street."
        ]
      },
      {
        "title": "Opening Hours",
        "content": [
          "Summer (April 1 - October 31): Morning: 7:30 AM - 11:00 AM | Afternoon: 1:30 PM - 4:00 PM",
          "Winter (November 1 - March 31): Morning: 8:00 AM - 11:00 AM | Afternoon: 1:30 PM - 4:00 PM"
        ]
      },
      {
        "title": "Ho Chi Minh Stilt House",
        "image": "StiltHouse1",
        "content": [
          "Visitors can admire the unique architecture of Ho Chi Minh Stilt House, designed in the traditional stilt house style of ethnic minorities. The house is 10.5 meters long and 6.2 meters wide, with two floors. The ground floor served as Ho Chi Minh’s workspace in summer, the Politburo meeting room, and a reception area for close guests. The upper floor has two rooms, each about 10m², used for rest and work.",
          "The house is made of sturdy wood with a tiled roof and surrounding blinds, creating a cozy, familiar feeling. Visiting the house, tourists can learn more about Ho Chi Minh’s simple lifestyle, reflected in everyday items such as his bed, desk, chairs, bookshelves, and typewriter. Guides can provide detailed explanations about the house, giving further insight into his daily life.",
          "Besides exploring the architecture, visitors can relax and enjoy the spacious 'Ho Chi Minh Fish Pond,' where he rested and fed the fish after work."
        ]
      },
      {
        "title": "Visitor Guidelines",
        "content": [
          "Dress respectfully and properly; avoid wearing overly short clothing.",
          "Walk quietly, speak softly, line up properly, and avoid making noise.",
          "Follow the museum’s luggage deposit regulations.",
          "Do not bring electronic devices, valuable jewelry, food, or metal objects.",
          "No photography or filming in restricted areas.",
          "Children under 3 years old are not allowed inside."
        ]
      }
    ]
  },
  "Vietnam Museum of Ethnology": {
    "name": "Vietnam Museum of Ethnology",
    "introduction": "The Vietnam Museum of Ethnology preserves and displays over 15,000 artifacts, images, and documentary films about the 54 ethnic groups across the country. With both indoor and outdoor exhibition spaces, visitors can admire traditional costumes, musical instruments, household items, and authentically reconstructed ethnic houses. It is an ideal destination to explore the culture, customs, and rich diversity of Vietnam’s ethnic communities.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.808496822009!2d105.7961604751534!3d21.040347187380686!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab394353b821%3A0x47c950bb0f081a1c!2zQuG6o28gdMOgbmcgRMOibiB04buZYyBo4buNYyBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759474766377!5m2!1svi!2s",
    "image": "VietnamMuseumOfEthnology",
    "location": "Located on Nguyen Van Huyen Street, Hanoi, the Vietnam Museum of Ethnology is one of the city's most famous museums, conveniently situated about 8 km from the city center in Cau Giay District.",
    "description": [
      {
        "title": "History",
        "content": [
          "The Vietnam Museum of Ethnology began construction in 1981 with an initial area of 3.27 hectares. Later, an additional hectare was added, expanding the total area to 4.4 hectares. The museum is considered a miniature world, showcasing the history and culture of 54 Vietnamese ethnic groups through a wide range of exhibits including clothing, jewelry, weapons, musical instruments, and more.",
          "The museum is an ideal destination for students, cultural enthusiasts, and tourists. It provides authentic knowledge about customs, daily life, and characteristics of each ethnic group. Additionally, the museum organizes various educational activities highly appreciated by visitors."
        ],
        "image": "VietnamMuseumOfEthnology1"
      },
      {
        "title": "Opening Hours",
        "content": [
          "Open daily from 8:30 AM to 5:30 PM.",
          "Closed on Mondays and during Tet (Lunar New Year)."
        ]
      },
      {
        "title": "Entrance Fees",
        "content": [
          "Visitors: 40,000 VND/person",
          "Students: 15,000 VND/person",
          "Schoolchildren: 10,000 VND/person",
          "Senior citizens / People with disabilities / Ethnic minorities: 50% discount",
          "Children under 6 / Severely disabled / ICOM members / Journalists / Sponsors: Free",
          "Additional services: Indoor & outdoor guided tours in Vietnamese: 50,000 VND; Indoor guided tours in English or French: 100,000 VND"
        ]
      },
      {
        "title": "Museum Layout",
        "content": [
          "The museum is divided into three main areas, both outdoors and indoors, for visitors to explore:",
          "Architectural Garden: This 2-hectare outdoor area displays authentic houses of ethnic groups from the Central Highlands and Northern Mountains. Visitors can explore 10 reconstructed models including Rong houses, stilt houses, tiled houses, etc. Every detail, from entrances, wells, to stairs, is meticulously reproduced, creating a lively space reflecting the unique characteristics of each ethnic group."
        ],
        "image": "VietnamMuseumOfEthnology2"
      },
      {
        "content": [
          "Dong Son Drum Exhibition: Visitors can learn about traditional religious rituals, admire traditional costumes, old labor tools, and household items. With over 15,000 artifacts and more than 42,000 films and audio recordings, this exhibition is a crucial part of the museum, showcasing the unique culture of Vietnam's 54 ethnic groups."
        ],
        "image": "VietnamMuseumOfEthnology3"
      },
      {
        "content": [
          "Kite Exhibition: Visitors can discover interesting customs and daily life of people in Southeast Asian countries. This area also hosts educational activities, film screenings, and cultural exchanges about Vietnam’s ethnic groups and those of ASEAN countries."
        ],
        "image": "VietnamMuseumOfEthnology4"
      },
      {
        "content": [
          "The museum offers traditional folk games such as: throwing balls, swinging, walking on suspended bridges, and balance games. These unique experiences are a must-try for visitors."
        ],
        "image": "VietnamMuseumOfEthnology5"
      },
      {
        "content": [
          "Visitors can also enjoy folk art performances such as:",
          "Water Puppetry: This performance reflects daily life and stories of ethnic groups through lively water puppets. Ticket price: 90,000 VND/adult, 70,000 VND/child. Morning shows are free.",
          "Quan Ho Folk Singing from Bac Ninh: Visitors can enjoy Quan Ho folk singing performances and interact with artists. Those confident in singing can participate and perform during the shows."
        ],
        "image": "VietnamMuseumOfEthnology6"
      },
      {
        "title": "Visitor Guidelines",
        "content": [
          "Avoid visiting with large groups to ensure a quality experience.",
          "Guided tours are available in Vietnamese, English, and French. You can request on-site, purchase tickets at the entrance, or register in advance.",
          "Do not bring weapons, flammable, explosive, or toxic materials.",
          "Carry money and valuable items with you.",
          "Maintain cleanliness and avoid causing noise.",
          "Do not bring food or beverages inside the museum.",
          "Do not touch, move, or sit on exhibits.",
          "No pets allowed inside the museum."
        ]
      }
    ]
  },
  "Vietnam National Museum of History": {
    "name": "Vietnam National Museum of History",
    "introduction": "Located in the heart of Hanoi, the Vietnam National Museum of History preserves and exhibits tens of thousands of valuable artifacts reflecting Vietnam’s history from prehistoric times to the modern era. With unique French colonial architecture combined with scientific displays, the museum offers visitors a journey through ancient cultures, feudal dynasties, revolutionary movements, and the nation’s historical heritage. It is a must-visit for anyone seeking an in-depth understanding of Vietnam's history.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.204311178126!2d105.8567948751531!3d21.024509487924828!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abe9661234d7%3A0x7d497bffb5ce2892!2zQuG6o28gdMOgbmcgTOG7i2NoIHPhu60gUXXhu5FjIGdpYQ!5e0!3m2!1svi!2s!4v1759475412261!5m2!1svi!2s",
    "location": "No. 1 Trang Tien, Cua Nam, Hanoi || No. 216 Tran Quang Khai, Hoan Kiem, Hanoi",
    "image": "VietnamNationalMuseumOfHistory",
    "description": [
      {
        "title": "Opening Hours",
        "content": [
          "Morning: 8:00 AM to 12:00 PM",
          "Afternoon: 1:30 PM to 5:00 PM",
          "(Open every day of the week except the first Monday of each month)"
        ]
      },
      {
        "title": "Entrance Fees",
        "content": [
          "Adults: 40,000 VND/person",
          "University, college, vocational students: 20,000 VND/person",
          "Schoolchildren: 10,000 VND/person",
          "Free admission for children under 6 and severely disabled persons according to current regulations",
          "Discounts: 50% off for eligible groups, senior citizens, and severely disabled persons according to current regulations"
        ]
      },
      {
        "title": "Other Fees",
        "content": [
          "Photography: 15,000 VND/camera",
          "Filming: 30,000 VND/camera"
        ]
      },
      {
        "title": "History",
        "image": "VietnamNationalMuseumOfHistory1",
        "content": [
          "The Vietnam National Museum of History was established by merging the Vietnam History Museum and the Vietnamese Revolutionary Museum. It is located in central Hanoi near many sacred historical sites such as Turtle Tower - Hoan Kiem Lake; The Huc Bridge - Ngoc Son Temple - Pen Tower, etc. The museum showcases Vietnam's history from prehistoric times to the present through an extensive collection of documents, artifacts, and images, including many National Treasures. The Trang Tien site displays Vietnam's history up to the end of the Nguyen Dynasty in 1945, while the Tran Quang Khai site exhibits history from the mid-19th century to today."
        ]
      },
      {
        "content": [
          "The museum currently preserves and displays over 200,000 artifacts and documents about Vietnam's history and culture. From prehistory to 1945, nearly 110,000 items are preserved, including relics, antiques, and 20 National Treasures.",
          "The rare collections include cultures from the Paleolithic, Bronze Age, Early Iron Age, Dong Son Culture, ancient Vietnamese ceramics, Le-Nguyen period bronzes, Cham stone sculpture, and decorative arts from China, Japan, India, and Southeast Asia.",
          "From the mid-19th century to the present, the museum holds about 80,000 artifacts and documents on Vietnam's revolutionary history, the Communist Party of Vietnam, Ho Chi Minh, and other Party leaders.",
          "The museum is a member of the International Council of Museums (ICOM) and a founding member of the Asian National Museums Association (ANMA). It regularly exchanges experience and cooperates with nearly 30 museums regionally and internationally. In 2013, it hosted the 4th ANMA Conference in Hanoi.",
          "Visiting the Vietnam National Museum of History offers a deep insight into the country’s long-standing cultural heritage and instills pride in the resilient spirit of past generations in building and protecting the nation."
        ],
        "image": "VietnamNationalMuseumOfHistory2"
      },
      {
        "content": [
          "Prehistoric Period in Vietnam: Exhibits show human traces across mountainous, midland, lowland, and coastal areas. These include hominid teeth, tools, and fossilized animal remains. The Neolithic era shows new developments in polished stone tools, pottery, and early agriculture.",
          "Nation-building Period: Early Vietnamese mastered bronze smelting, ironworking, and the production of tools, jewelry, and weapons. By the middle of the 1st millennium BCE, three major cultural centers appeared in Vietnam, forming the foundation for ancient states: Dong Son Culture (Van Lang and Au Lac), Dong Nai and Oc Eo Culture (Funan Kingdom), and Sa Huynh Culture (Champa Kingdom).",
          "Post-Christ Era (1st-10th century): In 111 BCE, Vietnam was under Northern dynasties’ rule. In 938, Ngo Quyen’s victory at Bach Dang River ended 1,000 years of Northern domination, inaugurating an era of independence under the Ngo, Dinh, Early Le (939-1009), Ly-Tran (1009-1400), Ho (1400-1407), Le-Mac (1428-1788), Tay Son (1778-1802), and Nguyen (1802-1945) dynasties."
        ],
        "image": "VietnamNationalMuseumOfHistory3"
      },
      {
        "content": [
          "The Tran Quang Khai site preserves artifacts and historical documents from mid-19th century Vietnam. Originally the Indochina Department of Commerce, it was converted into a museum in 1954. Exhibits include:",
          "Struggle for national independence (1858-1945)",
          "30-year resistance against foreign invaders (1945-1975)",
          "Nation-building from 1976 to the present"
        ],
        "image": "VietnamNationalMuseumOfHistory4"
      },
      {
        "content": [
          "The museum showcases unique French romantic architecture. The façade is designed to create a large exhibition space with an octagonal main hall, each side measuring 11 meters. The rectangular rear hall extends through rooms with careful planning.",
          "The ground floor houses exhibition spaces, storage, warehouses, and administrative offices. It is designed with moisture control to keep exhibits dry in Hanoi’s humid weather. The building features a multi-tiered octagonal roof with three layers of varying slopes. The lower roof is wider, providing shade and rain protection, supported by double columns and stylized bracket systems, reflecting strong East Asian aesthetics."
        ],
        "image": "VietnamNationalMuseumOfHistory5"
      },
      {
        "content": [
          "Participate in educational programs at the museum: Visitors can admire invaluable artifacts from prehistoric times to the present. Interactive activities in the Discovery Room include trying on traditional costumes, making handicrafts, and playing folk games. Children can join special educational programs such as the Young History Club and History Lessons, offering a lively and engaging way to learn about history."
        ],
        "image": "VietnamNationalMuseumOfHistory6"
      }
    ]
  },
  "Vietnam Women’s Museum": {
    "name": "Vietnam Women’s Museum",
    "introduction": "The Vietnam Women’s Museum is a unique destination in Hanoi, exhibiting over 40,000 artifacts about the roles, lives, and contributions of women in family, society, and national history. Covering themes such as women in the family, women in war, traditional and modern fashion, the museum offers an insightful and emotional perspective on Vietnamese women through the ages. It is a culturally rich and inspiring place for both domestic and international visitors.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.204311178126!2d105.8567948751531!3d21.024509487924828!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab0015696227%3A0x3826297573752daa!2zQuG6o28gdMOgbmcgUGjhu6UgbuG7ryBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759475441712!5m2!1svi!2s",
    "location": "36 Ly Thuong Kiet, Cua Nam Ward, Hanoi. (Vietnam Women’s Museum is located in a prime central area, making it one of Hanoi’s most visited attractions. It is on Ly Thuong Kiet Street, about a 10-minute walk from Hoan Kiem Lake.)",
    "image": "VietnameseWomenMuseum",
    "description": [
      {
        "title": "History",
        "content": [
          "The Vietnam Women’s Museum was established in 1987 and officially inaugurated in 1995, under the Vietnam Women’s Union. Since opening, the museum has successfully organized many exhibitions to showcase domestic and international visitors collections of historical and cultural significance related to Vietnamese women."
        ]
      },
      {
        "title": "Opening Hours",
        "content": [
          "08:00 – 17:00 from Monday to Sunday",
          "The museum welcomes visitors every day of the week, from 8 AM to 5 PM."
        ]
      },
      {
        "title": "Admission Fees",
        "content": [
          "Adults: 40,000 VND/person",
          "Students: 20,000 VND/person",
          "Children under 10: free",
          "The above fees are for reference only. Ticket prices may vary depending on the period or accompanying services/events."
        ]
      },
      {
        "content": [
          "The permanent exhibition spans the 2nd, 3rd, and 4th floors, featuring over 1,000 documents, artifacts, and images with three main themes: Women in Family, Women in History, and Women’s Fashion.",
          "Women in Family: Located on the 2nd floor, this theme highlights the image of Vietnamese women as wives and mothers, also showcasing rituals, customs, and traditions related to marriage, childbirth, and family life.",
          "Women in History: Located on the 3rd floor, this theme presents the roles and contributions of Vietnamese women with qualities such as kindness, resilience, strength, and capability, demonstrated during historical resistance movements and modern nation-building."
        ],
        "image": "VietnameseWomenMuseum2"
      },
      {
        "content": [
          "Women’s Fashion: Located on the 4th floor, this exhibition showcases clothing, jewelry, makeup, and other items from women of Vietnam’s 54 ethnic groups, reflecting the cultural characteristics of each region."
        ],
        "image": "VietnameseWomenMuseum1"
      },
      {
        "content": [
          "After research, the museum presents exhibitions on various topics related to history, culture, social issues, and gender equality, providing visitors with diverse perspectives on Vietnamese women.",
          "Mother Worship Faith: The exhibition “Mother Worship: Mind – Beauty – Joy” conveys the local cultural values of the mother worship faith – a spiritual cultural activity related to women.",
          "Contemporary Art Space: Located on the 5th floor, this area allows young artists to freely express their creativity in culture and art.",
          "Entrepreneurship Journey: This exhibition features 15 exemplary Vietnamese women who have strived to overcome challenges and achieve initial success in fields such as child education, vocational training, healthcare for people with disabilities, community tourism, and clean food production."
        ],
        "image": "VietnameseWomenMuseum3"
      },
      {
        "content": [
          "The Vietnam Women’s Museum also conducts online exhibitions on its website, allowing visitors and the public to follow past events and displays. Some current online exhibitions include:",
          "Livable Countryside",
          "Peace After the Storm",
          "Aspiring to Shine",
          "Where I Live",
          "Protecting the Borders",
          "Female General in Scarf"
        ]
      },
      {
        "content": [
          "Currently, the Vietnam Women’s Museum preserves nearly 30,000 documents and artifacts covering various themes related to Vietnamese women throughout the nation’s history.",
          "To provide the most accurate and comprehensive view of these artifacts, the museum carefully researches, selects, and arranges them by themes for each collection."
        ],
        "image": "VietnameseWomenMuseum4"
      },
      {
        "title": "Services at the Vietnam Women’s Museum",
        "content": [
          "Audio Guide – automated narration in Vietnamese, English, French, Japanese, Korean.",
          "Special guided tours for international visitors.",
          "Extracurricular activities for children.",
          "Tour guide services for groups.",
          "Souvenir shop and café.",
          "Conference and seminar facilities.",
          "Free amenities: Wi-Fi, lockers, wheelchair access, elevators, etc."
        ]
      }
    ]
  },
  "Giong Temple": {
    "name": "Giong Temple",
    "introduction": "Giong Temple in Soc Son, Hanoi, is a complex of relics associated with the legend of Saint Giong – the hero who defeated the An invaders. The complex includes many structures such as the Upper Temple, Lower Temple, Mother Temple, and Kien So Pagoda, carrying both historical value and spiritual significance. Every year, the Giong Festival is celebrated grandly, attracting numerous visitors who come to honor Saint Giong and explore the beauty of traditional Vietnamese culture.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d119149.94397837254!2d105.73732702911167!3d21.055251515617925!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135a8707f85a527%3A0xcad75e483eb36f9c!2zxJDDqsyAbiBHacOzbmcgUGjDuSDEkOG7lW5n!5e0!3m2!1svi!2s!4v1759475525997!5m2!1svi!2s",
    "location": "Giong Temple in Soc Son, Hanoi, is located at Soc Mountain, Ve Linh Commune, Soc Son District. This sacred temple attracts many visitors and is only about 30 km from Hanoi, easily accessible by bus or private vehicle.",
    "image": "GiongTemple",
    "description": [
      {
        "content": [
          "Giong Temple is a famous historical relic complex with many temples, including Trinh Temple, Non Nuoc Pagoda, Mother Temple, Dai Bi Pagoda, Upper Temple, Chồng Stone, Saint Giong Monument, and stele houses. Notably, there is a pure bronze statue of Saint Giong with great value. Soc Son Giong Temple Complex was recognized as a National Historical Monument in 1962.",
          "The temple is known for the tradition of Saint Giong driving away the An invaders to reclaim freedom for the country. Saint Giong symbolizes indomitable courage and the determination to fight for peace.",
          "According to legend, Soc Son Temple was originally a small shrine for worshiping Dong Thien Vuong. When King Le Hoan fought the Song invaders, he held a ceremony to pray for Saint Giong’s protection.",
          "The history of Giong Temple is closely linked with the development of Vietnamese folk religion across many dynasties. Though the legend of Saint Giong dates back to the Hung Kings, the temple's architecture was officially constructed on a large scale during the reign of Ly Thai Tong (1028-1054)."
        ],
        "image": "GiongTemple1"
      },
      {
        "title": "Timeline of Giong Temple's Development",
        "content": [
          "Ly Dynasty (1010-1225): King Ly Thai Tong built the first temple in Soc Son and honored Saint Giong as 'Phu Dong Thien Vuong'.",
          "Tran Dynasty (1225-1400): Expanded the temple complex, added architectural features and altars.",
          "Le Dynasty (1428-1788): Multiple renovations with larger scale, especially under King Le Thanh Tong.",
          "Nguyen Dynasty (1802-1945): Continued restoration and upgrades; notably in 1823 under Emperor Minh Mang.",
          "Modern Era (1954-present): Major restorations in 1978, 1994, 2004, and a comprehensive conservation project in 2018-2020 with a budget of 28.5 billion VND.",
          "According to the Institute of Cultural Heritage Research (2019), the Giong Temple Complex has undergone at least 14 major restorations, each leaving unique architectural and artistic marks. Despite severe damage during wars, particularly against the French and American invasions, the temple has been preserved relatively intact. In 2010, when UNESCO recognized the Giong Festival as an Intangible Cultural Heritage of Humanity, the complex received stricter preservation measures to maintain its original landscape and architecture."
        ],
        "image": "GiongTemple2"
      },
      {
        "content": [
          "Soc Son Giong Temple is one of the most popular tourist destinations near Hanoi. The complex includes several smaller temples such as:",
          "Trinh Temple: Also known as the Lower Temple, this is the first stop in the Soc Son Giong complex. It worships the deities of Soc Mountain and was built in the 10th century, in 980. The Lower Temple has a Dinh-shaped architecture with a front hall and rear hall, including 5 rooms with 1 altar, 3 stone steles, and ceremonial implements.",
          "Mother Temple: Located opposite Dai Bi Pagoda, this temple is dedicated to Saint Giong's mother. Despite its small size, it features intricate architectural design and craftsmanship, including a clear water well.",
          "Dai Bi Pagoda: After visiting the Lower Temple, follow the red tiles to Dai Bi Pagoda. It is a Buddhist temple with unique design, decorated with gilded couplets and plaques, and preserves steles praising Buddhism. It was also the site of Ngô Chân Lưu's practice (933-1011), contributing to its solemn and distinctive atmosphere.",
          "Upper Temple: The Upper Temple venerates Saint Giong and other deities. Visitors can see dragon-headed horse statues at the entrance, symbolizing Saint Giong’s horse and the descendant dragons. Inside, there is a large ceremonial hall with colorful canopies and ornaments."
        ],
        "image": "GiongTemple3"
      },
      {
        "content": [
          "At Giong Temple, you can admire the 15m tall, 85-ton solid bronze statue of Phu Dong Thien Vuong, 16m in length, located at 302m above sea level. The statue depicts Saint Giong holding a bamboo rod, urging his horse to charge to the sky.",
          "The statue was crafted by renowned sculptor Nguyen Kim Xuan from the Hanoi Fine Arts Association. It is located within the Soc Temple – Non Pagoda complex and became a key cultural work in 2010 during the 1000th anniversary of Thang Long – Hanoi."
        ],
        "image": "GiongTemple4"
      },
      {
        "content": [
          "Non Nuoc Pagoda, within the Soc Temple complex, has a main hall area of 260m² and a height of 14m. It contains 80 primary wooden pillars, 35cm in diameter and 14m in length. Construction used 30 tons of bronze for Buddha statues, 600m³ of lim wood, and 30m³ of green stone.",
          "When visiting Non Nuoc Pagoda, you can experience its sacred and solemn space. Situated at 110m above sea level and near the Saint Giong statue, it houses a 30-ton Buddha statue, over 8m tall, making it a must-see spot in the Soc Son Giong Temple complex."
        ],
        "image": "GiongTemple5"
      },
      {
        "content": [
          "If you wonder 'What to do in Soc Son?', consider the Giong Festival. It is held annually from the 6th to 8th day of the first lunar month to honor the legendary hero Saint Giong. In 2010, the festival was recognized by UNESCO as an Intangible Cultural Heritage of Humanity.",
          "During the festival, visitors can watch rituals such as offerings, ceremonial elephants, betel and areca, elephant grass, incense processions, general palanquins, and other traditional performances. You can also enjoy folk games like duck catching, pot breaking, traditional singing, martial arts, and combined dance performances."
        ],
        "image": "GiongTemple6"
      },
      {
        "title": "Tips for Visiting Soc Son Giong Temple",
        "content": [
          "You can visit Giong Temple at any time as it is close to Hanoi. However, since the complex is extensive, choose cooler and fresher hours to avoid exhaustion during your visit.",
          "If you want to experience the festival, plan your visit from the 6th to 8th day of the first lunar month, when visitors come for worship, sightseeing, and activities."
        ]
      },
      {
        "title": "Legend of Saint Giong and Cultural Significance",
        "content": [
          "The legend of Saint Giong is one of the oldest and most beloved stories in Vietnamese culture. According to the legend, during the 6th Hung King era, a 3-year-old boy in Phu Dong village could neither speak nor walk, living with his elderly mother. When the An invaders (from the north) attacked, the king sent envoys to find someone to help the country. The boy suddenly spoke, requesting an iron horse, iron rod, and iron helmet from the king.",
          "Once equipped, he grew into a giant, rode the iron horse into battle, and defeated the An invaders. After the victory, Saint Giong flew to the sky from Soc Mountain (now Soc Son District). The king honored him as 'Phu Dong Thien Vuong' and built temples at his birthplace and the site of his ascension.",
          "The legend carries deep cultural meanings: National strength: the 3-year-old boy turning into a giant symbolizes the latent strength of Vietnam against invaders. Patriotism: Saint Giong's courage embodies deep love for the country. Desire for freedom: flying to heaven represents the aspiration for liberty and resistance against oppression. Unity: the whole village helping Giong grow reflects community solidarity. In Vietnamese consciousness, Saint Giong represents indomitable spirit, inspiring generations. His story is included in literature, arts, and even school curricula as a lesson on patriotism and self-reliance."
        ],
        "image": "GiongTemple7"
      }
    ]
  },
  "Thay Pagoda": {
    "name": "Thay Pagoda",
    "introduction": "Thay Pagoda, located at the foot of Sai Son Mountain (Quoc Oai District, Hanoi), is an ancient temple associated with Zen master Tu Dao Hanh – a famous monk of the Ly Dynasty. The temple complex includes the Lower Pagoda, Middle Pagoda, Upper Pagoda, and a unique water pavilion on Long Chieu Lake, where traditional water puppet performances are held. Visiting Thay Pagoda, tourists can admire ancient architecture, picturesque scenery, and explore the rich folk culture and spiritual life of the Vietnamese people.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.241447043721!2d105.64370757515306!3d21.023022987975807!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3134512bbe5baab7%3A0x6195ecacc2336c44!2zQ2jDuWEgVGjhuqd5!5e0!3m2!1svi!2s!4v1759475564176!5m2!1svi!2s",
    "location": "Thay Pagoda, also called Chua Ca, is situated at the foot of Sai Son Mountain, about 25 km southwest of central Hanoi. The temple, officially named Thien Phuc Tu, is nestled against Phat Tich Mountain (Thay Mountain). It is a famous historical and cultural site with notable architecture from the 17th century. Thay Pagoda is one of Hanoi’s beautiful and sacred temples, attracting tourists and Buddhists for sightseeing, worship, and exploring its unique architecture.",
    "image": "ChuaThay",
    "description": [
      {
        "title": "How to Get to Thay Pagoda",
        "content": [
          "By private vehicle (car, motorbike): From central Hanoi, take the Thang Long Boulevard (CT08) to the Sai Son intersection, then turn right off the highway and go about 3 km following vehicle lane signs. Note: motorbikes are prohibited on the Thang Long Boulevard service road. From Big C – Tran Duy Hung intersection, travel about 15 km to reach the turnoff to Thay Pagoda. Parking fees: 10,000 VND for motorbikes and 30,000 VND for cars.",
          "By bus: Take bus CNG 01 from My Dinh Bus Station to Son Tay Bus Station. This route stops right in front of Thay Pagoda, making it convenient for visitors."
        ]
      },
      {
        "title": "History of Thay Pagoda",
        "content": [
          "Thay Pagoda was built during the Ly Dynasty, associated with the life of Zen master Tu Dao Hanh. Initially, it was a small hermitage called Huong Hai Am. Later, King Ly Nhan Tong rebuilt it into two temple clusters: Lower Pagoda (Thien Phuc Tu) and Upper Pagoda (Dinh Son Tu).",
          "In the early 17th century, Dinh Quan Cong and the royal family oversaw renovations, including the construction of Buddha halls, sacred halls, rear buildings, stele houses, and bell towers. In 1997, the Vietnam Post issued a stamp series 'Vietnam Scenic Spots' featuring Thay Pagoda. Today, it serves both as a place of worship and a tourist destination to explore architecture and history."
        ]
      },
      {
        "title": "Architecture of Thay Pagoda",
        "content": [
          "Visitors are immediately impressed by the majestic mountain scenery surrounding the temple. Thay Pagoda in Sai Son, Quoc Oai, follows Ly Dynasty architecture with a 'Tam' layout of three parallel pagodas built on elevated green stone foundations. The outer hall is for rituals and teachings (Lower Pagoda), the middle hall worships the Triple Gem (Middle Pagoda), and the inner hall houses the three reincarnations of Tu Dao Hanh with grand Upper Pagoda. Additional shrines and bell towers are placed along the path up the mountain.",
          "Located at the foot of Sai Son Mountain, the temple faces south, with Long Dau Mountain on the left and Sai Son Mountain behind. A pond called Long Chieu (Dragon Pond) lies in front, forming the dragon's mouth. The three parallel halls (Lower, Middle, Upper) are connected by corridors forming a harmonious architectural structure.",
          "Lower Pagoda: houses statues of Duc Ong and sages; corridors display statues of the Eight Vajra Guardians. Middle Pagoda: contains Buddha altar, Dharmapala statues, and heavenly kings. Upper Pagoda: houses Amitabha Buddha statues, three reincarnations of Tu Dao Hanh, and statues of his parents.",
          "The pagoda faces south, in front of the pagoda, between Sai Son and Long Dau is a large lake called Long Chieu or Long Tri (dragon pond). The yard has a dragon's jaw. The main part of Thay Pagoda consists of three parallel buildings called Ha Pagoda, Trung Pagoda and Thuong Pagoda. Between Ha Pagoda and Trung Pagoda there is a tube connecting them, creating the position of the lower temple and the upper temple.",
          "The Lower Pagoda is the front house, displaying statues of the Lord and Saints. The bamboo tube houses the statue of the Eight Vajrapani. The Middle Pagoda houses the Buddha altar, with two statues of Dharma Protectors and a statue of the Heavenly King on either side. The Upper Pagoda or the upper pagoda is completely separate, in the highest position, with a sign reading Dai Hung Bao Dien, and is also the Holy House, housing the statue of Amitabha Buddha, the three lives of Zen Master Tu Dao Hanh, and the statues of Tu Dao Hanh's parents."
        ],
        "image": "ChuaThay1"
      },
      {
        "content": [
          "The temple features two side corridors, a rear bell tower, and a front square facing Long Chieu Lake, forming the dragon's mouth. Two bridges, Nhat Tien Bridge and Nguyet Tien Bridge, built in 1602, connect the front square to surrounding areas, forming the dragon's 'whiskers'. Nhat Tien Bridge leads to a small island with Tam Phu shrine, while Nguyet Tien Bridge leads up the mountain.",
          "From this yard, there are two bridges, Nhat Tien Kieu and Nguyet Tien Kieu, connecting to both sides, forming two dragon whiskers. These two bridges were built by Phung Khac Khoan in 1602. Nhat Tien Bridge connects to a small island, on which there is a Tam Phu temple. Nguyet Tien Bridge connects to the road up the mountain.",
          "Up the mountain is the Upper Pagoda. Behind it is Phat Tich Cave, believed to be where Tu Dao Hanh left his body to reincarnate as King Ly Than Tong. Nearby are sacred caves like But Moc, Hang Bo, and Hang Gio, each with unique features formed by nature.",
          "In front of the temple, the Water Pavilion rises like a lotus on the lake, adding to the scenic beauty. In March, ancient flame trees bloom red, signaling the festival season. Locals believe this combination of temple scenery and blooming flame trees brings good luck, offering a delightful experience for visitors."
        ],
        "image": "ChuaThay2"
      },
      {
        "content": [
          "Cac Co Cave is a natural cave often compared to a miniature Son Doong near Hanoi. The cave is both sacred and mysterious, with stunning natural features and spiritual significance.",
          "Exploring the entire cave requires climbing through rugged, sharp rocks in deep darkness. Conquering the cave is a rewarding experience, offering breathtaking scenery and a sense of adventure."
        ],
        "image": "HangCacCo"
      },
      {
        "title": "Thay Pagoda Festival",
        "content": [
          "The traditional festival is held from the 5th to 8th day of the 3rd lunar month, with the main day on the 7th. Similar to other major pagodas, the festival includes rituals and folk performances. The temple preserves main rituals such as Moc Duc, welcoming ancestral tablets, offering ceremonies, and processions.",
          "During the festival, locals and tourists participate in activities like wrestling, water puppetry, mountain spring games, and other lively traditional games."
        ],
        "image": "ChuaThay3"
      }
    ]
  },
  "Ba Da Pagoda": {
    "name": "Ba Da Pagoda",
    "introduction": "Ba Da Pagoda, also called Linh Quang Tu, is located on Nha Tho Street, Hoan Kiem District, and is one of Hanoi’s ancient and famous pagodas. Built during the Le Dynasty, the temple is associated with the legend of a natural stone Buddha statue, which gave the pagoda its popular name “Ba Da Pagoda.” Today, it serves both as a religious site and a serene destination, attracting many tourists and Buddhists for worship and sightseeing.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.0975487801456!2d105.84775287515316!3d21.028782487777995!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab956d281f97%3A0xa4275008ea27b36b!2zQ2jDuWEgQsOgIMSQw6E!5e0!3m2!1svi!2s!4v1759475609171!5m2!1svi!2s",
    "location": "Ba Da Pagoda (also known as Linh Quang Tu, Sung Khanh Tu) is an ancient temple located at No. 3 Nha Tho Street, Hang Trong, Hoan Kiem, Hanoi, just 100 meters from Hoan Kiem Lake.",
    "image": "ChuaBaDa",
    "description": [
      {
        "title": "Introduction to Ba Da Pagoda",
        "content": [
          "Ba Da Pagoda is one of the four famous 'Ba' pagodas in Hanoi, along with Ba Danh, Ba Nanh, and Ba Ngo Pagodas. Nestled in the heart of the Old Quarter, it is a destination for monks, nuns, and tourists attending ceremonies organized by the Hanoi Buddhist Association.",
          "Originally, Ba Da Pagoda was the headquarters of the Lam Te sect, one of the two major Zen sects in Northern Vietnam. Today, it serves as the main office of the Hanoi Buddhist Association and hosts a Middle Buddhist School.",
          "The pagoda was built in 1056 during the reign of King Ly Thanh Tong (1460–1497). During renovations of Thang Long, a natural stone statue of a woman was discovered in the area of Bao Thien Tu Thap Village (now Nha Tho area). Villagers built a shrine there, calling it Ba Da Temple. Later, the shrine was expanded into a large pagoda, housing the Buddha statue, and renamed Ba Da Pagoda, with the formal name Linh Quang Tu, meaning 'Pagoda of Sacred Light.' During the Tay Son attacks, the temple was damaged and fell into disrepair. According to historical records, it was restored in 1850 by monk Giac Vuong and further expanded.",
          "During French colonial times, urban planning damaged the original stone statue. A replacement stone Buddha statue of Shakyamuni was brought in. Today, Ba Da Pagoda serves as the office of the Hanoi Buddhist Association, and the abbacy is held by the head of the executive committee instead of traditional Zen succession.",
          "Notable abbots include: Venerable Thich Tam Tich (1915-2005), served 1981–2002, and Venerable Thich Thanh Chinh (1919-2009), served 2002–2008."
        ],
        "image": "ChuaBaDa1"
      },
      {
        "content": [
          "The pagoda features 5 halls arranged in a 'Nhat' layout, connected with incense halls to form a large Buddha hall. The Upper Hall has 4 rooms in a 'Dinh' style connected to the rear hall, forming a square, symmetrical structure. Two side corridors run along both sides, leading to the rear hall for ancestor and goddess worship.",
          "In front of the Front Hall, there is an incense burner and a pair of stone lanterns between two ancient tomb towers, decorated with lotus patterns. The roof is supported by four intricately carved green stone columns.",
          "Inside, there are many valuable statues, including a large wooden statue of Shakyamuni Buddha, flanked by Ananda and Kasyapa, with Amitabha Buddha seated behind, accompanied by Avalokiteshvara and Mahasthamaprapta Bodhisattvas. Despite aging, the statues maintain a serene and meditative appearance.",
          "The pagoda has two bells dated 1823 and 1881, and a gong cast in 1842. On the right side of the courtyard is the office of Hanoi Middle Buddhist School. Four tomb towers stand symmetrically along the outer walls of the Upper Hall."
        ],
        "image": "ChuaBaDa2"
      },
      {
        "content": [
          "Ba Da Pagoda is a spiritual pilgrimage site for many devotees, especially during holidays and Buddhist festivals, attracting thousands of visitors for worship and sightseeing.",
          "Visitors should prepare simple offerings with sincerity, such as flowers, fresh fruits, betel and areca, vegetarian dishes, or ceremonial cakes, to place on the Buddha altar.",
          "Special offerings such as 'Oan Tai Loc' (jewel-like ceremonial items) are often chosen for their symbolic meaning, elegance, and durability, enhancing the solemnity of the ritual."
        ],
        "image": "ChuaBaDa3"
      }
    ]
  },
  "common": {
    "address": "Address",
    "activities": "Activities",
    "Same category": "Same category",
    "Travel itinerary": "Travel itinerarys",
    "Date": "Date",
    "Price": "Price",
    "Children": "Children",
    "Adult": "Adult",
    "Age": "age",
    "Ticket Prices & Services": "Ticket Prices & Services",
    "Policies & Terms": "Policies & Terms",
    "Important Notes": "Important Notes",
    "Ratings & Reviews": "Ratings & Reviews",
    "Service Feedback": "Service Feedback",
    "Comment": "Comment",
    "Submit": "Submit"
  },
  "Ancient City Tour": {
    "name": "Ancient City Tour",
    "image": "HoChiMinhMausoleum",
    "introduction": "Ancient City Tour – A journey to explore the timeless beauty of the city, where cultural, architectural, and historical heritages are preserved through the ages. Admire ancient landmarks, immerse yourself in the traditional lifestyle, and feel the spirit of the past within the modern urban landscape.",
    "type": "Visit Tour",
    "policy": [
      "Children from 1 - 4 years old: Free of charge (Parents take care of the child).",
      "Two adults are allowed to accompany 1 child for free (For the second child under 4 years old, an additional 50% fee applies).",
      "Children from 5 - 8 years old are charged 75% of the tour price (with a separate seat on the bus, separate meals, and entrance tickets).",
      "Children aged 9 and above are charged 100% of the adult tour price."
    ],
    "notes": [
      "Every Monday, Friday, and in the afternoon, Ho Chi Minh Mausoleum is closed for visits; however, the surrounding areas remain open for sightseeing.",
      "Guests are advised to dress politely — wear long pants or skirts below the knees when visiting Tran Quoc Pagoda and Ho Chi Minh Mausoleum.",
      "Guests with dietary restrictions, vegetarians, or those having flights on the same day should inform the staff in advance for suitable arrangements.",
      "Please provide full personal information (full name, year of birth, gender, nationality) before departure for travel insurance registration.",
      "Before leaving the bus, please check all personal belongings. The company will not be responsible for any lost or misplaced items."
    ],
    "price": {
      "child": 2100000,
      "default": 2800000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Entrance tickets, electric car tickets.",
          "Personal drinks during meals, additional sightseeing beyond the itinerary.",
          "Tips for tour guides, drivers, and service staff."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "HoChiMinhMausoleum",
          "OnePillarPagoda",
          "HoanKiemLake1",
          "NgocSonTemple"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:45",
                "end": "08:00",
                "details": "Pick up guests at the hotel and depart for Ho Chi Minh Mausoleum."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Visit Ho Chi Minh Mausoleum and Ba Dinh Square — a significant historical and cultural landmark of Hanoi."
              },
              {
                "start": "10:00",
                "end": "10:15",
                "details": "After visiting the Mausoleum and taking souvenir photos, the group returns to the bus to continue to the next destination."
              },
              {
                "start": "10:15",
                "end": "11:30",
                "details": "Visit One Pillar Pagoda — an ancient pagoda in Hanoi, famous for its unique 'Lotus Blossom' architecture built on a single pillar. Guests can enjoy the scenery and take photos."
              },
              {
                "start": "11:30",
                "end": "12:00",
                "details": "Return to the hotel for rest and lunch."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "14:00",
                "end": "14:30",
                "details": "Pick up at the hotel and head to Hoan Kiem Lake."
              },
              {
                "start": "14:30",
                "end": "16:15",
                "details": "Take a leisurely walk around Hoan Kiem Lake, enjoy the scenery, and take souvenir photos."
              },
              {
                "start": "16:15",
                "end": "17:00",
                "details": "Visit Ngoc Son Temple — a spiritual and cultural symbol of Hanoi."
              },
              {
                "start": "17:10",
                "details": "Return to the hotel for rest. Free time in the evening for exploring or shopping."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TempleOfLiterature",
          "VietnamMuseumOfEthnology",
          "HoaLoPrison"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Visit the Temple of Literature – Quoc Tu Giam, a thousand-year-old symbol of Hanoi and Vietnam’s first national university, home to many great scholars."
              },
              {
                "start": "10:30",
                "end": "12:00",
                "details": "Visit the Vietnam Museum of Ethnology – a fascinating place to explore artifacts and cultural exhibits of 54 ethnic groups in Vietnam."
              },
              {
                "start": "12:10",
                "end": "14:00",
                "details": "Return to the hotel for lunch and rest."
              },
              {
                "start": "14:00",
                "end": "16:30",
                "details": "Visit Hoa Lo Prison – a historical relic symbolizing the resilience and indomitable spirit of Vietnamese patriots during the war. The site still stands as a powerful reminder of history."
              },
              {
                "start": "17:00",
                "details": "Return to the hotel for rest. In the evening, guests are free to explore or visit the Walking Street."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "DongXuanMarket"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Explore the Old Quarter and Dong Xuan Market. Free time for shopping and buying souvenirs."
              },
              {
                "start": "12:30",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "14:00",
                "details": "Depart back to the hotel — end of the tour."
              }
            ]
          }
        ]
      }
    ]
  },
  "Culture And Spiritual": {
    "name": "Culture And Spiritual",
    "type": "Visit Tour",
    "introduction": "Culture and Spiritual Tour – A journey to explore the unique cultural and spiritual heritage, taking you to ancient temples and pagodas, experiencing traditional customs, and finding inner peace within the sacred atmosphere rich in national identity.",
    "image": "WestLake",
    "policy": [
      "Children aged 1 - 4: Free of charge (parents take care of the child).",
      "Two adults can accompany one child for free (a second child under 4 years old will be charged 50%).",
      "Children aged 5 - 8: 75% of the tour price (have a separate seat, meal, and sightseeing ticket).",
      "Children aged 9 and above: 100% of the adult price."
    ],
    "notes": [
      "Every Monday, Friday, and afternoon, Ho Chi Minh Mausoleum is closed, but visitors can still explore the surrounding areas.",
      "Visitors should wear formal attire – long pants or skirts below the knee – when visiting Tran Quoc Pagoda and Ho Chi Minh Mausoleum.",
      "Guests with dietary restrictions, vegetarian meals, or same-day flights should inform in advance for proper arrangements.",
      "Please provide full personal information (name, date of birth, gender, nationality) before departure for travel insurance purposes.",
      "Before leaving the vehicle, please check your belongings. The company is not responsible for lost or misplaced personal items."
    ],
    "price": {
      "child": 2175000,
      "default": 2900000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Entrance tickets and electric car tickets.",
          "Personal drinks and extra sightseeing outside the program.",
          "Tips for tour guides, drivers, and service staff."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "HoChiMinhMausoleum1",
          "OnePillarPagoda2",
          "HoanKiemLake2"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:30",
                "end": "07:45",
                "details": "Pick up guests at the hotel."
              },
              {
                "start": "07:45",
                "end": "09:00",
                "details": "Visit Ho Chi Minh Mausoleum – a symbol of the Vietnamese nation, take photos for memories."
              },
              {
                "start": "09:15",
                "end": "11:00",
                "details": "Move to One Pillar Pagoda, an ancient temple resembling a blooming lotus flower."
              },
              {
                "start": "11:30",
                "end": "13:00",
                "details": "Lunch and rest at the hotel."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "14:00",
                "end": "15:30",
                "details": "Visit Hoan Kiem Lake and Ngoc Son Temple, enjoy the fresh air and take photos."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Explore the Old Quarter or enjoy free time for shopping."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TranQuocPagoda",
          "TempleOfLiterature1",
          "QuanSuPagoda"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "09:30",
                "details": "Visit Tran Quoc Pagoda, the oldest pagoda in Hanoi located by West Lake."
              },
              {
                "start": "10:00",
                "end": "11:30",
                "details": "Move to the Temple of Literature, the ancient center of education in Hanoi, take souvenir photos."
              },
              {
                "start": "12:00",
                "end": "14:00",
                "details": "Lunch and rest at the hotel."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "14:15",
                "end": "16:30",
                "details": "Visit Quan Su Pagoda, the Buddhist center of Northern Vietnam."
              },
              {
                "start": "17:00",
                "details": "Return to the hotel and free evening for personal activities."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "Hanoi36Streets"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Stroll through the 36 ancient streets, explore and shop for souvenirs."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch, rest, and hotel check-out."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:00",
                "end": "16:00",
                "details": "Shopping."
              }
            ]
          }
        ]
      }
    ]
  },
  "Premium And Night": {
    "name": "Premium And Night",
    "introduction": "Premium And Night offers travelers an exclusive evening experience combining luxury, culture, and entertainment. Enjoy the city’s vibrant nightlife, fine dining, and premium services in an unforgettable atmosphere.",
    "type": "Visit Tour",
    "image": "HaNoiFestival",
    "policy": [
      "Children aged 1 - 4: Free of charge (parents take care of the child).",
      "Two adults can accompany one child for free (a second child under 4 years old will be charged 50%).",
      "Children aged 5 - 8: 75% of the tour price (have a separate seat, meal, and sightseeing ticket).",
      "Children aged 9 and above: 100% of the adult price."
    ],
    "notes": [
      "Every Monday, Friday, and afternoon, Ho Chi Minh Mausoleum is closed, but visitors can still explore the surrounding areas.",
      "Visitors should wear formal attire – long pants or skirts below the knee – when visiting Tran Quoc Pagoda and Ho Chi Minh Mausoleum.",
      "Guests with dietary restrictions, vegetarian meals, or same-day flights should inform in advance for proper arrangements.",
      "Please provide full personal information (name, date of birth, gender, nationality) before departure for travel insurance purposes.",
      "Before leaving the vehicle, please check your belongings. The company is not responsible for lost or misplaced personal items."
    ],
    "price": {
      "child": 2400000,
      "default": 3200000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Entrance tickets and electric car tickets.",
          "Personal drinks and extra sightseeing outside the program.",
          "Tips for tour guides, drivers, and service staff."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "HoChiMinhMausoleum2",
          "OnePillarPagoda3",
          "HoanKiemLake3"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:30",
                "end": "07:45",
                "details": "Pick up."
              },
              {
                "start": "07:45",
                "end": "09:00",
                "details": "Visit Ho Chi Minh Mausoleum (memorial site) and One Pillar Pagoda (ancient temple)."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              },
              {
                "start": "13:30",
                "end": "15:30",
                "details": "Visit Hoan Kiem Lake (a symbol of Hanoi)."
              },
              {
                "start": "16:00",
                "end": "18:00",
                "details": "Rest and prepare for evening activities."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Watch the traditional Water Puppet Show at Hoan Kiem Lake."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TempleOfLiterature1",
          "HoChiMinhMuseum"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Visit the Temple of Literature (ancient school) and Ho Chi Minh Museum (dedicated to the national leader)."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "18:00",
                "end": "20:00",
                "details": "3D Mapping Light Show at the Temple of Literature."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "Hanoi36Streets1"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Stroll through the 36 ancient streets, explore and shop for souvenirs."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Fusion lunch, rest, and hotel check-in."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Visit Vincom Center (luxury mall) for shopping."
              }
            ]
          }
        ]
      }
    ]
  },
  "Vacation And Relax": {
    "name": "Vacation And Relax",
    "introduction": "Vacation And Relax is the perfect getaway for those seeking peace and comfort. Enjoy serene landscapes, gentle activities, and rejuvenating moments designed to refresh your body and mind.",
    "type": "Vacation Tour",
    "image": "VacationRelax",
    "policy": [
      "Children 1 - 4 years old: Free of charge (parents take care of the child).",
      "Two adults can bring 1 child for free; the second child under 4 years old will be charged 50%.",
      "Children 5 - 8 years old: 75% of adult price (own seat, meal, and entrance ticket).",
      "Children from 9 years old: charged 100% as adults."
    ],
    "notes": [
      "Uncle Ho’s Mausoleum is closed on Mondays, Fridays, and in the afternoon, but outside areas are still open for visiting.",
      "Please wear polite clothes (long pants or skirts below the knees) when visiting Tran Quoc Pagoda and Uncle Ho’s Mausoleum.",
      "If you are vegetarian, on a special diet, or have a same-day flight, please inform us in advance for a suitable arrangement.",
      "Provide full name, year of birth, gender, and nationality before departure for travel insurance registration.",
      "Before getting off the vehicle, please check your belongings. The company is not responsible for lost personal items."
    ],
    "price": {
      "child": 2250000,
      "default": 3000000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Electric car and sightseeing tickets.",
          "Beverages ordered outside the program, additional expenses.",
          "Tips for guide, driver, and service staff."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "VacationRelax1"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:30",
                "details": "Pick-up at hotel."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Travel to resort area, check in, and relax."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Have lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Relax by the pool or enjoy herbal massage (1 hour)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Evening walk and light dinner."
              }
            ]
          }
        ]
      }
    ]
  },
  "Spa And Relax Ancient Town": {
    "name": "Spa And Relax Ancient Town",
    "introduction": "Spa And Relax Ancient Town offers a soothing retreat in the heart of the old quarter. Immerse yourself in traditional spa treatments, tranquil surroundings, and the timeless charm of ancient streets.",
    "type": "Wellness Tour",
    "image": "SpaRelax1",
    "policy": [
      "Children 1 - 4 years old: Free of charge (parents take care of the child).",
      "Two adults can bring 1 child for free; the second child under 4 years old will be charged 50%.",
      "Children 5 - 8 years old: 75% of adult price (own seat, meal, and entrance ticket).",
      "Children from 9 years old: charged 100% as adults."
    ],
    "notes": [
      "Some temples and pagodas may close at noon; please follow the guide’s schedule.",
      "Please wear modest clothes when visiting spiritual sites.",
      "Inform in advance if you have dietary restrictions or vegetarian meals.",
      "Check personal belongings before leaving the spa or vehicle."
    ],
    "price": {
      "child": 1950000,
      "default": 2600000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Personal purchases and drinks outside the program.",
          "Tips for guide, driver, and spa staff."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "AncientTownSpa1"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "details": "Pick-up at hotel in Hanoi Old Quarter."
              },
              {
                "start": "08:30",
                "end": "10:00",
                "details": "Walk through the Ancient Quarter, visit traditional houses."
              },
              {
                "start": "10:30",
                "end": "12:00",
                "details": "Enjoy herbal spa and foot massage."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Have lunch at a vegetarian restaurant."
              },
              {
                "start": "14:00",
                "end": "16:00",
                "details": "Meditation or yoga relaxation session."
              }
            ]
          }
        ]
      }
    ]
  },
  "Hoan Kiem Lake Family Resort": {
    "name": "Hoan Kiem Lake Family Resort",
    "introduction": "Hoan Kiem Lake Family Resort is an ideal destination for families seeking comfort and fun. Enjoy relaxing moments by the lake, family-friendly activities, and a peaceful atmosphere in the heart of the city.",
    "type": "Family Vacation Tour",
    "image": "HoanKiemLake1",
    "policy": [
      "Children 1 - 4 years old: Free of charge (parents take care of the child).",
      "Two adults can bring 1 child for free; the second child under 4 years old will be charged 50%.",
      "Children 5 - 8 years old: 75% of adult price (own seat, meal, and entrance ticket).",
      "Children from 9 years old: charged 100% as adults."
    ],
    "notes": [
      "Uncle Ho’s Mausoleum is closed on Mondays, Fridays, and in the afternoon, but outside areas are still open for visiting.",
      "Please wear polite clothes (long pants or skirts below the knees) when visiting Tran Quoc Pagoda and Uncle Ho’s Mausoleum.",
      "If you are vegetarian, on a special diet, or have a same-day flight, please inform us in advance.",
      "Provide full name, year of birth, gender, and nationality before departure for travel insurance registration.",
      "Before getting off the vehicle, please check your belongings. The company is not responsible for lost personal items."
    ],
    "price": {
      "child": 2400000,
      "default": 3200000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Sightseeing and electric car tickets.",
          "Beverages and other expenses outside the program.",
          "Tips for guide, driver, and service staff."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "HoanKiemLake1"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:30",
                "details": "Pick-up by car."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Transfer to Hoan Kiem Lake, check-in lake-view hotel, relax."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Family games or 1-hour spa massage."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Cycling around the lake, light dinner."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "NgocSonTemple"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Visit Hoan Kiem Lake and Ngoc Son Temple."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Vegetarian lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Join a Vietnamese cooking class for families (1 hour)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Enjoy egg coffee at a famous ancient café."
              }
            ]
          }
        ]
      }
    ]
  },
  "Luxury West Lake Resort": {
    "name": "Luxury West Lake Resort",
    "ỉntroduction": "Luxury West Lake Resort offers an elegant escape by the serene West Lake. Experience premium amenities, breathtaking views, and refined hospitality for a truly luxurious stay.v",
    "type": "Vacation Tour",
    "image": "WestLake1",
    "policy": [
      "Children 1 - 4 years old: Free of charge (parents take care of the child).",
      "Two adults can bring 1 child for free; the second child under 4 years old will be charged 50%.",
      "Children 5 - 8 years old: 75% of adult price (own seat, meal, and entrance ticket).",
      "Children from 9 years old: charged 100% as adults."
    ],
    "notes": [
      "Uncle Ho’s Mausoleum is closed on Mondays, Fridays, and in the afternoon, but outside areas are still open for visiting.",
      "Please wear polite clothes (long pants or skirts below the knees) when visiting Tran Quoc Pagoda and Uncle Ho’s Mausoleum.",
      "If you are vegetarian, on a special diet, or have a same-day flight, please inform us in advance.",
      "Provide full name, year of birth, gender, and nationality before departure for travel insurance registration.",
      "Before getting off the vehicle, please check your belongings. The company is not responsible for lost personal items."
    ],
    "price": {
      "child": 4125000,
      "default": 5500000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Sightseeing and electric car tickets.",
          "Beverages ordered outside the program, extra expenses.",
          "Tips for guide, driver, and service staff."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "WestLake1"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:30",
                "details": "Pick-up at hotel."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Travel to West Lake, check-in lake-view hotel, relax."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Herbal spa massage (1 hour)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Cycling around the lake, light dinner."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TranQuocPagoda"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Visit Tran Quoc Pagoda, pray for peace."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Vegetarian lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Join a yoga or meditation class (1 hour)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Enjoy tea ceremony and reading by the lake."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HotelImage2"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "11:00",
                "details": "Hotel relaxation and spa session."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Shopping at Vincom Plaza (premium mall)."
              },
              {
                "start": "16:30",
                "details": "End of tour, transfer to hotel or airport."
              }
            ]
          }
        ]
      }
    ]
  },
  "Relax Spa Old Quarter And Hoan Kiem Lake": {
    "name": "Relax Spa Old Quarter And Hoan Kiem Lake",
    "introduction": "Relax Spa Old Quarter And Hoan Kiem Lake offers a perfect blend of tranquility and tradition. Enjoy rejuvenating spa treatments while exploring the timeless beauty of the Old Quarter and the peaceful charm of Hoan Kiem Lake.",
    "type": "Vacation Tour",
    "image": "Hanoi36Streets",
    "policy": [
      "Children aged 1 - 4: Free of charge (parents take care of the child)",
      "Two adults are allowed one free child (a second child under 4 years old is charged 50%)",
      "Children aged 5 - 8: Charged 75% (own seat, meal, and entrance ticket)",
      "Children aged 9 and above: Full adult price applies."
    ],
    "notes": [
      "On Mondays, Fridays, and afternoons, Ho Chi Minh Mausoleum is closed, but visitors can still explore the surrounding area.",
      "Guests should wear formal clothing—long pants or skirts below the knees—when visiting Tran Quoc Pagoda and Ho Chi Minh Mausoleum.",
      "Guests with dietary restrictions, vegetarian diets, or same-day flights should inform staff in advance for proper arrangements.",
      "Please provide full personal information (name, birth year, gender, nationality) before departure for travel insurance.",
      "Before leaving the vehicle, please check your belongings. The company is not responsible for lost or misplaced personal items."
    ],
    "price": {
      "child": 3600000,
      "default": 4800000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Entrance tickets, electric car fees.",
          "Beverages ordered outside meals, extra sightseeing beyond the itinerary.",
          "Tips for tour guides, drivers, service staff, etc."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "Hanoi36Streets"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:30",
                "details": "Pick-up at the city center hotel."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Transfer to the 36 Old Streets (vibrant yet peaceful in the morning), check-in at a boutique hotel."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Relaxing herbal spa massage (1 hour)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Stroll around the Old Quarter, light dinner."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HoanKiemLake1"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Transfer to Hoan Kiem Lake (the city’s symbol), light sightseeing and souvenir photos."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Vegetarian lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Join a Vietnamese family cooking class (1 hour)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Enjoy egg coffee at a famous traditional café."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "NgocSonTemple"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Leisurely visit Hoan Kiem Lake and Ngoc Son Temple (temple of an ancient scholar)."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Vegetarian lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Join a Vietnamese family cooking class (1 hour)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Enjoy egg coffee at a famous traditional café."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HotelImage"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "08:00",
                "end": "11:00",
                "details": "Relax at the hotel and enjoy final spa session."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Light shopping at Vincom Plaza (premium shopping center)."
              },
              {
                "start": "16:30",
                "details": "End of tour, transfer to hotel or airport."
              }
            ]
          }
        ]
      }
    ]
  },
  "Spiritual And Cultural Retreat": {
    "name": "Spiritual And Cultural Retreat",
    "image": "OnePillarPagoda",
    "introduction": "Spiritual And Cultural Retreat invites you to discover inner peace and cultural richness. Experience sacred sites, local traditions, and moments of reflection that nourish both the mind and soul.",
    "type": "Vacation Tour",
    "policy": [
      "Children aged 1 - 4: Free of charge (parents take care of the child)",
      "Two adults are allowed one free child (a second child under 4 years old is charged 50%)",
      "Children aged 5 - 8: Charged 75% (own seat, meal, and entrance ticket)",
      "Children aged 9 and above: Full adult price applies."
    ],
    "notes": [
      "On Mondays, Fridays, and afternoons, Ho Chi Minh Mausoleum is closed, but visitors can still explore the surrounding area.",
      "Guests should wear formal clothing—long pants or skirts below the knees—when visiting Tran Quoc Pagoda and Ho Chi Minh Mausoleum.",
      "Guests with dietary restrictions, vegetarian diets, or same-day flights should inform staff in advance for proper arrangements.",
      "Please provide full personal information (name, birth year, gender, nationality) before departure for travel insurance.",
      "Before leaving the vehicle, please check your belongings. The company is not responsible for lost or misplaced personal items."
    ],
    "price": {
      "child": 2625000,
      "default": 3600000,
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Entrance tickets, electric car fees.",
          "Beverages ordered outside meals, extra sightseeing beyond the itinerary.",
          "Tips for tour guides, drivers, service staff, etc."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "TempleOfLiterature",
          "HoChiMinhMuseum"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:30",
                "details": "Pick-up at the city center hotel."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Visit the Temple of Literature (ancient school) and Ho Chi Minh Museum (museum dedicated to Uncle Ho)."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "18:00",
                "end": "20:00",
                "details": "3D Mapping Show at the Temple of Literature."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "OnePillarPagoda",
          "HoChiMinhMausoleum2"
        ],
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:30",
                "details": "Pick-up at the city center hotel."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Visit Ho Chi Minh Mausoleum (memorial of the leader) and One Pillar Pagoda (ancient pagoda)."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Lunch and rest."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "15:30",
                "details": "Transfer to Hoan Kiem Lake (city symbol), explore the lake."
              },
              {
                "start": "16:00",
                "end": "18:00",
                "details": "Rest and dinner before evening activities."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Watch a traditional water puppet show at Hoan Kiem Lake."
              }
            ]
          }
        ]
      }
    ]
  },
  "Traditional Hanoi Cuisine": {
    "name": "Traditional Hanoi Cuisine",
    "introduction": "Traditional Hanoi Cuisine offers an authentic taste of the capital’s rich culinary heritage. Savor flavorful dishes, local ingredients, and timeless recipes that capture the essence of Hanoi’s culture.",
    "image": "CuisineList",
    "type": "Cuisine Tour",
    "notes": [
      "Wear sneakers or flat shoes for easy walking around the Old Quarter.",
      "Inform in advance if you have dietary restrictions, vegetarian diets, or food allergies.",
      "Prepare small cash (10,000 – 50,000 VND) for extra food purchases.",
      "Bring an umbrella/hat or light raincoat depending on the weather."
    ],
    "policy": [
      "Children aged 1 – 4: Free of charge (parents take care of the child).",
      "Two adults are allowed one free child, second child under 4 charged 50%.",
      "Children aged 5 – 8: Charged 75% (own seat, meal).",
      "Children aged 9 and above: Full adult price applies."
    ],
    "price": {
      "extend": {
        "title": "Not included",
        "content": [
          "VAT tax.",
          "Beverages ordered outside the program.",
          "Extra expenses not in the itinerary.",
          "Tips for guides, drivers, and service staff."
        ]
      },
      "services": {
        "title": "Included services:",
        "content": [
          "Tour bus transportation according to the itinerary.",
          "Bilingual English–Vietnamese tour guide.",
          "Tickets/food tastings at stops (6–7 dishes).",
          "01 main meal (Bun Cha or Pho) with light drinks.",
          "Full travel insurance (maximum compensation 20 million VND).",
          "Dasani bottled water 350ml/guest/day."
        ]
      }
    },
    "schedules": [
      {
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:45",
                "end": "08:30",
                "details": "Pick-up at hotel in Old Quarter – Hanoi Opera House area."
              },
              {
                "start": "08:45",
                "end": "09:30",
                "details": "Breakfast with traditional beef/chicken Pho – Vietnam’s national dish."
              },
              {
                "start": "09:45",
                "end": "10:15",
                "details": "Walk through the Old Quarter, enjoy hot Thanh Tri steamed rolls."
              },
              {
                "start": "10:30",
                "end": "11:15",
                "details": "Visit Dong Xuan Market, enjoy longan and lotus seed sweet soup."
              },
              {
                "start": "11:30",
                "end": "12:30",
                "details": "Lunch with Hanoi Bun Cha and crispy spring rolls."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "12:45",
                "end": "13:30",
                "details": "Enjoy egg coffee at a traditional café on Nguyen Huu Huan Street."
              },
              {
                "start": "13:45",
                "end": "14:30",
                "details": "Visit Hang Da Market, taste West Lake shrimp cakes."
              },
              {
                "start": "14:45",
                "end": "15:30",
                "details": "Try Vietnamese baguette with pate, pork sausage, and herbs."
              },
              {
                "start": "15:45",
                "end": "16:30",
                "details": "Relax by Hoan Kiem Lake, sip Vietnamese tea."
              },
              {
                "start": "16:45",
                "details": "End of tour, return to pick-up point."
              }
            ]
          }
        ]
      }
    ]
  },
  "Night Cuisine of Hanoi Old Quarter": {
    "name": "Night Cuisine of Hanoi Old Quarter",
    "introduction": "Night Cuisine of Hanoi Old Quarter brings you a delightful journey through the city’s vibrant evening flavors. Explore bustling street stalls, traditional dishes, and the lively atmosphere of Hanoi’s historic heart at night.",
    "type": "Cuisine Tour",
    "image": "MarketActivities",
    "notes": [
      "Wear sneakers or flat shoes for easy walking in the Old Quarter.",
      "Inform in advance if you have dietary restrictions, are vegetarian, or have food allergies.",
      "Prepare small cash (10,000 – 50,000 VND) for additional food purchases.",
      "Bring an umbrella, hat, or light raincoat depending on the weather."
    ],
    "policy": [
      "Children aged 1–4: Free of charge (parents take care of the child).",
      "Two adults can accompany one free child; the second child under 4 years old is charged 50%.",
      "Children aged 5–8: 75% of the tour price (own seat and meal included).",
      "Children from 9 years old: Full adult price."
    ],
    "price": {
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Beverages ordered outside the program.",
          "Extra expenses not mentioned in the itinerary.",
          "Tips for tour guides, drivers, and service staff."
        ]
      },
      "services": {
        "title": "Included services:",
        "content": [
          "Tourist vehicle for transportation according to the program.",
          "Bilingual English–Vietnamese tour guide.",
          "Tickets/food tastings at each stop (6–7 dishes).",
          "01 main meal (Bun Cha or Pho) with light drink.",
          "Full travel insurance (maximum compensation 20 million VND).",
          "Dasani bottled water 350ml/person/day."
        ]
      }
    },
    "schedules": [
      {
        "schedule": [
          {
            "time": [
              {
                "start": "17:30",
                "end": "18:00",
                "details": "Tour guide picks up guests at the hotel, starting the night food journey."
              },
              {
                "start": "18:15",
                "end": "18:45",
                "details": "Enjoy Hanoi Bún Thang at 11 Hang Hom Street — a sophisticated dish with over 20 ingredients."
              },
              {
                "start": "19:00",
                "end": "19:30",
                "details": "Walk along Ta Hien Street, taste fried fermented pork rolls, French fries, fried corn, and local draft beer."
              },
              {
                "start": "19:45",
                "end": "20:15",
                "details": "Enjoy sticky rice with mung bean and lotus leaf wrapping on Hang Ga Street."
              },
              {
                "start": "20:30",
                "end": "21:00",
                "details": "Try boiled snails and steamed clams with lemongrass on Dinh Liet Street."
              },
              {
                "start": "21:15",
                "end": "21:45",
                "details": "Visit the weekend night market on Hang Ngang – Hang Dao, enjoy Trang Tien ice cream or coconut sticky rice ice cream."
              },
              {
                "start": "22:00",
                "details": "Sip lemon tea near St. Joseph’s Cathedral and enjoy the lively night atmosphere."
              },
              {
                "start": "22:30",
                "details": "End of the tour, transfer guests back to the hotel."
              }
            ]
          }
        ]
      }
    ]
  },
  "3 Days 2 Nights Hanoi Culinary Journey": {
    "name": "3 Days 2 Nights Hanoi Culinary Journey",
    "type": "Cuisine Tour",
    "introduction": "3 Days 2 Nights Hanoi Culinary Journey offers an immersive experience into the heart of Vietnamese gastronomy. Discover authentic local dishes, visit bustling markets, and enjoy hands-on cooking sessions that reveal the true flavors of Hanoi.",
    "image": "LongTour",
    "notes": [
      "Wear sneakers or flat shoes for easy walking in the Old Quarter.",
      "Inform in advance if you have dietary restrictions, are vegetarian, or have food allergies.",
      "Prepare small cash (10,000 – 50,000 VND) for additional food purchases.",
      "Bring an umbrella, hat, or light raincoat depending on the weather."
    ],
    "policy": [
      "Children aged 1–4: Free of charge (parents take care of the child).",
      "Two adults can accompany one free child; the second child under 4 years old is charged 50%.",
      "Children aged 5–8: 75% of the tour price (own seat and meal included).",
      "Children from 9 years old: Full adult price."
    ],
    "price": {
      "extend": {
        "title": "Not included:",
        "content": [
          "VAT tax.",
          "Beverages ordered outside the program.",
          "Extra expenses not mentioned in the itinerary.",
          "Tips for tour guides, drivers, and service staff."
        ]
      },
      "services": {
        "title": "Included services:",
        "content": [
          "Tourist vehicle for transportation according to the program.",
          "Bilingual English–Vietnamese tour guide.",
          "Tickets/food tastings at each stop (6–7 dishes).",
          "01 main meal (Bun Cha or Pho) with light drink.",
          "Full travel insurance (maximum compensation 20 million VND).",
          "Dasani bottled water 350ml/person/day."
        ]
      }
    },
    "schedules": [
      {
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:45",
                "end": "08:15",
                "details": "Pick up guests at hotels in the Old Quarter/Opera House area."
              },
              {
                "start": "08:30",
                "end": "09:15",
                "details": "Visit Dong Xuan Market to explore fresh ingredients used for Pho, Bun Cha, and fried spring rolls."
              },
              {
                "start": "09:30",
                "end": "10:15",
                "details": "Enjoy traditional beef/chicken Pho while learning about the history and variations of Vietnam’s national dish."
              },
              {
                "start": "10:30",
                "end": "11:00",
                "details": "Relax at an old café, try Hanoi’s signature Egg Coffee."
              },
              {
                "start": "11:15",
                "end": "12:15",
                "details": "Taste Hanoi Bun Cha at a famous restaurant once visited by President Obama."
              },
              {
                "start": "12:30",
                "end": "13:30",
                "details": "Lunch with signature dishes: Cha Ca La Vong (grilled fish), fried spring rolls, duck bamboo shoot soup, and sautéed morning glory with garlic."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "14:00",
                "end": "15:00",
                "details": "Experience making Thanh Tri steamed rice rolls guided by a local artisan."
              },
              {
                "start": "15:15",
                "end": "16:30",
                "details": "Walk through the 36 streets of the Old Quarter, enjoy street snacks such as pillow cakes, fried sticky cakes, fried fermented pork rolls, and mango sweet soup."
              },
              {
                "start": "17:00",
                "end": "18:00",
                "details": "Visit Hoan Kiem Lake and enjoy Trang Tien ice cream."
              },
              {
                "start": "18:30",
                "end": "20:00",
                "details": "Dinner with rustic dishes: crab hotpot, West Lake shrimp cakes, and pork porridge."
              },
              {
                "start": "20:30",
                "end": "21:30",
                "details": "Free time to explore the Old Quarter night market. Overnight at a 3-star hotel in the city center."
              }
            ]
          }
        ]
      },
      {
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:00",
                "end": "08:00",
                "details": "Breakfast with Vietnamese baguette and pate, served with coffee."
              },
              {
                "start": "08:30",
                "end": "09:30",
                "details": "Depart for Bat Trang pottery village – try pottery making, visit the ceramic market, taste local snacks like rice cakes and baked cassava cakes."
              },
              {
                "start": "11:00",
                "end": "12:30",
                "details": "Visit Duong Lam Ancient Village – explore the communal house, old wells, and laterite houses. Lunch with local specialties: Mia chicken, braised fish with fermented bean sauce, boiled vegetables with dipping sauce, sesame candy, and peanut candy."
              },
              {
                "start": "14:00",
                "end": "16:00",
                "details": "Join a cooking class with a Hanoi chef, prepare traditional dishes like Pho, Bun Cha, or fried spring rolls, and enjoy your own creations."
              },
              {
                "start": "17:00",
                "end": "18:30",
                "details": "Return to the hotel to rest."
              },
              {
                "start": "21:00",
                "end": "23:00",
                "details": "Experience Long Bien wholesale market – the most bustling place in Hanoi at night. Enjoy hot sweet soup, sticky rice, grilled corn, or rice cakes right at the market. Overnight at the hotel."
              }
            ]
          }
        ]
      },
      {
        "schedule": [
          {
            "section": "Morning",
            "time": [
              {
                "start": "07:00",
                "end": "08:00",
                "details": "Breakfast with West Lake snail noodles – a rustic dish loved by locals."
              },
              {
                "start": "08:30",
                "end": "10:30",
                "details": "Visit Vong Green Rice Village (Cau Giay). Learn how to make young green rice, pound it yourself, and taste fresh green rice, green rice cakes, and green rice sweet soup."
              },
              {
                "start": "11:00",
                "end": "12:30",
                "details": "Lunch at a local restaurant: Bun Thang, Cha Ruoi (sandworm omelet), fish soup, and longan lotus seed sweet soup."
              }
            ]
          },
          {
            "section": "Afternoon",
            "time": [
              {
                "start": "13:30",
                "end": "14:30",
                "details": "Visit Hoa Lo Prison, listen to stories of Hanoi’s historical past."
              },
              {
                "start": "15:00",
                "end": "16:00",
                "details": "Buy Hanoi specialties as souvenirs: Hang Duong sugared fruits, West Lake lotus tea, and Nguyen Ninh green rice cakes."
              },
              {
                "start": "16:30",
                "details": "Transfer back to the initial pick-up point. End of the program."
              }
            ]
          }
        ]
      }
    ]
  },
  "Cultural Heritage": {
    "Cultural Heritage": "Cultural Heritage",
    "The place where national pride takes flight": "The place where national pride takes flight",
    "Local Cultural Events": "Local Cultural Events",
    "Local Cultural": "Local Cultural",
    "detail": "There is a village where the pride of the nation can be felt everywhere - for it is here that the national flags are made and sent across the entire country.",
    "The Keeper of the River’s Soul": "The Keeper of the River’s Soul",
    "Hearing the River Tell Its Tales": "Hearing the River Tell Its Tales",
    "Journey to the Land of Agarwood to Savor the Taste of Nem": "Journey to the Land of Agarwood to Savor the Taste of Nem",
    "Hanoi Recognized with Nine More National Intangible Cultural Heritages": "Hanoi Recognized with Nine More National Intangible Cultural Heritages",
    "Heritage": "Heritage",
    "Back to Trà Lộc Wetland": "Back to Tra Loc Wetland",
    "Xu Xoa – The Refreshing Sweet Jelly of Central Vietnam": "Xu Xoa – The Refreshing Sweet Jelly of Central Vietnam",
    "Timeless Melodies: The Enduring Vitality of Revolutionary Music": "Timeless Melodies: The Enduring Vitality of Revolutionary Music",
    "The Meal of Independence": "The Meal of Independence",
    "The Legendary Blue River Region": "The Legendary Blue River Region"
  },
  "Highlight": {
    "Highlight": "Highlight"
  },
  "Heritage Award": {
    "Heritage Award": "Heritage Award"
  },
  "Gallery": {
    "Gallery": "Gallery"
  },
  "Hoan Kiem Lake": {
    "name": "Hoan Kiem Lake (Sword Lake)",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.097617496516!2d105.84978977515314!3d21.028779737778155!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab953357c995%3A0x1babf6bb4f9a20e!2zSOG7kyBIb8OgbiBLaeG6v20!5e0!3m2!1svi!2s!4v1760722403345!5m2!1svi!2s",
    "type": "rest",
    "introduction": "Hoan Kiem Lake (Sword Lake) is a cultural and historical symbol of Hanoi capital and a favorite destination for domestic and international tourists. Located in the center of the city, the lake is not only an ideal relaxing place but also associated with many legends and ancient architectural works.",
    "location": "Hoan Kiem Lake is located right in the center of Hoan Kiem district, surrounded by Hang Khay, Le Thai To, and Dinh Tien Hoang streets, Hanoi.",
    "description": [
      {
        "title": "Location of Hoan Kiem Lake",
        "content": [
          "Hoan Kiem Lake (Sword Lake) is located right in the center of Hoan Kiem district, so it is very convenient for tourists to visit the scenery and explore many interesting experiences at any time of the day.",
          "Because it is located in a prime location, connecting the Old Quarter area such as Hang Ngang, Hang Dao, Cau Go, Luong Van Can... with the Western Quarter area including Nha Tho, Trang Thi, Hang Bai, Trang Tien, Hang Khay..., Hoan Kiem Lake attracts many domestic and international tourists to visit and explore during their Hanoi trip."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20020219.png"
      },
      {
        "title": "History of Hoan Kiem Lake",
        "content": [
          "The lake has existed for a very long time, about several thousand years ago. Before officially being named Hoan Kiem, the lake had many different names such as Luc Thuy Lake because the lake water was blue all year round, or Thuy Quan Lake because the former court used this place to review naval forces.",
          "The name Hoan Kiem appeared in the early 15th century, associated with the legend of King Le Thai To returning the sacred sword to the Golden Turtle after using it to defeat the Ming invaders, opening a prosperous Le dynasty.",
          "The legend recounts that when King Le Loi was boating on Luc Thuy Lake, a golden turtle surfaced, grabbed the Thuan Thien sword, and dove to the bottom of the lake. The King believed it was the will of heaven, so he renamed the lake Ho Hoan Kiem – meaning returning the sword.",
          "By the end of the 16th century, Lord Trinh divided the lake into left and right parts, called Vong Lake. In 1884, the Huu Vong part of the lake was filled to expand the capital, and the Ta Vong part is today's Hoan Kiem Lake."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20020426.png?t=1760727949906"
      },
      {
        "title": "Transportation to Hoan Kiem Lake",
        "content": [
          "If tourists stay at hotels around the Old Quarter area, it only takes a few minutes walk to reach Hoan Kiem Lake, Ngoc Son Temple, or the pedestrian street around the lake.",
          "If staying far from the center, tourists can take a taxi or bus. Bus routes passing Hoan Kiem Lake include numbers 09, 14, and 16 with a frequency of 15–20 minutes/trip (from 5:05 AM to 9:05 PM).",
          "When taking a taxi, tourists should choose reputable companies like Mai Linh, Thanh Cong to avoid being overcharged."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20020658.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20004213.png",
    "activities": [
      {
        "content": [
          "Walking around the lake and taking photos with Turtle Tower – the symbol of Hanoi capital.",
          "Visiting Ngoc Son Temple and the bright red The Huc Bridge stretching out into the middle of the lake.",
          "Enjoying Trang Tien ice cream, Old Quarter coffee, or experiencing the vibrant atmosphere at the pedestrian street around the lake on weekends."
        ]
      }
    ]
  },
  "Ngoc Son Temple": {
    "name": "Ngoc Son Temple",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.049800072293!2d105.84981117515318!3d21.0306932877124!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abc000809ea7%3A0xbb2716ec0282371d!2zxJDhu4FuIE5n4buNYyBTxqFu!5e0!3m2!1svi!2s!4v1760723454577!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "Ngoc Son Temple is a famous spiritual and cultural symbol of Hanoi capital, attracting tourists thanks to its ancient beauty and long-standing historical value. With a prime location in the heart of Sword Lake, this is an unmissable destination in the journey to explore Hanoi's thousand-year civilization.",
    "location": "Dinh Tien Hoang Street, Hang Trong Ward, Hoan Kiem District, Hanoi",
    "description": [
      {
        "title": "Location of Ngoc Son Temple",
        "content": [
          "Ngoc Son Temple is located on a mound of land called Ngoc Son Islet in the northeast of Sword Lake.",
          "The temple gate is located at Dinh Tien Hoang Street, Hang Trong Ward, Hoan Kiem District, Hanoi capital.",
          "Ngoc Son Temple was built in the 19th century to worship Quan De to help suppress evil and bring good things to the people.",
          "During the Tran Dynasty, the temple was renamed Ngoc Son – a place to worship soldiers and generals who sacrificed in the resistance war against the Yuan-Mongol invaders."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005215.png"
      },
      {
        "title": "Formation History",
        "content": [
          "During the reign of King Le Vinh Huu (1735–1739), Lord Trinh Giang built Khanh Thuy Palace on the old foundation of Ngoc Son Temple and built two earthen mounds on the eastern bank, called Dao Tai Mountain and Ngoc Boi Mountain.",
          "At the end of the Le Dynasty, the palace was partially destroyed. Later, the philanthropist Tin Trai built Ngoc Son Pagoda to worship Buddha, which later became a temple worshiping Van Xuong De Quan – the god protecting academic success and fame.",
          "In 1865, the scholar Nguyen Van Sieu extensively renovated the temple, adding Trấn Ba Pavilion, The Huc Bridge, the Inkstone Tower and the Pen Tower, turning this place into a unique cultural and academic symbol of Hanoi.",
          "In 2013, Ngoc Son Temple was ranked as a Special National Monument, affirming its great historical and cultural value."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005316.png"
      },
      {
        "title": "Unique Architecture of Ngoc Son Temple",
        "content": [
          "Ngoc Son Temple is designed in the Tam character style consisting of three main compartments: the Ceremonial Hall, the Central Hall, and the Sanctuary.",
          "The Ceremonial Hall is the first place for rituals, the Central Hall worships Van Xuong, Quan Vu, and La To – gods of learning; the Sanctuary worships Tran Hung Dao – a national hero.",
          "To the south of the temple is Trấn Ba Pavilion with a square architecture, two floors, eight roofs, representing the characteristics of ancient Vietnamese architecture.",
          "Surrounding the temple are three famous structures: the Pen Tower, the Inkstone Tower, and The Huc Bridge – symbolizing the studious spirit and honoring the knowledge of the Vietnamese people."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005446.png"
      },
      {
        "title": "Cultural Symbols around the Temple",
        "content": [
          "The Pen Tower is 9m high, built in 1865, with three words 'Ta Thanh Thien' (Write on the blue sky) carved on the body, expressing the spirit of learning.",
          "At the foot of the Pen Tower is the Inkstone Tower made of blue stone placed on the backs of three toads, carved with Nguyen Van Sieu's inscription, praising knowledge and literature.",
          "The Huc Bridge is made of wood, curved like a shrimp, meaning 'the place where the morning sun rays stop', symbolizing luck and prosperity.",
          "The harmonious combination of the Pen Tower, Inkstone Tower, and The Huc Bridge creates a beautiful landscape, symbolizing the philosophy of Yin-Yang harmony and the Vietnamese tradition of studiousness."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005535.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20004936.png"
  },
  "Turtle Tower": {
    "name": "Turtle Tower",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.049550786968!2d105.84981117493851!3d21.030703263136587!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab952ba31a31%3A0xe4182b099be6c860!2zVGjDoXAgUsO5YQ!5e0!3m2!1svi!2s!4v1760723921200!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Turtle Tower is a famous historical and cultural symbol of Hanoi capital, majestically located in the heart of Hoan Kiem Lake. With its ancient beauty and unique architecture combining Western and Vietnamese styles, Turtle Tower has become an image associated with Hanoi's thousand-year civilization.",
    "location": "South of Hoan Kiem Lake, Hoan Kiem District, Hanoi",
    "description": [
      {
        "title": "Location of Turtle Tower",
        "content": [
          "Turtle Tower was built on a small islet located in the South of Hoan Kiem Lake, center of Hanoi capital.",
          "The tower is located in a prime position, surrounded by calm lake water and green trees, creating a peaceful and poetic scene.",
          "Thanks to its prominent position in the middle of the lake, Turtle Tower attracts many domestic and international tourists to visit, becoming an inseparable part of Hanoi's image."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010032.png"
      },
      {
        "title": "History of Turtle Tower",
        "content": [
          "Turtle Tower was built on a mound of land about 350m² wide, also called Turtle Mound – where the Sword Lake turtles used to come up to sunbathe or lay eggs.",
          "According to historical records, Turtle Mound has existed since the time of King Le Thanh Tong and was once the place to build Dieu Dai for the king to fish. By the time of the Restored Le Dynasty, Lord Trinh built Ta Vong Pavilion on the mound, but by the Nguyen Dynasty it was no more.",
          "In 1886, Mr. Nguyen Ngoc Kim (Ba Ho Kim) asked permission from the French government to build a tower on Turtle Mound to bury his father's remains, thanks to the location considered favorable according to feng shui.",
          "Initially, the construction was called Ba Ho Kim Tower, later renamed Turtle Tower – associated with the legend of King Le Loi returning the sword to the Golden Turtle after defeating the Ming invaders.",
          "Although only over 130 years old, the history of building a tower on Turtle Mound dates back more than 500 years, from the time of King Le Thai Tong (1435)."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010158.png"
      },
      {
        "title": "Ideal Time to Visit Turtle Tower",
        "content": [
          "Autumn (August to November) is considered the most beautiful time to visit Turtle Tower.",
          "At this time, Hanoi has cool weather, fresh air, the faint fragrance of milk flowers and yellow leaves falling everywhere creating a poetic and romantic scene.",
          "In addition, evening is also an ideal time to admire Turtle Tower with dazzling lights reflecting on the lake surface, offering an unforgettable magical beauty."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010315.png"
      },
      {
        "title": "How to Get to Turtle Tower",
        "content": [
          "Tourists can come to Hanoi by various means such as plane, train, coach, or motorbike.",
          "From Noi Bai Airport, you can travel by taxi, bus, or airport shuttle service to the Hoan Kiem Lake area.",
          "Bus routes passing the lake include: 09, 14, 08, 31, 36, 04,… In addition, taxis from companies like Mai Linh, Ba Sao, Thanh Cong all operate around this area.",
          "If staying in the Old Quarter, you only need to walk a few minutes to admire Turtle Tower right in the middle of Sword Lake."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010418.png"
      },
      {
        "title": "Unique Architecture of Turtle Tower",
        "content": [
          "Turtle Tower is a harmonious combination of European Gothic style and ancient Vietnamese architecture.",
          "The tower was built on a rectangular earthen mound with four floors, total height of 8.8m.",
          "Floor 1 has a foundation 0.8m high, length 6.28m, width 4.54m, with a total of 14 arched doors – creating an open and airy space.",
          "Floors 2 and 3 have gradually smaller sizes, with floor 3 having a circular door 0.6m in diameter facing East.",
          "Floor 4 is a small watchtower, each side about 2m. On the eastern face, three words 'Quy Son Thap' (Turtle Mountain Tower) are carved. The tower roof has traditional Vietnamese features with curved upswept eaves and dragons flanking the moon.",
          "The overall architecture of Turtle Tower creates a solemn, ancient beauty while still harmonizing with the surrounding natural landscape."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010502.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005735.png"
  },
  "One Pillar Pagoda": {
    "name": "One Pillar Pagoda",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.921351789057!2d105.83104567515325!3d21.03583268753582!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba1728475ed%3A0xdbe7366fe9dfc2ae!2zQ2jDuWEgTeG7mXQgQ-G7mXQ!5e0!3m2!1svi!2s!4v1760724531706!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "One Pillar Pagoda – a sacred symbol and unique architecture of Hanoi, built in 1049 during the reign of King Ly Thai Tong. The pagoda has the shape of a lotus rising from the water, expressing the profound philosophy of Buddhism about purity and enlightenment.",
    "location": "Ong Ich Khiem Street, Ba Dinh District, Hanoi",
    "description": [
      {
        "title": "Introduction to One Pillar Pagoda",
        "content": [
          "One Pillar Pagoda, also known as Dien Huu Pagoda, was built in 1049 during the reign of King Ly Thai Tong.",
          "The pagoda is located in the Ba Dinh area, near Ho Chi Minh Mausoleum, and is a cultural-spiritual symbol of Hanoi."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011541.png"
      },
      {
        "title": "Meaning and Legend of its Formation",
        "content": [
          "According to legend, King Ly Thai Tong dreamed that the Goddess of Mercy Quan Am gave him a bright lotus flower.",
          "After waking up, the king built a pagoda on Linh Chieu Lake, with architecture resembling a lotus flower blooming on the water surface, to commemorate the grace of the Goddess and pray for national peace and people's safety.",
          "During the reign of King Ly Nhan Tong, the pagoda was renovated, Linh Chieu Lake was built and a gilded lotus tower was added at the top of the pillar."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011639.png"
      },
      {
        "title": "Unique Architecture",
        "content": [
          "One Pillar Pagoda is a symbol of architectural, sculptural art and Buddhist philosophy.",
          "The structure consists of a large stone pillar supporting a small pagoda above, with curved roof shaped like a dragon, creating the image of a pure lotus blooming in the middle of a tranquil lake.",
          "The architecture expresses the harmony between heaven and earth, humans and the universe."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011746.png"
      },
      {
        "title": "Prominent Areas in the Pagoda",
        "content": [
          "The stone steps leading to the main hall consist of 13 stone steps built from the Ly Dynasty, still intact after hundreds of years.",
          "The altar of Quan The Am Bo Tat is placed in the middle of Lien Hoa Dai, the statue is gilded and placed on a meticulously carved wooden lotus pedestal.",
          "The bodhi tree next to the pagoda is a gift from Indian President Rajendra Prasad to President Ho Chi Minh, propagated from the bodhi tree where Buddha attained enlightenment.",
          "The Three-Entrance Gate has traditional Vietnamese architecture, symbolizing the three views of Buddhism: Existence view, Emptiness view, and Middle view."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011902.png"
      },
      {
        "title": "Opening Hours and Ticket Prices",
        "content": [
          "Opening hours: 7:00 – 18:00 daily.",
          "Free for Vietnamese citizens coming to visit the scenery, worship Buddha, or make offerings.",
          "Entrance fee for foreign visitors: 25,000 VND/person.",
          "Average visiting duration: 1 – 3 hours."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011951.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011424.png",
    "activities": [
      {
        "content": [
          "Visiting and taking photos at Lien Hoa Dai – the symbol of the pagoda.",
          "Burning incense, praying for peace and luck at the main hall.",
          "Learning about the history of the Ly Dynasty and the ancient architectural value of Hanoi.",
          "Walking around the nearby Ho Chi Minh Mausoleum area and Ba Dinh Square."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012031.png"
      }
    ]
  },
  "Imperial Citadel of Thang Long": {
    "name": "Imperial Citadel of Thang Long",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.9364640247854!2d105.83768447515334!3d21.03522808755661!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba3381d7c49%3A0xb521a7d98f582937!2zSG_DoG5nIFRow6BuaCBUaMSDbmcgTG9uZw!5e0!3m2!1svi!2s!4v1760725453275!5m2!1svi!2s",
    "type": "culture",
    "introduction": "The Imperial Citadel of Thang Long is a typical historical relic complex of Vietnam, associated with the formation and development of Thang Long - Hanoi capital for 13 centuries. This was the political, cultural, and administrative center of Vietnamese feudal dynasties and was recognized by UNESCO as a World Cultural Heritage in 2010.",
    "location": "19C Hoang Dieu Street, Ba Dinh District, Hanoi City",
    "description": [
      {
        "title": "Location and Transportation Guide",
        "content": [
          "The Imperial Citadel of Thang Long is located right in the center of Hanoi Capital, at 19C Hoang Dieu Street, Ba Dinh District.",
          "Tourists can easily travel by motorbike, bicycle, or car. From Hoan Kiem Lake, follow Trang Thi Street, turn into Dien Bien Phu Street, then enter Hoang Dieu Street to reach the main gate.",
          "Alternatively, you can travel by bus route number 22 to reach the relic site.",
          "Opening hours: 8:00 AM – 5:00 PM daily."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012538.png"
      },
      {
        "title": "Formation History and Architecture",
        "content": [
          "The Imperial Citadel of Thang Long has a history spanning 13 centuries, through many feudal dynasties such as Ly, Tran, Le, Mac, Nguyen, and the period of resistance against the French.",
          "Ly Dynasty (11th–12th centuries): King Ly Thai To moved the capital from Hoa Lu to Thang Long, building the Capital Citadel with three walled rings: Dai La Citadel, Imperial Citadel, and Forbidden Citadel.",
          "Tran Dynasty (13th–14th centuries): The Tran kings built many new works, expanding the palace area.",
          "Early Le Dynasty (15th century): The Imperial Citadel was expanded to double the scale, becoming the largest power center in the country.",
          "Mac Dynasty (16th century): The Mac dynasty reinforced the city gates, built more earthen ramparts, but were destroyed by the Trinh army when they occupied it.",
          "Restored Le Dynasty (17th–18th centuries): Lord Trinh Doanh rebuilt a new citadel on the foundation of Dai La, naming it Dai Do.",
          "Tay Son Period (18th century): King Quang Trung still had it repaired and added some works here even though he moved the capital to Phu Xuan (Hue).",
          "Nguyen Dynasty (19th–20th centuries): Thang Long became the Northern Citadel post, with reduced scale compared to before.",
          "French Colonial Period: The French changed the structure of the Imperial Citadel, building more military barracks.",
          "In 2002, the relic site was excavated over an area of 19,000m², discovering many valuable cultural layers.",
          "In 2010, UNESCO recognized the Central Sector of the Imperial Citadel of Thang Long as a World Cultural Heritage."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012635.png"
      },
      {
        "title": "Historical and Cultural Significance",
        "content": [
          "The Imperial Citadel of Thang Long is a symbol of the nation-building and defense process throughout over a millennium.",
          "The central area and the archaeological site at 18 Hoang Dieu preserve many layers of relics showing the succession between dynasties.",
          "Although many ancient structures are no longer intact, the remaining traces carry great historical, cultural, and architectural value, demonstrating the mettle and intelligence of the Vietnamese nation."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012731.png"
      },
      {
        "title": "Prominent Structures in the Relic Site",
        "content": [
          "Hanoi Flag Tower: Built in 1812 during the reign of King Gia Long, consisting of 3 pyramidal base floors and a high pillar body, a prominent symbol on Dien Bien Phu Street.",
          "Northern Gate (Chinh Bac Mon): The only remaining city gate, built in 1805, worships two famous generals Nguyen Tri Phuong and Hoang Dieu.",
          "Kinh Thien Palace: The center for ceremonies and royal courts of the former court, now only the palace foundation, stone steps, and a pair of exquisitely carved dragons remain.",
          "Doan Mon: The main gate leading to Kinh Thien Palace, consisting of 5 arched stone gates, bearing ancient majestic features."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012814.png"
      },
      {
        "title": "Night Tour – Decoding the Imperial Citadel of Thang Long",
        "content": [
          "The 'Decoding the Imperial Citadel of Thang Long' tour is a prominent activity for tourists, taking place on Saturday and Sunday evenings every week.",
          "The tour lasts 90 minutes, departing at 6:00 PM, 6:30 PM, and 7:00 PM.",
          "Tourists can admire the palatial space shimmering under lantern light, explore ancient architecture, precious artifacts, and enjoy special royal court dances."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012858.png"
      },
      {
        "title": "Archaeological Area and Check-in Activities",
        "content": [
          "The Imperial Citadel Archaeological Area at 18 Hoang Dieu includes 4 main areas, preserving relic layers through many periods.",
          "Here, visitors can tour ancient wells, palace foundations, and many valuable excavated artifacts.",
          "This area is also a famous photo spot, attracting many tourists and young people to check-in with traditional costumes and ao dai."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012538.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012333.png",
    "activities": [
      {
        "content": [
          "Visiting prominent structures: Hanoi Flag Tower, Northern Gate, Kinh Thien Palace, Doan Mon.",
          "Participating in the exciting night tour 'Decoding the Imperial Citadel of Thang Long'.",
          "Exploring the archaeological area at 18 Hoang Dieu and admiring precious artifacts.",
          "Taking souvenir photos with Vietnamese traditional costumes.",
          "Learning about the history and culture of Thang Long – Hanoi through exhibitions and displayed artifacts."
        ],
        "image": "/images/thanglong/activities.jpg"
      }
    ]
  },
  "Co Loa Citadel": {
    "name": "Co Loa Citadel",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3722.0093731347138!2d105.86886257515512!3d21.112192484907943!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x313500b2ffacb0a3%3A0x952a436b3aab36de!2zRGkgdMOtY2ggVGjDoG5oIEPhu5UgTG9h!5e0!3m2!1svi!2s!4v1760725934191!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Co Loa Citadel (also known as Loa Thanh) is a famous ancient citadel associated with the legend of An Duong Vuong and the story of My Chau – Trong Thuy. Built in the 3rd century BC, Co Loa was once the capital of Au Lac, demonstrating the outstanding technical level and creativity of the ancient Vietnamese.",
    "location": "Co Loa Commune, Dong Anh District, Hanoi City",
    "description": [
      {
        "title": "Introduction to Co Loa Citadel",
        "content": [
          "Co Loa Citadel was built in the 3rd century BC, the capital of Au Lac nation founded by An Duong Vuong.",
          "The entire relic site currently has about 60 ancient relics, of which 7 are ranked National level.",
          "Co Loa is considered the largest and most uniquely structured citadel in Vietnam, while preserving many special historical, architectural, and intangible cultural values.",
          "Many structures such as Thuong Temple, Co Loa Communal House, Ba Chua Shrine, Ngoc Well... are still preserved and attract domestic and international tourists."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20013343.png"
      },
      {
        "title": "Ticket Prices and Opening Hours",
        "content": [
          "Opening hours: 8:00 AM – 5:00 PM daily.",
          "Entrance fee: 5,000 – 10,000 VND/person.",
          "Free for children under 15 and people with revolutionary merits.",
          "Incense offering ceremony cost: 600,000 VND/group.",
          "Tour guide fee: about 300,000 VND/turn."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014418.png"
      },
      {
        "title": "Ideal Time to Visit",
        "content": [
          "Tourists can visit Co Loa at any time of the year, but the most beautiful is summer when flamboyant and Lagerstroemia flowers bloom profusely.",
          "If you want to experience the festival atmosphere, come on the 5th–6th of the Lunar January, when the Co Loa Festival takes place honoring the merits of An Duong Vuong.",
          "Additionally, on the 1st, 6th, 11th, 16th, 21st, and 26th of the lunar month, this area holds the traditional Sa market – a unique folk culture feature only held 5 days each month."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014519.png"
      },
      {
        "title": "Transportation and How to Get There",
        "content": [
          "Co Loa Citadel is located more than 20 km from central Hanoi, in Dong Anh district.",
          "Bus is the most convenient and economical means, fare from 7,000 – 9,000 VND/trip.",
          "Bus routes to Co Loa: routes 15, 17 (Long Bien), 43 (Hanoi Station), 46 (My Dinh), 59 (Nhu Quynh – Agriculture).",
          "Besides buses, tourists can go by motorbike or car via directions: Thang Long Bridge, Chuong Duong Bridge, or Nhat Tan Bridge."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014619.png"
      },
      {
        "title": "Unique Architecture of Co Loa Citadel",
        "content": [
          "Co Loa Citadel has a spiral shape, hence also called Loa Thanh.",
          "According to historical records, the citadel had a total of 9 spiral rings, today only 3 main rings remain: the Inner Citadel, the Middle Citadel, and the Outer Citadel.",
          "The Outer Citadel has a circumference of about 8 km, built of earth, 4–5 m high, some places up to 12 m high, with a total earth volume of about 2.3 million m³.",
          "The Middle Citadel circumference is 6.5 km, more solid, while the Inner Citadel is 2 km² wide – where King An Duong Vuong lived with the royal family.",
          "Today, many sections of the citadel and moats still exist, testifying to the unique military technical level of the ancient Vietnamese."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014726.png"
      },
      {
        "title": "Prominent Visiting Sites",
        "content": [
          "Thuong Temple (An Duong Vuong Temple): Built on the old palace foundation, worships King Thuc Phan – who built Co Loa Citadel. Inside there is a bronze statue of the king and many valuable ancient artifacts.",
          "Ngoc Well: Located in front of Thuong Temple, associated with the legend of My Chau – Trong Thuy. Legend has it that the well water can brighten pearls.",
          "Ba Chua Shrine (My Chau's Tomb): Located behind an ancient banyan tree, worships Princess My Chau – a symbol of loyalty and love tragedy.",
          "Cao Lo Temple: A place worshiping the talented general who helped An Duong Vuong build the citadel and create the legendary Lien Chau crossbow.",
          "Ngu Trieu Di Quy Communal House: Located on the foundation of the former royal court, has solid architecture, currently a place displaying many valuable archaeological artifacts.",
          "Archaeological Exhibition House: Exhibits excavated ancient artifacts, including the ancient Co Loa map, bronze arrowheads, and a model of the divine crossbow."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014859.png"
      },
      {
        "title": "Cuisine and Specialties at Co Loa",
        "content": [
          "Mach Trang Noodles – a specialty of Dong Anh region, with thick, slightly opaque strands, crispy and characteristically chewy.",
          "Co Loa Mussel Porridge – a famous dish, cooked from mussels of Hoang Giang river, sweet and light taste, eaten with fried breadsticks and pickled eggplant, price only from 15,000 VND/bowl.",
          "Besides, Co Loa market also sells many other rustic dishes such as steamed rice cake, rolled rice cake, crab noodle soup, bearing the typical Northern flavor."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014859.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20013254.png",
    "activities": [
      {
        "content": [
          "Visiting historical structures: Thuong Temple, Ngoc Well, Ba Chua Shrine, Cao Lo Temple, Ngu Trieu Di Quy Communal House.",
          "Learning about the legend of An Duong Vuong – My Chau – Trong Thuy through the relics.",
          "Participating in the Co Loa Festival in the Lunar January with traditional palanquin processions, rituals.",
          "Exploring the unique spiral citadel architecture and ancient moat system.",
          "Enjoying local specialties such as Mach Trang noodles, mussel porridge, steamed rice cake."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20015321.png"
      }
    ]
  },
  "Temple of Literature - Imperial Academy": {
    "name": "Temple of Literature - Imperial Academy",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.1140404633256!2d105.83309427515317!3d21.02812248780075!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab9926e7bd67%3A0x580e078874d5df1e!2zVsSDbiBNacOqzIF1IOKAkyBRdcO0zIFjIFTGsMyJIEdpYcyBbQ!5e0!3m2!1svi!2s!4v1760728357702!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Coming to Hanoi, everyone must visit and experience the historical and cultural relic site, the complex of relics about the first university of our country, which is the Temple of Literature - Imperial Academy.",
    "location": "58 Quoc Tu Giam, Dong Da District, Hanoi",
    "description": [
      {
        "title": "General Overview of Temple of Literature - Imperial Academy",
        "content": [
          "The Temple of Literature - Imperial Academy is not only considered a historical and cultural relic site but also a place where many students and pupils come to pray for luck in exams and studies.",
          "Where is the Temple of Literature - Imperial Academy located? The Temple of Literature is located in the Dong Da area, Hanoi and is situated within 4 main streets including Nguyen Thai Hoc, Ton Duc Thang, Van Mieu, and Quoc Tu Giam. The entrance gate to the Temple of Literature - Imperial Academy is at 58 Quoc Tu Giam, Dong Da, Hanoi.",
          "When traveling to Hanoi with its thousand-year civilization, this is definitely a place you should visit."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021557.png"
      },
      {
        "title": "Directions and Transportation Guide",
        "content": [
          "If moving from Hoan Kiem Lake, you just need to go along Le Thai To Street, turn right into Truong Thi Street, go towards Cua Nam Street, Nguyen Khuyen Street then turn left into Van Mieu Street to arrive. Ensure traffic safety laws and avoid going into one-way streets!",
          "If traveling by bus, routes 02, 23, 38, 25, 41 are buses that have stops near here."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021650.png"
      },
      {
        "title": "Opening Hours and Ticket Prices",
        "content": [
          "Opening hours: All days of the week, from Monday to Sunday.",
          "Hot season (from April 15 to October 15): From 7:30 AM to 5:30 PM.",
          "Cold season (from October 16 to April 14): From 8:00 AM to 5:00 PM.",
          "Currently, tourists and locals visiting must buy entrance tickets. For adults it is 30,000 VND and for children it is 20,000 VND. This price is quite cheap and applies to both Vietnamese and foreign visitors."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021757.png"
      },
      {
        "title": "Overall Map of Temple of Literature - Imperial Academy",
        "content": [
          "The Temple of Literature - Imperial Academy is divided into 15 basic areas including: Van Lake, Ha Ma Stele, Four Pillars, Giam Garden, Temple of Literature Gate, Dai Trung Gate, Khue Van Pavilion, Thien Quang Well, Doctor Stelae, Dai Thanh Gate, Dai Thanh Area, Thai Hoc Gate, Thai Hoc Area, Bell Tower, Drum Tower."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021830.png"
      },
      {
        "title": "History of Temple of Literature - Imperial Academy",
        "content": [
          "The Temple of Literature was built in 1070 during the reign of King Ly Thanh Tong, this was the place to worship Confucius, Chu Cong, Tu Phoi.",
          "In 1076, King Ly Nhan Tong established the Imperial Academy next to it as a university exclusively for the king's children and noble families. By the time of King Tran Thai Tong, this place was renamed Quoc Hoc Vien and also admitted commoners' children with excellent academic achievements.",
          "History of development of the Temple of Literature - During the Later Le period, King Le Thanh Tong began to erect stelae of those who passed the doctoral exams. During the Nguyen Dynasty, the Imperial Academy was established in Hue, Thang Long Temple of Literature was repaired to become only the Temple of Literature of the Northern Citadel, later renamed Hanoi Temple of Literature.",
          "The Temple of Literature - Imperial Academy is located in a campus of about 54,331 m2 including many different architectural works. Having undergone many renovations, this complex still includes Van Lake, Van Mieu Gate, Dai Trung Gate, Khue Van Pavilion, Thien Quang Well, doctoral stelae, Dai Thanh Gate, Thai Hoc House.",
          "This place has been recognized by the Prime Minister as a Special National Monument. Khue Van Pavilion at the Temple of Literature - Imperial Academy was chosen as the symbol of the Capital according to the Capital Law, the 82 Doctor Stelae here were recognized by UNESCO as a Documentary Heritage and inscribed in the Memory of the World Global Register."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021913.png"
      },
      {
        "title": "Visiting Areas at Temple of Literature - Imperial Academy",
        "content": [
          "Notable are the surrounding walls built of brick and inside divided into 5 compartments, each area has separating walls and connecting gates.",
          "First area - Main Gate of Temple of Literature: The main Van Mieu Mon gate leading to Dai Trung Mon gate is built in the Tam Quan style with ancient Chinese characters, with two small gates on the sides being Thanh Duc Mon and Dat Tai Mon.",
          "Second area - Khue Van Pavilion: From Dai Trung Mon into Khue Van Pavilion, the architectural works here are not massive but the proportions are very harmonious and beautiful. The architecture includes 4 square brick pillars (85cm x 85cm) below supporting the upper floor and has very beautiful wooden structures.",
          "The upper floor has 4 round doors, handrail balustrades and wooden brackets supporting the simple, rustic roof. The tile roof has two layers forming an 8-roof structure, with flat roof edges and roof surface. The pavilion is a square two-story eight-roof tower, the four surrounding walls are round sun-shaped windows radiating light. On the left and right of Khue Van Pavilion are Bi Van Mon and Suc Van Mon leading to two areas of Doctor Stelae houses.",
          "Third area - Doctor Stelae area: Includes Thien Quang Tinh lake, square shaped, on both sides of the lake are the Doctor Stelae houses, each made of stone, engraved with the names of those who passed Trang Nguyen, Bang Nhan, Tham Hoa, Hoang Giap, Tien Si and placed on turtle backs. The most valuable relics of this relic site today are 82 stelae from various exam sessions.",
          "Fourth area - Central area: Belonging to the main architecture of the Temple of Literature, there are large works with parallel and consecutive layouts. The outer building is the Ceremonial Hall, the inner building is the Upper Sanctuary, this is the area used to worship Confucius, Tu Phoi (Nhan Tu, Tang Tu, Tu Tu, Manh Tu).",
          "Fifth area - Thai Hoc House: During the Nguyen Dynasty, the Imperial Academy was abolished, the Thai Hoc house was converted into Khai Thanh house, worshiping the father and mother of Confucius. This house was destroyed during the resistance against the French and was newly rebuilt in 1999. This place also has Tien Duong - Hau Duong houses, which are places for Ly Thanh Tong, Ly Nhan Tong, Le Thanh Tong and the rector of the Imperial Academy Chu Van An."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20022000.png"
      },
      {
        "title": "Characteristic Meaning of Temple of Literature - Imperial Academy",
        "content": [
          "Dubbed as the first university of our country and a place preserving the studious traditions of the Vietnamese people.",
          "Being further motivated by the golden achievements of our ancestors in the journey of striving to learn and explore human knowledge.",
          "Today, this place is also a place to organize poetry festivals, reward excellent, outstanding students, and is a famous tourist attraction visited by domestic and foreign tourists.",
          "This is also the 'letter asking' meeting point for Hanoi residents during traditional Tet holidays with wishes for a peaceful new year, during the exam season of students."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20022047.png"
      },
      {
        "title": "Some Notes When Visiting Temple of Literature - Imperial Academy",
        "content": [
          "Respect the relic, comply with the regulations of the management units, do not damage artifacts, relic landscapes, do not rub the turtle heads, write, draw, stand, or sit on the Doctor Stelae,...",
          "Clothing should be neat, clean, do not wear too short skirts or revealing clothes indoors. Do not smoke, wear hats, caps in the worship hall,...",
          "Practice civilized behavior in places of worship.",
          "Do not abuse the freedom of belief to perform superstitious, fraudulent activities,...",
          "Maintain hygiene, protect the environmental landscape.",
          "Do not bring weapons, explosives, flammable substances into the relic."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20022131.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021533.png",
    "activities": [
      {
        "content": [
          "Visiting, taking check-in photos at Khue Van Pavilion – the symbol of Hanoi.",
          "Learning about Vietnamese education history through the Doctor Stelae.",
          "Attending festivals, spring poetry festivals and asking for calligraphy at the beginning of the year."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20022204.png"
      }
    ]
  },
  "TRAN QUOC PAGODA": {
    "name": "TRAN QUOC PAGODA",
    "map": "46 Thanh Nien Street, Yen Phu Ward, Tay Ho District, Hanoi",
    "type": "Spiritual Tourist Destination",
    "introduction": "Tran Quoc Pagoda - A famous spiritual tourist destination in Hanoi. If you have the opportunity to travel to Hanoi, visit Tran Quoc Pagoda, a unique ancient pagoda located at 46 Thanh Nien Street, Yen Phu Ward, Tay Ho District. With an age of up to 1500 years, this is one of the oldest pagodas in Vietnam and was honored to be in the Top '10 most beautiful pagodas in the world'.",
    "location": "46 Thanh Nien Street, Yen Phu Ward, Tay Ho District, Hanoi",
    "description": [
      {
        "content": [
          "Tran Quoc Pagoda shimmeringly reflects on West Lake Hanoi",
          "Hanoi Capital is still famous as a land with rich culture, history and countless famous scenic spots and sacred temple and shrine works. When traveling to Hanoi, tourists should take some time to visit Tran Quoc Pagoda - a pagoda with 1500 years of age carrying both ancient architectural beauty and long-standing historical and spiritual value."
        ]
      },
      {
        "title": "Who is worshiped at Tran Quoc Pagoda?",
        "content": [
          "If you are planning a spiritual tour to visit pagodas in Hanoi, you cannot miss Tran Quoc Pagoda. Once the center of Buddhism of Thang Long during the Ly - Tran period, Tran Quoc Pagoda on West Lake has now become an attractive spiritual destination, attracting a large number of tourists to visit and worship annually.",
          "Tran Quoc Pagoda follows the Northern sect. Inside the temple worships Amitabha Buddha, Shakyamuni Buddha, and Quan Am Buddha. The pagoda also has altars for Quan Binh, Quan Vu, Chu Thuong, Duc Ong and the attendants."
        ]
      },
      {
        "title": "History of Tran Quoc Pagoda",
        "content": [
          "According to historical records and documents, Tran Quoc Pagoda was built in 541 during the Early Ly period and was initially named Khai Quoc Pagoda. In the early days, the pagoda was located at the land of Yen Hoa village, which is today's Yen Phu village.",
          "In 1440, King Le Thai Tong renamed the pagoda to An Quoc Pagoda with the wish for a peaceful and lasting country. In 1615, during the reign of King Le Kinh Tong, the pagoda was moved to the Yen Phu embankment area, built on the old foundation of the Han Nguyen Palace of the Tran Dynasty and the Thuy Hoa Palace of the Ly Dynasty. In 1639, Lord Trinh had two-sided corridors built and the three-entrance gate repaired. By the time of King Le Hy Tong, the pagoda was renamed once again to Tran Quoc Pagoda. The pagoda had bells cast, more statues added, and was magnificently renovated in the early Nguyen Dynasty. In 1821, King Minh Mang visited the pagoda and granted 20 taels of silver to expand and renovate the pagoda. In 1842, King Thieu Tri granted 200 quan money and 1 large gold coin and also renamed the pagoda to Tran Bac Pagoda. But the people from the past were still accustomed to calling the pagoda Tran Quoc, thanks to which this name has been kept until today. Through many ups and downs, Tran Quoc Pagoda continued to be preserved, maintained, and renovated by later generations to build a solemn beauty for this pagoda."
        ]
      },
      {
        "title": "Value and Meaning of Tran Quoc Pagoda",
        "content": [
          "According to historical records, during the French colonial period, the French School of the Far East had conducted in-depth research and highly appreciated this ancient pagoda. In particular, Tran Quoc Pagoda was also ranked among the 10 historical works of the entire Indochina. Through many historical fluctuations, the pagoda has been protected, renovated, preserving the architectural and cultural beauty. In 1962, Tran Quoc Pagoda was recognized by the Ministry of Culture - Information as a National Historical - Cultural Relic. For Vietnamese Buddhism, Tran Quoc Pagoda is truly a pride, a precious heritage possessing beauty in architecture, history and culture. To this day, this work is still one of the sacred Buddhist places, a famous spiritual destination of Hanoi, attracting many tourists and monks and Buddhists to perform rituals."
        ]
      },
      {
        "title": "Where is Tran Quoc Pagoda? How to get there",
        "content": [
          "Located on the eastern island of West Lake, Tran Quoc Pagoda is the most sacred ancient pagoda in Hanoi with an age of up to 1500 years. Tran Quoc Pagoda is located at 46 Thanh Nien Street, Yen Phu Ward, Tay Ho District, Hanoi.",
          "Only about 4km from the city center, you can easily travel to Tran Quoc Pagoda by personal vehicles such as motorbikes, cars or public vehicles such as taxis, grab, buses. If traveling by bus, you can choose route number 33 and route number 50, both have stops very close to the pagoda."
        ]
      },
      {
        "title": "Opening Hours and Entrance Fee to Tran Quoc Pagoda",
        "content": [
          "Tran Quoc Pagoda opens to welcome visitors to visit and worship from 8 AM - 4 PM daily. Specifically, on the 1st and Full Moon days of the lunar month, the pagoda opens from 6 AM - 6 PM and on Lunar New Year's Eve, the pagoda opens all night.",
          "Tran Quoc Pagoda does not charge entrance fees for both Hanoi residents and tourists. Therefore, you are free to visit, enjoy the scenery, and worship at the pagoda."
        ]
      },
      {
        "title": "Exploring the Architecture of Tran Quoc Pagoda",
        "content": [
          "The image of Tran Quoc Pagoda clearly shows Eastern decorative patterns and natural landscapes arranged according to the strict principles and sequence of Buddhism. Having undergone many renovations and repairs, Tran Quoc Pagoda currently has a total area of over 3000m2 including 3 main houses: the Incense Burning House, the Upper Palace, and the Front Hall connected to form the shape of the Chinese character 'Cong' (工).",
          "The Front Hall is built facing West, located in the middle of the pagoda's campus. On both sides are the Incense Burning House and the Upper Palace with two long corridors. Behind is a three-compartment house with stacked roofs, then the bell tower located on the main hall axis. On the left is the stele house preserving 14 stelae carrying many cultural and historical values, and on the right is the Ancestral House. In the 18th century during the reign of King Le Y Tong, many towers were added behind Tran Quoc Pagoda.",
          "In 1998, the Abbot of Tran Quoc Pagoda, Venerable Kim Cuong Tu, had the Lục Độ Đài Sen (Six Paramitas Lotus Tower) built, prominent in the ancient tower garden. The tower is placed symmetrically with the bodhi tree - a gift from Indian President Rajendra Prasad presented in 1959 when he visited the Capital. With these massive historical values and unique architecture, in 1989, Tran Quoc Pagoda was honored to be recognized as a National Historical and Cultural Relic."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "content": [
          "Visiting the ancient pagoda architecture",
          "Worshiping at the altars",
          "Visiting the ancient tower garden and the Lục Độ Đài Sen Tower",
          "Enjoying the scenery of West Lake"
        ]
      }
    ]
  },
  "QUAN THANH TEMPLE": {
    "name": "QUAN THANH TEMPLE",
    "map": "190 Quan Thanh Street, Quan Thanh Ward, Ba Dinh District, Hanoi",
    "type": "Historical Cultural Relic, Spiritual Destination",
    "introduction": "Quan Thanh Temple - a cultural and spiritual symbol of Hanoi. If you are a person who loves spiritual tourism, you definitely cannot miss the famous ancient temples and shrines in Hanoi such as Tran Quoc Pagoda, Bach Ma Temple, One Pillar Pagoda... Among them, a spiritual cultural symbol of the Imperial Capital that has entered the history books is Quan Thanh Temple.",
    "location": "190 Quan Thanh Street, Quan Thanh Ward, Ba Dinh District, Hanoi",
    "description": [
      {
        "title": "Information about Quan Thanh Temple",
        "content": [
          "Quan Thanh Temple is an unmissable Hanoi tourist coordinate. Historical relics such as Van Nien Pagoda, Tran Quoc Pagoda, Tay Ho Palace... and many temples in the West Lake area along with Quan Thanh Temple have contributed to creating a unique, harmonious architectural beauty for the Capital. Besides, they also contain many precious spiritual cultural values. Quan Thanh Temple is one of the Thang Long Four Guardian Temples including 4 temples: Quan Thanh Temple guarding the North, Kim Lien Temple guarding the South, Voi Phuc Temple guarding the West, Bach Ma Temple guarding the East.",
          "Where is Quan Thanh Temple? Quan Thanh Temple is located at the end of Thanh Nien Street, in Quan Thanh Ward, Ba Dinh District, Hanoi. Also known as Tran Vu Quan. With its ancient beauty and historical depth, Quan Thanh Temple is a prominent spiritual destination, attracting a large number of local people and tourists from everywhere to visit and worship."
        ]
      },
      {
        "title": "Who is worshiped at Quan Thanh Temple?",
        "content": [
          "Quan Thanh Temple is a place to worship Huyen Thien Tran Vu – one of the four sacred gods of Thang Long Four Guardian Temples, protecting the four directions of the ancient Thang Long capital. According to legend, Huyen Thien Tran Vu is the northern god, with the power to subdue demons and protect innocent people. He once helped subdue the turtle demon during the 14th Hung King period, defeated the nine-tailed fox in West Lake, assisted An Duong Vuong in suppressing the white chicken spirit to build Co Loa Citadel, and destroyed the fox spirit on the Red River during the reign of King Ly Thanh Tong. During the Le period, the temple was also a place where kings often came to pray for rain during droughts."
        ]
      },
      {
        "title": "History of Quan Thanh Temple",
        "content": [
          "According to records found on epigraphs and historical documents, Quan Thanh Temple was built in the early Ly Dynasty. The temple was renovated and restored many times in the years 1677, 1768, 1838, 1841, 1856, 1893.",
          "During the reign of King Le Hy Tong, Lord Trinh Tac assigned his son Trinh Can to recast the statue of Saint Tran Vu and Tran Vu Quan. At that time, craftsman Vu Cong Chan was the person directly in charge of casting the Huyen Thien Tran Vu statue at Quan Thanh Temple from black bronze to replace the previous wooden statue.",
          "In 1794, during the reign of King Canh Thinh, Tay Son Marshal Le Van Ngu had a large bronze bell cast to place right in the main hall. During an inspection tour of the Northern Citadel, King Minh Mang renamed the temple to Chan Vu Quan. The name 'Chan Vu Quan' was engraved in Chinese characters placed on the roof of the three-entrance gate. However, inside the Ceremonial Hall, there is still a plaque with the name Tran Vu Quan.",
          "King Thieu Tri visited Quan Thanh Temple and granted money to cast a gold ring to put on the statue of Saint Tran Vu in 1842.",
          "Today, Quan Thanh Temple is still known by two different names: Quan Thanh Temple and Tran Vu Quan. The word 'Quan' in the phrase 'Dao Quan' is a place of worship of Taoism.",
          "In early 1962, Quan Thanh Temple along with Tran Quoc Pagoda were honored to be recognized as national historical and cultural relics. In August 2024, Quan Thanh Temple was officially ranked as a Special National Monument."
        ]
      },
      {
        "title": "Architecture of Quan Thanh Temple",
        "content": [
          "The architecture of Quan Thanh Temple includes the three-entrance gate, front platform, middle platform, ceremonial courtyard, and back sanctuary, designed in the traditional Chinese architectural style.",
          "The temple gate is located on Thanh Nien Street with a design of four square pillars with phoenixes back-to-back and a kneeling unicorn on top. Around the pillars are carved images of fish transforming into dragons, fierce tigers descending the mountain, and pairs of red couplets that are very prominent.",
          "Behind the outer gate is the three-entrance gate with 2 floors and 3 doors. A special point is that in the middle gate of the three-entrance gate, there is a relief image of the god Rahu - an Indian god. This detail partly shows the integration of beliefs of the Vietnamese people since ancient times. Besides, on the main three-entrance gate tower, a bronze bell cast from the time of King Le Hy Tong in 1677 is placed. This is the bell sound that has entered Vietnamese folk songs and poetry 'The wind blows the bamboo branches swaying. The sound of Tran Vu bell, the crow of Tho Xuong chicken'.",
          "Passing through the three-entrance gate, you will reach the stele house with many epigraphs carved recording the renovation periods of the temple. Behind the stele house is the martyrs' temple built in the style of a square pavilion. Inside are the altar and photos of soldiers who sacrificed themselves in the war in the Quan Thanh Temple area.",
          "The ceremonial courtyard area is where offerings are arranged and displayed. In front of the ceremonial hall, there is a table to prepare offerings and two large incense burners. In the back sanctuary, there is a board introducing the bronze statue of Huyen Thien Tran Vu. On the porch of the ceremonial hall, carvings of fish transforming into dragons, tigers descending the mountain are sculpted. The statue of Huyen Thien Tran Vu is a unique artistic sculpture work of Vietnam. The work proves and affirms the skillful statue carving and bronze casting art of the Vietnamese people over 3 centuries ago.",
          "In the ceremonial hall, there is also a smaller black bronze statue. In Quan Thanh Temple, there is also a bronze sounding stone cast from the time of Lord Trinh. The images in the temple are all meticulously and exquisitely carved, bearing the strong imprint of Le Dynasty art."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Visiting Information",
        "content": [
          "Opening hours: Weekdays: 8 AM - 5 PM, 1st and 15th of the lunar month: 6 AM - 8 PM, Open overnight on New Year's Eve",
          "Ticket price: 10,000 VND/adult, 5,000 VND/student, elderly, disabled person, Free for children under 15 years old"
        ]
      },
      {
        "title": "Transportation",
        "content": [
          "Personal vehicles: From Hanoi city center follow the route: Trang Tien → Trang Thi → Cua Nam → Nguyen Thai Hoc → Thuy Khue → Thanh Nien Street",
          "Bus: routes 41, 50, E05, HNCITYTOUR, HNCITYTOURCT",
          "Taxi, ride-hailing services"
        ]
      },
      {
        "title": "Unmissable Experiences",
        "content": [
          "Four Guardian Temples ritual in the order East - West - South - North",
          "Asking for blessings at the Huyen Thien Tran Vu statue",
          "Participating in the special Quan Thanh Temple festival on the 3rd day of the 3rd lunar month",
          "Experiencing the night tour 'The Sound of Tran Vu Bell' (scheduled to launch in August 2025)",
          "Visiting famous spots near the temple: Ba Dinh Square, Kinh Thien Palace, Hang Dau Fort, One Pillar Pagoda"
        ]
      }
    ]
  },
  "Huong Pagoda": {
    "name": "HUONG PAGODA",
    "map": "Huong Son Commune, My Duc District, Hanoi",
    "type": "Spiritual Tourist Destination",
    "introduction": "Spiritual tourism is one of the types of tourism that attracts a large number of tourists in our country. Located in the North, there is a pagoda famous far and wide, all Buddhists wish to set foot in this pagoda at least once. That is Huong Pagoda, a sacred place amidst majestic mountains.",
    "location": "Huong Son Commune, My Duc District, Hanoi",
    "description": [
      {
        "title": "General Introduction to Huong Pagoda",
        "content": [
          "Huong Pagoda, also known as Huong Son Pagoda, is a complex of famous scenic spots located in Huong Son Commune, My Duc District, Hanoi. The Huong Pagoda complex has been given the title 'Uniquely occupying the Southern sky' by pilgrims from everywhere, being one of the most beautiful scenic spots in Vietnam. This place was once considered a symbol of Buddhist belief of Hanoi capital in particular and the Northern region in general.",
          "Built in the late 17th century, however, due to the impact of the resistance war against the French, the pagoda was almost completely destroyed, the current pagoda is partly restored and renovated under the guidance of the late Venerable Thich Thanh Chan in 1988."
        ]
      },
      {
        "title": "Architecture of Huong Pagoda",
        "content": [
          "Surrounded by the Yen stream valley, the entire Huong Pagoda complex includes the Outer Pagoda and the Inner Pagoda. The Outer Pagoda, also called Cho Pagoda, has the three-entrance gate built on a large courtyard and the bell tower built in the third courtyard.",
          "If the Outer Pagoda was remodeled by human hands, the Inner Pagoda located in Huong Tich Cave is a marvelous work of creation with ancient, majestic, and heart-stirringly beautiful caves. The path to visit Huong Tich Cave requires tourists to go through precarious stone steps, folk belief holds that one must go through suffering to reach enlightenment. Therefore, this place has never been hindered by the difficulty of the terrain from preventing the footsteps of devotees coming here on pilgrimage.",
          "Huong Tich Cave in the past was also a place where kings often visited to enjoy the scenery. In 1770, Tinh Do Vuong Trinh Sam left here 5 Chinese characters 'Nam thien de nhat dong' (First cave of the Southern sky), since then this title has been passed down to this day."
        ]
      },
      {
        "title": "Huong Pagoda Festival",
        "content": [
          "Huong Pagoda usually attracts a large number of pilgrims in the spring, peaking in the 2nd and 3rd lunar months because at this time the scenery and weather are the most beautiful for tourists to enjoy the scenery.",
          "The Huong Pagoda festival opens on the 6th day of the first lunar month every year and ends in the last ten days of the 3rd lunar month. The festival takes place with many special artistic activities such as cheo singing, van singing, and there are also sports competitions like mountain climbing, boat racing,... In the past, people held the Huong Pagoda festival with the meaning of opening the mountain, opening the forest. Today, the Huong Pagoda festival also carries the meaning of opening the pagoda, opening the temple for people to come here to pray for wealth, luck, and peace for their families."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "content": [
          "Visiting the Huong Pagoda complex",
          "Exploring Huong Tich Cave",
          "Participating in the Huong Pagoda festival",
          "Mountain climbing, boat racing"
        ]
      }
    ]
  },
  "ELEPHANT PHUC TEMPLE": {
    "name": "ELEPHANT PHUC TEMPLE",
    "map": "362 Kim Ma, Ngoc Khanh Ward, Ba Dinh District, Hanoi",
    "type": "Historical Relic, Spiritual Destination",
    "introduction": "Voi Phuc Temple - one of the famous 'four guardians' of ancient Thang Long, is an unmissable destination when exploring Hanoi. This is not only a place to worship the majestic god Linh Lang but also preserves many unique historical and cultural values.",
    "location": "362 Kim Ma, Ngoc Khanh Ward, Ba Dinh District, Hanoi",
    "description": [
      {
        "title": "History and Spiritual Meaning of Voi Phuc Temple",
        "content": [
          "Voi Phuc Temple is one of the temples in the Thang Long Four Guardian Temples of ancient Thang Long citadel. The temple is located at 362 Kim Ma, Ngoc Khanh Ward, Ba Dinh District, Hanoi and is located near the entertainment area of Thu Le Park. This location is also near the University of Transport and Communications and the Le Duan Party School.",
          "Voi Phuc Temple is one of the 'Thang Long Four Guardian Temples,' built during the reign of King Ly Thai Tong (1028–1054). This is a famous historical relic of Hanoi, worshiping the god Linh Lang – a prince who sacrificed in the resistance war against the Song invaders. After sacrificing in 1076 at the Cai River defense line, he was conferred as the Great King, Upper Grade Blessed Spirit to honor his great contributions.",
          "Voi Phuc Temple worships the god Linh Lang.",
          "The temple is located in the west of Thang Long capital, in the area of ancient Thu Le village, now Ngoc Khanh Ward, Ba Dinh District, Hanoi. Because of this special position, the temple is also called 'Tran Doai' or 'Tran Tay,' corresponding to the Western direction in the eight trigrams in feng shui. This is also one of the distinctive features that make Voi Phuc Temple a prominent destination among spiritual places in Hanoi.",
          "As a long-standing cultural landmark in Hanoi, Voi Phuc Temple not only attracts pilgrims from everywhere to worship but also is a place to explore special historical and belief values. Don't forget to add this destination to your itinerary to better understand the culture and traditions of the Capital!"
        ]
      },
      {
        "title": "Architecture of Voi Phuc Temple",
        "content": [
          "Voi Phuc Temple is not only famous for its historical value but also attracts attention thanks to its unique architecture imbued with Vietnamese culture. The special highlight is the two kneeling elephant statues in front of the temple gate – an image symbolizing solemnity and respect for the god Linh Lang. From there, the temple has the name 'Voi Phuc' (Kneeling Elephants), both showing feng shui meaning and highlighting the characteristics of the relic.",
          "Voi Phuc Temple is built in the shape of the Chinese character 'Cong' with three ways up to the courtyard, of which the middle way has 12 wide stone steps for palanquin procession ceremonies. The temple includes main items such as: Three-entrance gate, Campus and brick courtyard, Main hall, Back sanctuary.",
          "The harmonious combination between architecture and the prime location in the west of Thang Long helps Voi Phuc Temple become an irreplaceable cultural – belief symbol in the hearts of Hanoi people. This is not only a place to pray for peace and worship but also an ideal destination for those who want to explore traditional cultural beauty."
        ]
      },
      {
        "title": "Voi Phuc Temple Festival",
        "content": [
          "However, if you want to participate in the festival at the temple, you should come to the temple on the 9th - 11th of the 2nd lunar month.",
          "On these days, the temple has many activities such as lion dance, dragon dance, ceremonial offerings, palanquin processions, chess playing, incense burning, cockfighting, cultural performances,... The specific schedule is as follows: The 9th: This is the day of reporting ceremony to report and invite the saint to attend the festival. The 10th: the day when all the central rituals of the festival such as ceremonies, palanquin processions are performed most splendidly. The 11th: The day of total Ha Hao Nam procession carrying the royal palanquin up to Voi Phuc Temple for closing ceremony. The 12th: People carry the royal palanquin up to Total Thuong Thuy Chuong. The 13th: Carry the royal palanquin of total Ha Hao Nam for closing ceremony."
        ]
      },
      {
        "title": "Visiting Information",
        "content": [
          "The opening time to enter Voi Phuc Temple starts from 8:00 AM to 5:00 PM every week. Especially, on New Year's Eve, the temple opens until the end of the night.",
          "According to known information, currently when entering Voi Phuc Temple you will not have to pay an entrance fee. However, if you want to buy offerings, you will have to pay a fee for this."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "How to Get There",
        "content": [
          "For personal vehicles: You can travel by following the map directions. You can use Google Map so you don't get lost.",
          "For buses: You choose bus routes such as 16, 27, 32, 49, 34.",
          "For taxis, ride-hailing services: With this form of travel, you just need to contact the service providers. Then provide them with information about your destination and departure time. Upon receiving the information, you will be picked up and dropped off right at Voi Phuc Temple, very convenient and safe."
        ]
      }
    ]
  },
  "KIM LIEN TEMPLE": {
    "name": "KIM LIEN TEMPLE",
    "map": "Phuong Lien Ward, Dong Da District, Hanoi",
    "type": "Historical Relic, Spiritual Destination",
    "introduction": "Kim Lien Communal House is known as one of the 'Thang Long Four Guardian Temples' - meaning the 4 sacred temples worshiping 4 gods guarding the east, west, south, north of the ancient Thang Long capital. This is also an extremely meaningful destination on the Hanoi tourist map that any tourist wants to visit once.",
    "location": "Phuong Lien Ward, Dong Da District, Hanoi",
    "description": [
      {
        "title": "Introduction to Kim Lien Communal House",
        "content": [
          "Kim Lien Communal House, Kim Lien Temple or Cao Son Temple is the southern guardian in the 'Thang Long four guardians'. The communal house formerly belonged to Dong Tac ward, Tho Xuong district, Hoai Duc prefecture, now is Phuong Lien ward, Dong Da district, Hanoi.",
          "The temple opens to welcome guests all week, from 8 AM to 6 PM and always free of entrance fee."
        ]
      },
      {
        "title": "Legend of Kim Lien Temple Hanoi",
        "content": [
          "Kim Lien Temple is also called Cao Son Temple because inside the temple worships Cao Son Dai Vuong. Legend has it that in the 16th century, when King Le Tuong Duc was leading troops to suppress rebellions to restore the Le dynasty's legacy, he passed through the territory of Phung Hoa district. Seeing the dense mountainous landscape, and an ancient temple engraved with 4 words 'Cao Son dai vuong', the king prayed for the god's support. Indeed, after 10 days he successfully suppressed the rebellion. After that, King Le Tuong Duc immediately had a temple built to worship the god Cao Son in Phung Hoa.",
          "In 1509, the king had the temple rebuilt more spaciously and beautifully in Kim Hoa ward, now Kim Lien. Later, Kim Lien villagers built an additional three-entrance gate in front of the temple gate and some new architectures, forming Kim Lien Communal House as we still see today.",
          "Currently, besides the god Cao Son, Kim Lien Communal House also worships the Mother Goddess, Tam Phu and President Ho Chi Minh."
        ]
      },
      {
        "title": "Unique Architecture",
        "content": [
          "The Thang Long Four Guardians in the past were 4 extremely sacred temples: Bach Ma Temple guarding the East, Voi Phuc Temple guarding the West, Kim Lien Temple guarding the South and Quan Thanh Temple guarding the North.",
          "Kim Lien Communal House is built on a high mound of land near Kim Lien pond. The communal house gate and main door both face West. The architecture of the communal house consists of 2 main parts: the part in front of the mound has a pillar gate and two rows of solution houses on both sides of the brick courtyard, the main architecture is the entire communal house construction on the high mound. Passing through the wide courtyard are 9 high brick steps built with large-sized bricks from the Restored Le period.",
          "The main communal house includes 3 parts: the Ceremonial Gate, the Ceremonial Hall and the Sanctuary. The Ceremonial Gate is a 3-compartment house built in the style of sealed gable walls, the architecture and decorative patterns are vividly and meticulously expressed in the Nguyen Dynasty artistic style. The Ceremonial Hall has 5 compartments renovated with traditional architectural style. The Sanctuary is a 3-compartment house, the last compartment is the place to worship Cao Son Dai Vuong, the daughter of King Le and Princess Huet Minh.",
          "The most important ancient artifact at Kim Lien Communal House is the stone stele 'Cao Son Dai Vuong than tu bi minh' talking about the merits of the god Cao Son, composed by the historian Le Tung in 1510. Besides, there are an additional 39 ordination conferments for the god Cao Son."
        ]
      },
      {
        "title": "Kim Lien Communal House Festival",
        "content": [
          "Kim Lien Communal House Festival is held from the 15th-16th of the 3rd lunar month every year and the 16th is the main festival day. Besides the main ceremony, there are also monthly ceremonies on the 1st and full moon days, the Ky An ceremony and the anniversary of the god's death on the 12th day of the 8th lunar month every year.",
          "On the morning of the 15th, a hair cutting contest takes place, the atmosphere is bustling and exciting throughout Kim Lien village. This village is also famous for barbers who can cut hair and perform skillful scissor dances like artists. After the contest are folk games like breaking pots, stick pushing... in the evening, singing and dancing parties are held, extremely lively.",
          "The main festival day is the 16th of the 3rd lunar month. Early in the morning, the villagers will perform the Ceremony at the main hall, read the Kim Lien Communal House prayer, then the incense offering ceremony respectfully in front of the communal house courtyard, then the clans offer elaborate and beautiful trays of offerings. Finally is the procession ceremony with 4 solemn palanquins: the royal palanquin, the male palanquin, the female palanquin and the hammock palanquin. People walk in long lines from Kim Hoa street to Dao Duy Anh street then return to Kim Lien Communal House, creating an extremely magnificent image.",
          "During the festival, people also organize many traditional games such as bird fighting, human chess, martial arts, catching ducks in the pond..."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Notes When Visiting",
        "content": [
          "Pay attention to the incense sticking place. Only stick incense into the incense bowl, do not stick arbitrarily on the statue's hand, tree roots or offerings.",
          "Arrange money neatly into the donation box, do not scatter in many places.",
          "Do not step on the door sill, do not enter from the middle door but should enter from the two side doors.",
          "Do not make noise, do not point around indiscriminately, do not speak disrespectful words, do not walk in front of someone who is kneeling and bowing.",
          "Do not bring offerings from the communal house to place on your home altar."
        ]
      }
    ]
  },
  "Bach Ma Temple": {
    "name": "Bach Ma Temple",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.9224790971684!2d105.84843347515333!3d21.035787587537406!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abbf47ca8df5%3A0xe66fe1153b046b!2zxJDhu4FuIELhuqFjaCBNw6M!5e0!3m2!1svi!2s!4v1760759065242!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "Bach Ma Temple is one of the famous historical relics in Hanoi. Like Quan Thanh Temple, Bach Ma Temple is also in the Thang Long Four Guardian Temples complex. This is a sacred temple, carrying within itself the history and distinctive culture of the nation.",
    "location": "76 Hang Buom Street, Hoan Kiem District, Hanoi",
    "description": [
      {
        "title": "General Information",
        "content": [
          "Bach Ma Temple is one of the 'Four Guardians' of the ancient Thang Long capital. The temple's location is in Tho Xuong district, Hoai Duc prefecture, now at 76 Hang Buom Street, Hoan Kiem District, Hanoi City.",
          "From Hanoi city center, you can get to Bach Ma Temple by means of: Car or motorbike, Bus: take bus routes number 18, 32, 34 to get to the Tran Nhat Duat bus stop."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20105016.png"
      },
      {
        "title": "Who is worshiped at Bach Ma Temple? History of Bach Ma Temple Hanoi",
        "content": [
          "Bach Ma Temple was built in the 9th century to worship and honor the god Long Do. In the 10th century, while fighting enemies and suppressing rebellions, Dinh Bo Linh came to Bach Ma Temple east of Dai La citadel to pray and promised to confer the god if his wish was granted.",
          "After defeating the enemy and unifying the country, Dinh Tien Hoang - the first king of the Dinh dynasty, dreamed of a god calling himself the White Horse God reminding him that he had not organized the proper rituals to honor the god. Upon waking up, the king immediately conferred the White Horse God temple the name Ho Quoc Bao Canh Linh Thong The The, Do Dai Thanh Hoang Linh Lang Bach Ma Dai Vuong Thuong Dang Phuc Thanh and had an additional temple built for the God Linh Lang Bach Ma in the hometown of Queen Duong Thi Nguyet.",
          "During the Nguyen Dynasty, King Dong Khanh conferred the title Ham Quang Thuong Dang Than for the god Bach Ma.",
          "In 1010, when King Ly Thai To moved the capital from Hoa Lu to Thang Long, the citadel was built many times but still collapsed until the king prayed at the temple of the god Long Do and was guided by a white horse coming out from the temple. The king followed the horse's footprints and built the new Thang Long citadel. At this time, the god was conferred as the Capital's tutelary god.",
          "Up to now, the temple has been repaired many times, of which the two largest renovations were in the Chinh Hoa era of King Le Hy Tong and the 20th year of Minh Menh. Bach Ma Temple today is a famous tourist spot in the sacred land with a solemn landscape."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20105044.png"
      },
      {
        "title": "Exploring the Architecture of Bach Ma Temple",
        "content": [
          "Just setting foot at Bach Ma Temple, visitors will immediately be attracted by the prominent yellow wall background and the red wooden door carved with golden dragon patterns, creating an ancient, solemn beauty for the temple.",
          "The distinctive architectural feature inside the temple is the entire wooden house frame with a system of large ironwood columns, the roof support system is crafted in the 'gia chieng chong ruong con nhi' style with meticulous and firm carvings.",
          "The Ceremonial Hall of Bach Ma Temple places the altar, impressing with the image of gilded dragons and phoenixes carved extremely delicately. The details of dragon heads, parallel sentences, and couplets are not only shiny gilded and beautiful but also very subtle and lively."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20105120.png"
      },
      {
        "content": [
          "The interior of this temple includes the square pavilion inside, on the left is the incense burner, altar, Te Vuong Phi shrine, and on the right worships Be Nui. At the Incense Burning Hall and the Sanctuary, there are altars and ceremonial objects, all arranged neatly and solemnly.",
          "Besides, here also preserves many valuable artifacts carrying great historical value, including ordinations, a pair of phoenixes, bronze bell, palanquin, vase, 15 epigraphs with典故, myths telling about the temple construction, worship rituals along with renovations over more than 1000 years."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20105407.png"
      },
      {
        "title": "Bach Ma Temple Festival",
        "content": [
          "The Bach Ma Temple festival lasts for two days, from the 12th to 13th of the second lunar month every year to commemorate the merits of the god Long Do. On the first day, the procession team moves from Ma May Temple to Bach Ma Temple with full teams such as dragon dance team, male ceremonial team, female ceremonial team and buffalo model to perform the Tien Xuan Ngu ceremony. The festival opens with the reporting ceremony and then the Saint ceremony.",
          "On the second day, the male ceremonial teams and female incense offering teams of neighboring villages come to worship the Saint, ending with the closing ceremony of the male ceremonial team of Bach Ma Temple. Besides, the festival also organizes many entertainment programs and special ethnic art performances."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20105428.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20104926.png",
    "activities": [
      {
        "title": "Nearby Visiting Places",
        "content": [
          "Ba Kieu Temple 1.6 km away",
          "National Museum of History 1.7 km away",
          "Hoan Kiem Lake 2.3 km away",
          "Hang Dau Fort 2.6 km away",
          "Vincom Mega Mall Times City about 6 km away"
        ]
      }
    ]
  },
  "LANG PAGODA": {
    "name": "LANG PAGODA",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.266565106311!2d105.80650807515302!3d21.022017488010306!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab02b1d6a17b%3A0x106cfbbf587d062!2zQ2jDuWEgbMOhbmc!5e0!3m2!1svi!2s!4v1760760010559!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "Lang Pagoda is a famous spiritual tourist destination in Hanoi. Thang Long - Hanoi has long been known as the political and religious center of the country. Through thousands of years of history, this place has preserved many ancient temples and pagodas, playing an important role in the spiritual life of the people. Among them, we cannot fail to mention the pagoda named The First Tung Lam - Lang Pagoda.",
    "location": "116 Chua Lang Street, Lang Thuong Ward, Dong Da District, Hanoi",
    "description": [
      {
        "title": "General Information",
        "content": [
          "Lang Pagoda is also known by another name as Chieu Thien Tu. This Hanoi pagoda is about 5km from the city center.",
          "Opening hours: 8:30 AM - 8:00 PM every day. On special days such as full moon, first day of the lunar month, and holidays, Tet, the opening time will be extended longer than usual.",
          "Lang Pagoda is right near the Capital center so traveling there is very convenient. You can choose means such as car, motorbike, bus or taxi to get to the pagoda. If using the bus, there will be routes number 09 BCT, 55A, 55B, 26, 28 that have stops near Lang Pagoda."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110153.png"
      },
      {
        "title": "Who is worshiped at Lang Pagoda? History of Lang Pagoda Dong Da Hanoi",
        "content": [
          "According to legend, Lang Pagoda started construction during the reign of King Ly Anh Tong (reigned from 1138 - 1175), worshiping Zen master Tu Dao Hanh. According to folklore, this Zen master was reincarnated as the son of the nobleman Sung Hien Hau (younger brother of King Ly Nhan Tong), then succeeded to the throne as King Ly Than Tong (reigned from 1128 - 1138) when the king had no children.",
          "Because of that story, Ly Anh Tong, son of Ly Than Tong, had Lang Pagoda built to worship his father and his predecessor, Zen master Tu Dao Hanh. The pagoda has undergone many repairs, of which the most important times were in the years 1656, 1901 and 1989."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110226.png"
      },
      {
        "title": "Exploring the Architecture of Lang Pagoda",
        "content": [
          "According to recorded documents, Lang Pagoda previously had a total of 100 compartments, built in the style of 'inner công ngoại quốc' architecture. This architectural style has been popular in Vietnam since ancient times, with the characteristic of having two long corridors connecting the front hall and the back hall forming a closed rectangular frame, in the middle can be the incense burning hall or the upper hall."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110253.png"
      },
      {
        "content": [
          "Currently, Lang Pagoda still maintains its majesty and grandeur with a harmonious and balanced complex of works with the surrounding space. The subtle combination of pagoda architecture with nature, gardens and ancient trees creates a peaceful and quiet space. Lang Pagoda was once dubbed 'The First Tung Lam', meaning the place with the most beautiful pine forest in the West area of Thang Long capital."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110344.png"
      },
      {
        "content": [
          "When visiting the pagoda, visitors will first see the three-entrance gate. The three-entrance gate of the pagoda has four square pillars, above are 3 arched roofs attached to the pillar frame, not covering the top. This architectural style has similarities with the gate inside the palace of kings' mansions."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110418.png"
      },
      {
        "content": [
          "The Octagonal House is built with a stacked roof of 2 floors, 16 roofs, on the top are embossed 8 dragon statues symbolizing the 8 generations of Ly kings. Then come the main works of the pagoda such as the Ceremonial Hall, the Upper Palace, the incense burning hall, the Ancestral House and the Monks' Quarters."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110447.png"
      },
      {
        "content": [
          "In addition, Lang Pagoda is also famous far and wide for possessing 198 large and small valuable statues, of which the statue of King Ly Than Tong sitting on the throne and the statue of Zen Master Tu Dao Hanh are the most impressive. Besides, the pagoda also preserves many other valuable artifacts such as 31 couplets, 39 horizontal lacquered boards, 15 stone steles…"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110517.png"
      },
      {
        "title": "Lang Pagoda Festival Hanoi",
        "content": [
          "Every year, on the 7th day of the 3rd lunar month, people in Lang Thuong ward organize the Lang Pagoda festival with solemn rituals. This is also the birthday of Zen Master Tu Dao Hanh. The festival includes many interesting activities, but especially the part of carrying the Saint's palanquin from Lang Pagoda to Hoa Lang Pagoda to visit his mother. At the festival, people also reenact the divine battle between Zen Master Tu Dao Hanh and monk Dai Dien.",
          "Not only are there solemn rituals, the festival also has many special folk games such as 'blindfolded pot breaking', 'cooking rice competition'… bringing joy, building solidarity for the villagers as well as attending tourists."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110548.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110124.png",
    "activities": [
      {
        "title": "Cuisine around Lang Pagoda",
        "content": [
          "Boiled snails at Lang Pagoda: The characteristic dish of Lang Pagoda that you definitely cannot miss is boiled snails. By boiling snails with lemon leaves, lemongrass, chili, it creates a characteristic, irresistible attractive aroma.",
          "Grilled meat skewers: The grilled meat skewers at Lang Pagoda are considered a dish 'loved by thousands', of which Hoang Duc is the most famous meat skewer shop here."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110618.png"
      },
      {
        "content": [
          "Vietnamese pancake: The pancake shops at Lang Pagoda are especially loved by young people and frequently visited.",
          "Sour rib noodles: The faint, light aroma of noodles combined with soft, sweet ribs and rich broth.",
          "Seafood noodles: Unlike seafood noodle soup, seafood noodles will bring you a new and unique culinary experience."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110658.png"
      },
      {
        "title": "Cuisine around Lang Pagoda",
        "content": [
          "Seafood noodles: Unlike seafood noodle soup, seafood noodles will bring you a new and unique culinary experience."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20110720.png"
      }
    ]
  },
  "BA TRIEU TEMPLE": {
    "name": "BA TRIEU TEMPLE",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3750.848591351744!2d105.81620277512798!3d19.930784224582965!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x31365f1af3bfa26d%3A0xaaf9ce54e1ee9e6d!2zxJDhu4FuIELDoCBUcmnhu4d1!5e0!3m2!1svi!2s!4v1760760725224!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "Ba Trieu Temple is a famous historical relic, close to many Thanh Hoa tourist spots. The sacred temple over time has been tinged with the moss of time, ancient, however, this is still an ideal stop for worship, sightseeing and exploring unique architecture.",
    "location": "on Gai mountain, in the territory of Phu Dien village, Hau Loc district, Thanh Hoa",
    "description": [
      {
        "title": "General Information",
        "content": [
          "Ba Trieu Temple, or also known by another name as the temple of Ba Trieu Thi Trinh – one of the heroic generals with great merits in driving away Chinese invaders who came to invade our country's territory in the 3rd century (BC).",
          "The temple is built in the architecture of the North Central region, both solemn, ancient but also very subtle. Currently, this place also preserves many artifacts, treasuries of stories, folk songs, legends and even rare artifacts.",
          "Reference visiting ticket price: Free"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111413.png"
      },
      {
        "title": "History of Ba Trieu Temple Thanh Hoa",
        "content": [
          "Ba Trieu Temple was built by King Ly Nam De in the 6th century. The work is a place to commemorate Ba Trieu Thi Trinh - a heroic female general who contributed in the uprising of 248 against the invading Wu army.",
          "During the reign of King Minh Mang (18th century), this work was moved to the current location and kept until now. Over time, the work has also been tinged with the moss of time, ancient, however, the locality also has annual renovation projects to meet the visiting needs of tourists inside and outside the province."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111438.png"
      },
      {
        "title": "Architecture of Ba Trieu Temple Hau Loc",
        "content": [
          "The historical relic of Ba Trieu Temple has unique architecture, each area has its own design style, collectively forming a large-scale work, imbued with the traditional cultural features of the North Central region. Specifically:",
          "Outer Ceremonial Gate: This area is built of monolithic stone with a unique four-pillar style. The top of the column has phoenix leaves, the lantern detail is carved with four sacred animals, the two side walls are carved in relief with elephants worshiping."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111504.png"
      },
      {
        "content": [
          "Lake: The length and width of the lake are 29.8m and 42.2m respectively. The lake is located opposite the Inner Ceremonial Gate, with steps up and down for convenient visiting.",
          "Screen wall: This detail is made of monolithic stone, placed in front of the Middle Ceremonial Gate.",
          "Middle Ceremonial Gate: Built in the four-pillar architecture, similar to the architecture of the outer ceremonial gate.",
          "Lower courtyard: Located in the front part of the inner ceremonial gate, the length and width are 49.8m and 12m respectively."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111526.png"
      },
      {
        "title": "Architecture of Ba Trieu Temple Hau Loc",
        "content": [
          "Inner Ceremonial Gate: Designed similarly to the Tam Quan area, on both sides of the main door are placed two ancient stone kneeling unicorn statues.",
          "Left/Right houses: Located in the front courtyard of the Front Hall, each house is built with 5 compartments, the frame is made of ironwood, the floor is paved with ancient bat bricks.",
          "Front Hall: Structure of 3 compartments 2 wings, every detail inside the house, the roof is delicately carved, beautifully decorated."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111550.png"
      },
      {
        "title": "Architecture of Ba Trieu Temple Hau Loc",
        "content": [
          "Middle Hall: Built in the wooden architecture of 5 compartments 2 floors and has a curved roof, separated from the Front Hall area by the upper courtyard. The work is decorated with leaves, transformed dragons, cloud-veined stone...",
          "Back Sanctuary: Architecture of 3 compartments 2 wings, length 2.45m and width 6.9m. The frame system in the back sanctuary is also decorated with many elaborate and beautiful relief carvings."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111611.png"
      },
      {
        "title": "Ba Trieu Temple Festival",
        "content": [
          "Not only a spiritual tourism and worship destination, Ba Trieu Temple is also a place to organize many famous Thanh Hoa festivals. Specifically, the festivals are usually held around from the 21st – 24th of the 2nd lunar month every year, containing many traditional cultural activities of the Vietnamese people.",
          "During the festival events, visitors and people can participate in many activities such as: palanquin procession, ceremonies, female ceremonies... or folk games such as: cooking rice, wrestling, chess playing..."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111634.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111340.png",
    "activities": [
      {
        "title": "Tourist spots near Ba Trieu Temple",
        "content": [
          "Ba Trieu Tomb Area: Located on the top of Tung mountain, in the territory, the territory of Trieu Loc commune, Hau Loc district, Thanh Hoa",
          "Ba Trieu Tomb area was built including Ba Trieu Tomb, the grave and the princess tower. The tomb part is made from monolithic blue stone, inside places an incense bowl. This is a place for visitors to burn incense to show respect, both to visit and enjoy the scenery on the top of Tung mountain."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111705.png"
      },
      {
        "content": [
          "Ham Rong Mountain: Territory of Duong Xa village, belonging to Thieu Duong commune, Thieu Hoa district, Thanh Hoa",
          "The beauty of Ham Rong Mountain is mentioned a lot in poetic works, therefore this is also one of the famous scenic spots that you should connect the itinerary with Ba Trieu Temple. Not only possessing nature as beautiful as a painting, this is also evidence of the glory and feats in the nation's history"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111754.png"
      },
      {
        "content": [
          "Hai Tien Beach: Belonging to the territory of Hoang Hoa district, Thanh Hoa province",
          "Hai Tien beach is a still very wild coastal area, so the space here is green, cool, peaceful, very suitable for rest and relaxation. This is also a place near Ba Trieu Temple, visitors coming here can enjoy many fresh seafood dishes at extremely cheap prices. Currently, tourism services in this beach area are also focused on development, meeting the needs of visitors."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111340.png"
      },
      {
        "content": [
          "Sam Son Beach: Belonging to the territory of Sam Son city, Thanh Hoa province",
          "When it comes to Thanh Hoa beaches, we cannot fail to mention the famous Sam Son beach, this address is 32.4km from Ba Trieu Temple, so visitors will take about 41 minutes to travel. As a bustling beach tourist spot, you will have fun with many attractive activities such as: swimming, playing, enjoying seafood…"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111832.png"
      },
      {
        "content": [
          "Ba Trieu Temple to date is over 2000 years old, time may erode the work but the historical and cultural values are still passed down to this day. Therefore, if you have the opportunity to visit the land of Thanh, visitors can schedule to come to the temple on the majestic Gai mountain, listen to many historical stories and learn about the unique construction architecture of the North Central region in the old days. Hopefully the above shares will help you easily plan your upcoming trip!"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20111903.png"
      }
    ]
  },
  "DUONG LAM ANCIENT VILLAGE": {
    "name": "DUONG LAM ANCIENT VILLAGE",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3720.8750524654074!2d105.46998037515618!3d21.157370183349006!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3134f5651ec5a1fb%3A0xbf4c62a0fffd9d50!2zTMOgbmcgY-G7lSDEkMaw4budbmcgTMOibQ!5e0!3m2!1svi!2s!4v1760879346030!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Duong Lam Ancient Village - the ancient village of Hanoi. Coming to Hanoi tourism, visiting architectural works, exploring unique culture, then Duong Lam ancient village is the place you must definitely visit.",
    "location": "Duong Lam Commune, Son Tay, Hanoi",
    "description": [
      {
        "title": "General Information",
        "content": [
          "Duong Lam ancient village belongs to Son Tay town, only about 44km from Hanoi capital center. This ancient village in Hanoi is located south of the Red River, right next to the intersection between the Ho Chi Minh trail and national highway 32.",
          "Not too far from the Capital, traveling to Duong Lam ancient village is also very convenient and easy."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201131.png"
      },
      {
        "title": "Transportation",
        "content": [
          "Bus: is the safest and most economical way to get to Duong Lam. From Hanoi you can choose one of the bus routes to Duong Lam ancient village such as bus number 71 (My Dinh - Son Tay bus station), bus number 73 (My Dinh - Thay Pagoda), bus number 89 (Yen Nghia bus station - Son Tay bus station)... The fare is very reasonable, only from 9,000 - 20,000 VND/trip.",
          "Personal motorbikes, cars: this is a suitable choice for those who like to be proactive. The road to the ancient village is also quite easy and convenient.",
          "Coach: this is also one of the means of transportation chosen by many tourists. Departing from Hanoi, you can take the My Dinh - Phu Tho route to get to Duong Lam ancient village."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201210.png"
      },
      {
        "title": "Prominent Visiting Points",
        "content": [
          "Mong Phu Village Gate: This place was built in 1833 with arched architecture and a layer of laterite, imbued with the cultural architecture of the Le Dynasty. Next to the gate, there is also a over 300-year-old banyan tree shading for people to rest, this scene creates a truly peaceful, ancient landscape and imbued with the soul of the countryside.",
          "Duong Lam Ancient Village Communal House: Built since 1684, imbued with Vietnamese - Muong architecture with stilt houses and wooden floors above the ground. This place includes the Ceremonial Gate, the communal house courtyard, two Ta Mac and Huu Mac buildings on both sides, in the middle is the Dai Dinh building. Stepping inside, you will admire many ancient parallel sentences and couplets that are hundreds of years old."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201254.png"
      },
      {
        "content": [
          "Duong Lam Ancient Well: Traveling to Duong Lam ancient village, you can come across many ancient wells. The water here is very clear and is also where people get daily living water. After hundreds of years, the ancient wells in Duong Lam village are still intact and extremely solid."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201321.png"
      },
      {
        "content": [
          "Giang Van Minh Temple: This place was built during the time of King Tu Duc, is a place to worship and remember the merits of Tham Hoa Giang Van Minh. Ancient House of Mrs. Dien: The house is 200 years old, deeply imprinted with the mark of time through the clinging moss, broken tiles, faded colors or even the house decoration style also bears strong ancient features. Ancient House of Mr. Hung: This place is nearly 400 years old and has gone through 12 generations living."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201358.png"
      },
      {
        "content": [
          "Tomb and Temple of Ngo Quyen: The complex of temple and tomb of Ngo Quyen is built on Cam hill, although small in area, the campus is meticulously cared for."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201432.png"
      },
      {
        "title": "Cuisine",
        "content": [
          "Mia Chicken: a type of chicken with small legs, yellow feathers, when boiled the meat is white, the skin is yellow and crispy. In the past, this was a precious dish only used to offer to the king or used during village festivals. When traveling to Duong Lam ancient village, don't forget to enjoy this specialty dish.",
          "Roasted Pork on a Pole: famous not only for its distinct flavor but also for its extremely unique and elaborate processing method. The highlight of this delicious dish is the non-guava leaves that are minced and marinated with the meat. Enjoying a piece of meat that is crispy on the outside, sweet and tender on the inside, fatty and fragrant with guava aroma is really wonderful, isn't it?",
          "Green Bean Sweet Paste: made from steamed green beans, then added sugar, using a large chopstick to stir evenly until the beans are crushed, smooth and glossy. The sweet paste will be more delicious when eaten cold, eating small pieces slowly, while sipping a bit of green tea, you will feel a gentle sweet fragrance spreading very pleasantly.",
          "Rice Soy Sauce: is a rustic, popular dish made from rice, soybeans, salt, water taken from the village well... Soy sauce is used to dip vegetables, dip fried tofu, braised fish, braised meat... giving an irresistible aroma and flavor.",
          "Sesame, Peanut Candy: a type of candy made from rustic ingredients such as: peanuts, sesame, sugar, malt... Sitting and enjoying a few pieces of candy with a cup of slightly bitter green tea is truly delicious.",
          "Steamed Rice Cake: steamed rice cake is available everywhere but in Duong Lam it has many differences compared to other regions. Here, the cake is wrapped with dong leaves, long and slender, the filling is evenly spread along the leaf spine. When eaten, the cake has a very characteristic taste, chewy and fragrant."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201512.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201050.png",
    "activities": [
      {
        "title": "Visiting Information",
        "content": [
          "The entrance fee to Duong Lam ancient village is 20,000 VND/adult, 20,000 VND/child over 14 years old, free for children under 14 years old. If you want to save time, you can buy online tickets in advance at home and when you come to the ancient village, you just need to present the QR code to the ticket checker to enter the gate without having to wait to buy tickets. If you forget to book tickets or don't want to buy online tickets, you can also choose to buy tickets at the gate.",
          "Best time to go: you can come to visit Duong Lam ancient village at any time of the year. However, the festival season and the ripe rice season are the most ideal, beautiful and interesting times."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20203404.png"
      }
    ]
  },
  "BAT TRANG POTTERY VILLAGE": {
    "name": "BAT TRANG POTTERY VILLAGE",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3725.3803854423363!2d105.90875208046155!3d20.977383939692846!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135afa57ac82a29%3A0xbb2f62a917c8830!2zTMOgbmcgZ-G7kW0gQsOhdCBUcsOgbmc!5e0!3m2!1svi!2s!4v1760880622202!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Bat Trang Pottery Village was formed from the Ly Dynasty, located on the left bank of the Red River. After nearly 1000 years of existence and development, Bat Trang Pottery Village today has become a professional-scale ceramic production center, with many large companies established alongside small household production units.",
    "location": "Bat Trang Commune, Gia Lam District, Hanoi",
    "description": [
      {
        "title": "General Introduction",
        "content": [
          "According to the Complete Annals of Dai Viet and Nguyen Trai's Geography, Bat Trang Pottery Village was formed from the Ly Dynasty.",
          "Besides products serving the spiritual life and worship of the Vietnamese people, the pottery kilns in Bat Trang also produce consumer, decorative, and display products with more modern designs, styles, and materials.",
          "The masterpieces of Bat Trang ceramics today have been present everywhere in the Vietnamese market, and are also exported to many countries in Europe and Asia.",
          "The most interesting thing when coming to Bat Trang Pottery Village is to watch the artisans perform the intricate and meticulous ceramic manufacturing process. In addition, you also get to experience making your favorite ceramic products."
        ]
      },
      {
        "title": "History",
        "content": [
          "Bat Trang Pottery Village is located in Bat Trang Commune, including Giang Cao Hamlet and Bat Trang Hamlet, in Gia Lam District, Hanoi City.",
          "According to historical records, when the Ly Dynasty moved the capital from Hoa Lu to Thang Long, the people of Bat Trang migrated along. When they reached near the capital, seeing the fertile alluvial land on the Red River bank, they decided to settle there and together created the pottery making craft.",
          "Throughout nearly 1000 years of history, the pottery village has gone through many events and ups and downs. However, thanks to the perseverance and hard work of the people and artisans here, the pottery village still exists and develops to this day."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20203436.png"
      },
      {
        "title": "Visiting Points",
        "content": [
          "Bat Trang Ancient Village: Walking around the ancient village area, along the dyke road, or going into the small alleys is one of the interesting things when coming to Bat Trang Pottery Village. The ceramic drying racks along the village road, the moss-covered walls, the village gate, the communal house yard, the stone pillars... will definitely be the background for your vintage-style photos."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20203506.png"
      },
      {
        "content": [
          "Bat Trang Ceramic Market: This 6,000m2 market sells a lot of ceramic and porcelain products, from decorative fine art items, souvenirs, to consumer goods, worship items, miniature landscape rockeries. You can completely own an item from Bat Trang Ceramic Market at an affordable price."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20203531.png"
      },
      {
        "content": [
          "Van Van Ancient House: A place preserving products of craft villages, the most being Bat Trang ceramics. Located at the end of Bat Trang village, the ancient house is suitable for you to stop by, admire the collection of over 400 valuable ancient ceramic and porcelain items dating back about 500 years. Visiting hours: From 8 AM - 5:30 PM on weekdays"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20203553.png"
      },
      {
        "content": [
          "Bat Trang Ceramic Museum: Located in Hamlet 5, Bat Trang Commune, Bat Trang Ceramic Museum is a new check-in spot with 7 giant spirals stacked together, based on the idea of the pottery shaping wheel, with multi-faceted curved surfaces, forming a very soft undulating architectural block. In addition, this work also makes full use of local materials such as Bat Trang baked bricks and tiles to honor the rustic and simple beauty of the traditional craft village."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20203615.png"
      },
      {
        "content": [
          "Ancient Bầu Kilns: Today, in Bat Trang Pottery Village, there are still 5 long-standing ancient bầu kilns, which have existed for nearly 100 years and are considered the last heritages of this pottery village. These bầu kilns were previously used to fire ceramics by manual methods, making an important contribution to the traditional ceramic production process."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20203644.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-19%20201548.png",
    "activities": [
      {
        "title": "Experiences",
        "content": [
          "Pottery making experience: Register to play pottery making for about 10,000 VND/turn. With a rotating pottery table and careful instructions on shaping and creating patterns, you can try your hand at molding pottery and creating according to your own ideas.",
          "Visiting the ceramic production process: To create a perfect Bat Trang ceramic product, Bat Trang artisans must go through two main stages: creating the ceramic body and patterns, then glazing. Bat Trang products always have their own quality and stand out with a glossy glaze, sharp patterns, with very high durability, not worrying about damage or fading over time.",
          "Enjoying cuisine: Bat Trang not only has ceramic specialties, but is also known for its bamboo shoot squid soup - a dish 'going to the forest and down to the sea' when combining bamboo shoots and squid very uniquely. This dish seems to be indispensable on the tray of Bat Trang people on every festival or Tet occasion. In addition, you can also enjoy delicious dishes of Hanoi or treat your stomach with super attractive snacks.",
          "Bat Trang Pottery Village is like a living museum, where you can visit cultural relics, antiques, brick houses, as well as temples and communal houses from the 19th century, to better understand the spiritual life, customs, and festivals of the pottery village people.",
          "Especially, during the visit to the craft village, you also get to experience the shaping process of your favorite ceramic products. The artisans in Bat Trang will advise on the types of pottery and porcelain, types of glazes as well as introduce both traditional and industrial products that the kilns in Bat Trang are producing."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20203703.png"
      },
      {
        "title": "Transportation",
        "content": [
          "Bus: From the central area (Long Bien bus station), take bus number 47A or electric bus Ecopark 02, both routes have stops right at the gate of Bat Trang village.",
          "Car or Motorbike: From Cau Giay District, you should choose the direction through Long Bien Bridge or Chuong Duong Bridge. After crossing the bridge, turn right and continue along the Red River dyke road to reach the gate of Bat Trang village."
        ]
      }
    ]
  },
  "VAN PHUC SILK VILLAGE": {
    "name": "VAN PHUC SILK VILLAGE",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d7450.6386620680505!2d105.77019809191444!3d20.97983289024553!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x31345331fc47aee7%3A0x578be675ac809ead!2zbMOgbmcgVuG6oW4gUGjDumMsIFbhuqFuIFBow7pjLCBIw6AgxJDDtG5nLCBIw6AgTuG7mWksIFZp4buHdCBOYW0!5e0!3m2!1svi!2s!4v1760882309009!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Van Phuc Village is a craft village in Hanoi, possessing ancient beauty, famous for high-quality silk products and owning many photo spots that attract young people and tourists.",
    "location": "Van Phuc Ward, Ha Dong District, Hanoi",
    "description": [
      {
        "title": "General Introduction",
        "content": [
          "Van Phuc Silk Weaving Village belongs to Ha Dong Ward, Hanoi. The silk village has existed for over 1000 years and is among the most famous and beautiful silk weaving villages in Vietnam.",
          "The road to Van Phuc Village is a concrete road so you can easily get here. From the city center, you can choose the route going Nguyen Trai - Ha Dong Post Office then turn right to reach the village."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210641.png"
      },
      {
        "title": "History",
        "content": [
          "As one of the famous traditional craft villages in Hanoi, Van Phuc Silk Village has a long history, existing for over 1000 years. The former name of the village was Van Bao, but due to taboo, it was changed to Van Phuc.",
          "1931 was the milestone marking the first time the silk weaving products of the village were promoted and introduced to the international market. At the first introduction, the silk weaving products of Van Phuc Village were highly appreciated by the French, commented as one of the most exquisite silks of Indochina.",
          "In 1958, the silk products of the village were officially exported to Eastern European countries."
        ]
      },
      {
        "title": "Products",
        "content": [
          "Following the long-standing historical flow, the products of Van Phuc Silk Village to this day still maintain traditional beauty and are transformed and improved to become more diverse and eye-catching every day.",
          "Van Phuc silk products are always well evaluated, both beautiful and durable. The material of the product is mainly made from silk so it has characteristic softness and flexibility. Combined with the skillful hands of the workers and many elaborate stages, high-quality products are created.",
          "The decorative patterns on the silk are subtly and creatively expressed through the workers' skills such as dragons and phoenixes, embroidered silk, longevity peak pattern, four cinnamon branches, flying clouds,... The pattern decoration is symmetrical, the lines are graceful but still carry decisive and liberal features, helping the product stand out and have high aesthetics.",
          "Each year, Van Phuc Ha Dong silk exports about 2.5 to 3 million square meters of fabric. With outstanding characteristics, Van Phuc Ha Dong silk is also often chosen as a luxurious gift for relatives, friends or partners."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210703.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210548.png",
    "activities": [
      {
        "title": "Experiences",
        "content": [
          "Check-in at the umbrella street: The shimmering, colorful umbrella street right at the village gate. The 100m long street above is decorated with plastic umbrellas of full colors. The umbrella street not only has aesthetic meaning but also symbolizes the many-colored fabrics, creating a unique highlight for the silk village. Along both sides of the umbrella street are also shops close to each other displaying the characteristic and diverse products of the craft village. Especially, you can rent ao dai and take check-in photos with the unique umbrella street here."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210548.png"
      },
      {
        "content": [
          "Visiting Van Phuc Pagoda: Choosing to visit Van Phuc Silk Village, you can both admire the soft, captivating silk strips; the colorful spaces; and enjoy quiet and peaceful time of the countryside at the ancient Van Phuc Pagoda. The pagoda is located right next to the left side of the village gate with the ancient architecture of Northern pagodas. The garden space of Van Phuc Pagoda is paved with red bricks, the root of the ancient banyan tree, lotus pond, waterfall and wooden bridge have all been tinged with time. The sound of the pagoda's wooden fish, chanting mixed with the quiet atmosphere of the pagoda will bring visitors relaxing and comfortable feelings."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210731.png"
      },
      {
        "content": [
          "Taking photos with the mural wall: Not only the famous colorful umbrella street, coming to Van Phuc Silk Village, you can freely pose and take photos with the mural street. The walls in the village were given a new colorful coat by kindergarten teachers. The mural wall is a giant painting recreating familiar scenes of the craft village from the old days. The location of the mural wall is in the center of the village, the surrounding space is the communal house yard so it is very spacious and airy. The colorful mural stands out in the peaceful and ancient space of the ancient village, definitely helping you have beautiful photos."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210749.png"
      },
      {
        "content": [
          "Coming to Van Phuc Ha Dong Silk Village, you definitely cannot miss the famous silk market. Exploring Van Phuc Silk Market: The market is a place to introduce and promote the silk products of the village to tourists. In the silk market, there are many different silk shops, each shop is decorated and arranged in its own style but all are brilliant and full of colors.",
          "In each shop, many product models such as clothes, ao dai or scarves are sold for tourists to choose from. Besides the main material being silk, shops in Van Phuc Village also trade in diverse products combined from other fabrics or unique and eye-catching decorative items."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210810.png"
      },
      {
        "content": [
          "Besides the above attractive experiences, Van Phuc Silk Village also organizes an extremely special and bustling festival. Participating in the festival: The festival in the village is held in 3 main parts: the ceremony part, the festival part and the promotion part, taking place from October 26 to November 2 every year.",
          "During the festival, the space of the silk village is decorated extremely brilliantly, full of colors from the prominent umbrella street right from the village gate to the silk shops. The most beautiful festival scene is in the evening, at this time the yellow lights are turned on, blending with the brilliant colors, making many tourists think of a 'miniature Hoi An'.",
          "Participating in the festival, you will have the opportunity to witness and experience the silk weaving process from A to Z. The lively, bustling atmosphere along with the enthusiasm of the people during the festival in Van Phuc Village will help you feel a happy and impressive festival.",
          "There are some Van Phuc Silk Village travel experiences that you can refer to for your visit and exploration trip such as: Besides personal vehicles like motorbikes and cars, you can choose public vehicles such as buses, elevated trains to get to Van Phuc Silk Village. When visiting the village by personal vehicle, you can park your vehicle at the parking spot a few meters after passing the village gate. The village is not too wide so parking and walking will help you more comfortable during the visit and shopping. You can come to visit and explore Van Phuc Village at any time of the year. However, the time when the village is most lively and bustling is around the time of the cultural week at the end of October at the end of the year and weekend evenings. If you choose to visit and explore the village on the exact 1st or full moon day of the lunar month, limit bargaining to avoid showing bad intentions to the sellers."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210856.png"
      },
      {
        "content": [
          "Participating in the festival, you will have the opportunity to witness and experience the silk weaving process from A to Z. The lively, bustling atmosphere along with the enthusiasm of the people during the festival in Van Phuc Village will help you feel a happy and impressive festival.",
          "There are some Van Phuc Silk Village travel experiences that you can refer to for your visit and exploration trip such as: Besides personal vehicles like motorbikes and cars, you can choose public vehicles such as buses, elevated trains to get to Van Phuc Silk Village. When visiting the village by personal vehicle, you can park your vehicle at the parking spot a few meters after passing the village gate. The village is not too wide so parking and walking will help you more comfortable during the visit and shopping. You can come to visit and explore Van Phuc Village at any time of the year. However, the time when the village is most lively and bustling is around the time of the cultural week at the end of October at the end of the year and weekend evenings. If you choose to visit and explore the village on the exact 1st or full moon day of the lunar month, limit bargaining to avoid showing bad intentions to the sellers."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20210925.png"
      }
    ]
  },
  "BELL VILLAGE": {
    "name": "BELL VILLAGE",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3729.041772404806!2d105.75914917514845!3d20.830019594575173!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x31344ca08188fcdb%3A0x91b7d910e57d138a!2zQ2jDuWEgTMOgbmcgQ2h1w7RuZw!5e0!3m2!1svi!2s!4v1760883785923!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Chuong Village is a craft village famous throughout the country with a long tradition of making conical hats through leaf hat products. The people of Chuong Village live mainly by making leaf hats while agricultural activities are not much because this place has limited land and dense population.",
    "location": "Phuong Trung Commune, Thanh Oai District, Hanoi",
    "description": [
      {
        "title": "General Introduction",
        "content": [
          "Chuong Conical Hat Village is located in Quoc Trung Commune, Thanh Oai District, about 30 km from Hanoi capital center. Chuong Village is often known by another name as Thanh Oai Leaf Hat Village with an area of over 481 ha including 8 residential hamlets.",
          "Chuong Village has two directions to reach: National Highway 21B to the East of the village boundary and the Day River dike to the West of the village boundary."
        ]
      },
      {
        "title": "History of the Craft Village",
        "content": [
          "As a long-standing craft village in Hanoi, no one knows exactly when Chuong Village started making hats. However, according to the elders in the village, from the 8th century the village had started producing hats.",
          "At that time, Chuong Village was called Trang Thi Trung, specializing in making hats for almost all different classes in society.",
          "During the development period, Chuong Village Hanoi was a place providing many types of traditional hats such as quai thao hats, old leaf hats with live spines. Among them, quai thao was used for the elderly to wear when going to temples. And old leaf hats with live spines served women doing farming work.",
          "Hundreds of years have passed, the craft of weaving leaf hats in Chuong Village has become more and more prosperous. The hat weaving craft has been passed down through many generations and is one of the most famous leaf hat cradles in Hanoi. Currently, there are over 4000 households in Chuong Village weaving leaf hats, bringing cheap products and rich designs to domestic and international customers."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20213655.png"
      },
      {
        "title": "Characteristics of Chuong Village Hats",
        "content": [
          "Coming to Chuong Village, you are directly admiring the production process of the leaf hat, which is a traditional craft, not for business purposes, so the people do not hide their profession. The main material to make the leaf hat is fresh corypha leaves imported from some provinces of Quang Binh, Quang Tri, while the thread and hat frame are woven from bamboo strips available locally.",
          "Fresh corypha leaves are quite heavy and have high moisture content, so the worker needs to dry them in about 3 strong suns to let the water evaporate before starting production. The next step is to treat the leaves, which folk call roasting the leaves to make the leaves drier and softer. Then, the leaves must be air-dried and then taken for final drying before finishing the leaf treatment. At this time, the young corypha leaves will change from green to yellow.",
          "To create a beautiful hat, first you need a solid frame. The frame is mainly woven from bamboo strips and this material is abundant along the two banks of the Day River dike. The worker needs to wrap 16 rings in layers from top to bottom according to a certain size. The next steps are sewing the leaves onto the frame and weaving the hat crown. The talent of Chuong Village workers is that the connecting knots of the weaving threads are all hidden by subtle stitching.",
          "The weaving thread follows the needle paths with 16 layers of rings for the hat to take shape. When the hat is finished weaving, people heat it with match steam to make the hat color white and keep the hat from mold. Or you can also apply oil on the outside to make the hat shiny, glossy and even in color. While making the hat, the girls of Chuong Village decorate by sticking colorful paper flower patterns onto the hat body."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20213815.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-19%20213619.png",
    "activities": [
      {
        "title": "Experiences",
        "content": [
          "Participating in festivals: The biggest annual festival of Chuong Conical Hat Village is the festival on the 10th day of the 3rd lunar month, lasting three days from the 9th to the 11th of the 3rd lunar month. Besides, the unique point at Chuong Village is also the Market. Chuong Village Market usually opens around the 10th day of the Lunar January every year and is also the largest market of the former Ha Dong province. From then until the end of the 10th day of the 3rd lunar month is the village festival, which is also the occasion for a large market. Following the flow of history, in the old days, the market was not simply a place to buy and sell goods but a gathering place and where many folk cultural activities in the region took place. Talking about the festival at Chuong Market, the ancients had a folk song: 'On the 10th, go to Chuong Market to play, Watch human chess, watch rice cooking competition.'"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20213846.png"
      },
      {
        "content": [
          "Visiting Chuong Market: Chuong Village Market opens every day, specifically the hat market has six sessions a month, on the 4th, 10th, 14th, 20th, 24th and 30th of the lunar month. The market mainly sells hats and some hat weaving materials. Chuong Village Market opens quite early, at 6 AM many people in the village have come to buy. The atmosphere around the market, every household eagerly brings their family's products here to sell. The market opens early, crowded and bustling but quickly disperses after about 3 hours. People coming to the market often go quite early, those who like to visit also have to take advantage of coming very early in the morning to enjoy the bustling atmosphere of the hat market. Guests coming to Chuong Village, being present at the hat market sessions will be very excited about this unique cultural feature. It is not clear since when, but for many generations, the people of Chuong Village have maintained the habit of this market session. This is a valuable unique identity of Chuong Village."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20213909.png"
      },
      {
        "content": [
          "Visiting Chuong Village Communal House: Chuong Village Communal House was built long ago in the year Giap Ngo 1894, during the 6th year of King Thanh Thai. Chuong Village Communal House is located in a beautiful position quite close to the national highway, with architecture of the characteristic Nguyen Dynasty 'inner công ngoại quốc' style, including the Trung Cung building, Hau Cung and Dai Bai. Passing through the Four-Pillar style Nghi Mon gate and the wide courtyard at Chuong Village Communal House, visitors will be overwhelmed by the architecture of the Dai Bai building. The column support system at the Dai Bai building of Chuong Village Communal House is all made from old ironwood trees with hard cores, interspersed with delicately carved panels of dragons and the four seasons (long ly quy phung – pine chrysanthemum bamboo apricot). On the panel in front of the communal house courtyard, there are 3 tigers, expressing the full liberal folk art elements. The Trung Dien and Hau Dien of Chuong Village Communal House have a similar structure, built in the stacked roof style with two roof layers. Chuong Village Communal House also preserves and displays many ancient horizontal lacquered boards, scrolls, and couplets,…"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20213941.png"
      },
      {
        "content": [
          "Walking around Chuong Conical Hat Village Pagoda: Chuong Conical Hat Village wears on itself an ancient beauty tinged with time, characteristic of the ancient villages in Hanoi. From the small alleys to each house with old tiled roofs, they create a nostalgic and peaceful feature of the Northern countryside. This place attracts tourists because it is an address with many photo spots. Any corner, just raise the camera and you can take a set of beautiful sparkling photos. Not only attracting by the ancient beauty, Chuong Conical Hat Village also carries a cultural beauty of the leaf hat craft village. As a traditional Vietnamese craft village, when walking around Chuong Conical Hat Village, you will encounter people and households making leaf hats with many cute traditional styles of the Vietnamese people. This is truly a precious experience for any Vietnamese child."
        ]
      },
      {
        "title": "Cuisine",
        "content": [
          "Chuong Village rolled rice cake: Chuong Conical Hat Village has a very famous rolled rice cake throughout the region.",
          "Peanut solidified rice cake: At Chuong Market, there is also peanut solidified rice cake sold a lot in each market session, which is also a simple delicious dish associated with the life of the people."
        ]
      },
      {
        "title": "Transportation",
        "content": [
          "From Hanoi, tourists go along National Highway 6 in the direction of Hoa Bình. After going in the direction of Huong Pagoda about 2km from Kim Bai town, then turn right at the three-way intersection to reach Chuong Conical Hat Village right on the bank of the Day River. As a long-standing leaf hat village lying quietly next to the Day River, Chuong Conical Hat Village possesses the rustic and traditional beauty of the Northern countryside, combined with the unique beauty that the leaf hat production craft brings. If you are a traveler from afar, remember to come to Chuong Village when you have the opportunity to travel to Hanoi to explore and find the simple and honest ancient beauties of the nation as well as the history of Chuong Conical Hat Village and the formation and development of this village."
        ]
      }
    ]
  },
  "PHU DONG VILLAGE": {
    "name": "PHU DONG VILLAGE",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.450672957844!2d105.95849167515378!3d21.054654986888842!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135a8707f85a527%3A0xcad75e483eb36f9c!2zxJDDqsyAbiBHacOzbmcgUGjDuSDEkOG7lW5n!5e0!3m2!1svi!2s!4v1760885188756!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "Phu Dong Giong Temple is an ancient temple imbued with traditional Vietnamese architecture. This place is associated with the legend of the national hero Saint Giong. Every space in the temple evokes national historical pride in the hearts of visitors.",
    "location": "Phu Dong Commune, Gia Lam District, Hanoi",
    "description": [
      {
        "title": "General Introduction",
        "content": [
          "Phu Dong Giong Temple (Phu Dong Temple) is located in Phu Dong Commune, Gia Lam District, Hanoi. This is a land rich in historical traditions in the Capital.",
          "The temple faces South, leaning against the Duong River dike, creating a both poetic and ancient scene.",
          "The temple is a complex of structures including the five-door gate, water pavilion, front hall, middle hall and back sanctuary.",
          "The temple is a living proof of the interference of architectural styles from the Ly Dynasty to the Nguyen Dynasty. Phu Dong Temple is also a symbolic temple associated with the famous Saint Giong legend."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20215951.png"
      },
      {
        "title": "Formation History",
        "content": [
          "Phu Dong Giong Temple belongs to the Phu Dong historical relic complex and was built to commemorate Saint Giong - the national hero who contributed to driving away the invading Yin enemies. To this day, Saint Giong Temple still retains its cultural value and becomes a historical symbol, the pride of many Vietnamese children.",
          "Hung King Period: Phu Dong Giong Temple was built to worship Saint Giong. According to流传 legends, the temple was built on the foundation of Saint Giong's mother's house.",
          "Late 11th century: Under the dynasty of King Ly Thai To, Phu Dong Giong Temple was renovated for the first time. The temple became a place to organize the annual Giong Festival to commemorate the merits of Saint Giong in defeating the Yin invaders.",
          "17th century: During the Restored Le period, the water pavilion of the temple was built, applying the art of delicate carving of familiar folk scenes.",
          "17th – 18th centuries: Dien Quan Cong Nguyen Huy and Trang Nguyen Dang Cong Chat contributed to building the temple's front houses and also contributed many other valuable artifacts.",
          "Currently, Phu Dong Giong Temple is preserving 21 ordinations from many dynasties such as the Le, Tay Son and Nguyen dynasties, the oldest known ordination is from 1634. The temple is preserving many other valuable artifacts such as the worship throne, bronze unicorns, incense burners and a pair of cranes with strong Chinese characteristics."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20220011.png"
      },
      {
        "title": "Legend of Saint Giong",
        "content": [
          "Saint Giong, also known as Phu Dong Thien Vuong, is one of the four immortal saints in Vietnamese folk beliefs.",
          "The legend of Saint Giong is associated with the time of the 6th Hung King and has been passed down by the people for generations.",
          "The story tells that, a 60-year-old woman after stepping into a giant footprint became pregnant and gave birth to a boy named Giong. At three years old, the boy Giong still could not speak or walk.",
          "When the Yin invaders invaded, Giong suddenly asked King Hung to forge for him a horse, sword, and iron armor. After eating his fill, Giong grew rapidly and went to defeat the Yin invaders.",
          "After the victory, he took off his armor and flew straight up to the sky. Later, he was worshiped by the people as a national hero symbol."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20220031.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-19%20215909.png",
    "activities": [
      {
        "title": "Visiting",
        "content": [
          "Unique Architecture: The architecture of Phu Dong Giong Temple has the shape of the Chinese character 'Cong', with a large scale, combining ancient elements and nature. Saint Giong Temple is designed in the style of Northern village communal houses, each item expresses the traditional carving art of the nation. Saint Giong Temple is designed in the style of Northern village communal houses, each item expresses the traditional carving art of the nation. Inside the temple are carved wooden patterns, horizontal lacquered boards and couplets adorning the space more sacred. The main hall of the temple worships a large statue of Saint Giong. Besides are statues of civil mandarins, military mandarins and four close soldiers. The temple has a water pavilion located in the middle of the pond in front of the temple and is built in the structure of two floors and eight roofs stacked on beams."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20220052.png"
      },
      {
        "content": [
          "Viewing Artifacts: Phu Dong Giong Temple is a place to preserve many artifacts with high historical value. Among them, the prominent artifacts in the temple must be mentioned as 37 ordinations, stone steles, worship statues, dragon thrones, palanquins and many other exquisite carving works. These artifacts have the meaning of reflecting the development of carving art in Vietnam through periods."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20215909.png"
      },
      {
        "title": "Visiting",
        "content": [
          "Participating in the Festival: The Phu Dong Temple Festival takes place from the 6th to the 9th day of the 4th lunar month every year, attracting a large number of local people and tourists to participate. In particular, this festival has been recognized by UNESCO as an Intangible Cultural Heritage of Humanity. Visitors coming here can experience the reenactment of Saint Giong's battle against the Yin invaders and many other interesting games."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20220230.png"
      },
      {
        "title": "Transportation",
        "content": [
          "Phu Dong Temple is about 21 km from Hanoi Capital center, so it is quite convenient for tourists to come to learn about Vietnamese history and culture. To get to Phu Dong Giong Temple Hanoi, tourists have many different travel choices.",
          "Bus: You can choose to go by bus with bus 10B from Long Bien to Trung Mau (the next to last stop is Phu Dong). You can get off at the stop and continue moving about 10 to 15 minutes on foot to reach the temple.",
          "Personal Vehicles: Phu Dong Giong Temple is about 17km from the city center. Starting from the Hoan Kiem Lake area, move along Tran Quang Khai Street, cross Chuong Duong Bridge, go straight on National Highway 5 for about 8km, turn right into National Highway 1A (Phu Dong Street)."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20220319.png"
      },
      {
        "title": "Notes",
        "content": [
          "You need to prepare polite clothing when visiting the temple, prioritize choosing long-sleeved clothes, if wearing a skirt, it should be below the knee. You also need to avoid clothes that are too thin or too tight.",
          "Visitors need to walk lightly and speak softly, avoid making noisy actions or joking too much. The temple space is a sacred place, requiring quiet and solemnity.",
          "The worship hall area does not allow photography, so you need to pay special attention to this point. If you want to keep images at the temple, you need to ask the management board to know the allowed photo locations.",
          "Visitors avoid touching artifacts with their hands, do not litter and have actions that damage trees in the campus. Because the temple is an intangible cultural heritage, it needs to be protected by everyone.",
          "Visitors need to be careful in preserving personal belongings, beware of thieves taking advantage of crowds, especially during the festival season to perform theft and pickpocketing."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20220351.png"
      }
    ]
  },
  "SUGAR CANE PAGODA": {
    "name": "SUGAR CANE PAGODA",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3720.7719550267916!2d105.46494177515633!3d21.161471783207418!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3134f5bd11ccd161%3A0xfb9b75c53a44174e!2zQ2jDuWEgTcOtYQ!5e0!3m2!1svi!2s!4v1760887047107!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "Mia Pagoda Son Tay is an ancient gem in Duong Lam ancient village. This place stands out with traditional architecture and a rich system of Buddha statues. Not only a spiritual destination, the pagoda also carries strong historical and cultural imprints.",
    "location": "Duong Lam Commune, Son Tay Town, Hanoi",
    "description": [
      {
        "title": "General Introduction",
        "content": [
          "Mia Pagoda, also known as Sung Nghiem Tu, is located on high land near Tich River. The pagoda faces Southwest, meaning both towards wisdom (South) and wishing the gods to settle (West). Mia Pagoda in Duong Lam ancient village is one of the few pagodas in Hanoi that still preserves traditional architecture. This place is also associated with the sacredness and anecdotes about the Sugar Cane Princess.",
          "This is one of the typical ancient pagodas of the Xu Doai region, still preserving the original traditional architecture to this day.",
          "Mia Pagoda is associated with the land that gave birth to many famous people such as Ngo Quyen, Phung Hung, Ly Bi.",
          "The pagoda is also famous for being the place that preserves the largest number of artistic statues in Vietnam with 287 statues."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20221930.png"
      },
      {
        "title": "History",
        "content": [
          "Initially, Mia Pagoda was only a small pagoda, existing for a very long time. By 1632, this place fell into disrepair. In 1632, the concubine Ngo Thi Ngoc Dieu (also known as Nguyen Thi Ngoc Dong) – from Nam Nguyen village (Nam An), together with her parents and people in the area, stood up to renovate and expand the scale of the pagoda. Thanks to the renovation efforts, she was respectfully called 'Sugar Cane Princess' by the people. Having undergone many repairs, but to this day, the architecture from the time of the Sugar Cane Princess is still preserved intact."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20222039.png"
      },
      {
        "title": "Architecture",
        "content": [
          "Mia Pagoda bears the strong imprint of traditional Vietnamese pagoda architecture, with a harmonious layout and majestic scale. The pagoda is built in the shape of the Chinese character 'Muc', divided into three separate areas: a spacious garden space, a solemn inner hall area, and a surrounding Arhat corridor.",
          "Passing through the three-entrance gate, visitors will see the row of vegetarian houses – where monks live. The main hall area includes many important items such as the Ceremonial Hall, the Lower Pagoda, the Inner Pagoda and the Upper Hall, creating a harmonious overall, bearing the strong imprint of traditional Vietnamese pagoda architecture.",
          "Going deeper inside is the inner hall area, including the front hall, the precious hall, the great hero and the upper hall. The architecture here has the characteristics of the 'inner công ngoại quốc' style – a traditional style in building Vietnamese pagodas. One of the impressive highlights of Mia Pagoda is the 140-meter-long Arhat corridor, where the statues of the Eighteen Arhats are placed. These statues made of blue stone are about 2.5 meters high, each has its own shape and expression, clearly showing the artistic style of the Le period. One of the impressive highlights of Mia Pagoda is the 140-meter-long Arhat corridor, where the statues of the Eighteen Arhats are placed. These statues made of blue stone are about 2.5 meters high, each has its own shape and expression, clearly showing the artistic style of the Le period."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20222056.png"
      },
      {
        "content": [
          "Passing through the three-entrance gate, visitors will see the row of vegetarian houses – where monks live. The main hall area includes many important items such as the Ceremonial Hall, the Lower Pagoda, the Inner Pagoda and the Upper Hall, creating a harmonious overall, bearing the strong imprint of traditional Vietnamese pagoda architecture.",
          "Going deeper inside is the inner hall area, including the front hall, the precious hall, the great hero and the upper hall. The architecture here has the characteristics of the 'inner công ngoại quốc' style – a traditional style in building Vietnamese pagodas. One of the impressive highlights of Mia Pagoda is the 140-meter-long Arhat corridor, where the statues of the Eighteen Arhats are placed. These statues made of blue stone are about 2.5 meters high, each has its own shape and expression, clearly showing the artistic style of the Le period. One of the impressive highlights of Mia Pagoda is the 140-meter-long Arhat corridor, where the statues of the Eighteen Arhats are placed. These statues made of blue stone are about 2.5 meters high, each has its own shape and expression, clearly showing the artistic style of the Le period."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20222118.png"
      },
      {
        "title": "Buddha Statue System",
        "content": [
          "Mia Pagoda is considered a precious treasure of Buddhist sculpture with 287 statues of various sizes and materials. Among them, there are 6 statues cast in bronze, 106 statues carved from wood and 174 statues made of mixed earth, exquisitely lacquered and gilded.",
          "Typical statues: Tuyet Son Statue, Ba Dai Hoa Thuong Statue, Sugar Cane Princess Statue, Nam Hai Quan Am Statue. Tuyet Son Statue: Carved from jackfruit wood, about 3 meters high, depicting the image of Buddha Shakyamuni during the ascetic practice period. The statue has a majestic demeanor, a thin appearance but exuding determination, placed in the Upper Hall area. Ba Dai Hoa Thuong Statue: The statue is about 2 meters high, depicting the image of a monk with a benevolent appearance and a kind smile. The statue is placed in the center of the front hall, one of the statues worshiped by many people. Sugar Cane Princess Statue: Made from jackfruit wood, about 1.5 meters high, depicting the image of a dignified and gentle woman. The statue is worshiped solemnly in the wooden cabinet next to the Three Jewels Hall, showing the respect of the people for the woman who contributed greatly to the pagoda renovation. Nam Hai Quan Am Statue: The jackfruit wood statue is about 2 meters high, carrying the compassionate and kind demeanor of Quan The Am Bo Tat. The statue is placed in the Arhat corridor, a stopping point for many Buddhists and tourists when coming to worship."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20223415.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-19%20221930.png",
    "activities": [
      {
        "title": "Visiting",
        "content": [
          "Admiring the architecture: Exploring the unique traditional architecture of Mia Pagoda",
          "Viewing the statue system: Admiring 287 valuable statues",
          "Visiting the Nine-Story Lotus Tower: The tower is 13 meters high, consisting of 9 floors, built to worship the Buddha's Relics",
          "Walking around the Arhat corridor: The 140-meter-long corridor, where the statues of the Eighteen Arhats are placed"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20222137.png"
      },
      {
        "title": "Festival",
        "content": [
          "The most vibrant and crowded time is in the first lunar month of the year",
          "On major holidays and full moon days, Mia Pagoda attracts a large number of people to worship and pray"
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-19%20222158.png"
      },
      {
        "title": "Transportation",
        "content": [
          "Bus: Bus route number 70A from Kim Ma to Son Tay, then switch to bus route number 92 to Phu Cuong. Bus route number 70A: Departing from Kim Ma to Son Tay. You can board at the stop on Kim Ma Street or other stops on the route. Bus route number 92: From Son Tay, switch to bus route number 92 to Phu Cuong. The bus will stop at Mia Market gate. You need to walk an additional distance of about 600m to reach Duong Lam ancient village and Mia Pagoda.",
          "Personal Vehicles: Route 1: Starting from Nguyen Trai (QL6), go through Khuat Duy Tien, then enter ĐCT08 (Thang Long Avenue). Continue moving to ĐCT419 (Quoc Oai Town), turn into Road 80, then return to ĐCT419. From here, go through Lac Tri (QL32), Phuc Tho Town and reach Duong Lam Ancient Village.",
          "Route 2: Starting from Nguyen Trai (QL6), go through Khuat Duy Tien, enter ĐCT08, then go through Tien Xuan and Binh Yen areas. Continue following QL21A to reach Duong Lam Ancient Village.",
          "Route 3: Departing from Nguyen Trai (QL6), go through Khuat Duy Tien and enter ĐCT08. From here, continue moving to Yen Bai Bridge, then go through Xuan Khanh (Son Tay Town) before reaching Duong Lam Ancient Village."
        ]
      },
      {
        "title": "Notes",
        "content": [
          "Polite, discreet clothing",
          "Maintain hygiene and order",
          "Do not arbitrarily touch artifacts, worship statues",
          "Opening hours: 07:00 to 17:00 daily"
        ]
      }
    ]
  }
}
