{
  "header": {
    "Travel Destination": "Điểm đến du lịch",
    "Cultural Heritage": "Di sản văn hóa",
    "Contemporary Life": "Cuộc sống đương đại",
    "Heritage Award": "Giải thưởng di sản",
    "podcart": "podcart",
    "Advertising": "Quảng cáo",
    "vietnam heritage": "Di sản Việt Nam",
    "Select Language": "Chọn ngôn ngữ",
    "Destination": "Điểm đến",
    "Itinerary": "Hành trình",
    "Retreat": "Nghĩ dưỡng",
    "Weather": "Thời tiết",
    "Search": "Tìm kiếm"
  },
  "banner": {
    "Ho Chi Minh Mausoleum": "Lăng Chủ tịch Hồ Chí Minh",
    "Giong Temple in Soc Son": "Đền Gióng ở Sóc Sơn",
    "Hanoi’s Signature Cuisine": "Ẩm thực đặc trưng Hà Nội",
    "Relaxing Retreat at West Lake": "Khu nghỉ dưỡng thư giãn tại Hồ Tây",
    "Domestic": "Trong nước",
    "Sightseeing": "Tham quan",
    "History": "Lịch sử",
    "Cuisine": "Ẩm thực",
    "When to Visit": "Khi nào nên đến thăm Hà Nội",
    "Relaxation": "Thư giãn",
    "detail": "Thủ đô Hà Nội của Việt Nam, được thành lập hơn 1000 năm trước, là một thành phố giàu lịch sử, với những con phố thuộc khu phố cổ ngoằn ngoèo có niên đại từ thế kỷ 14. Dạo bước trên những con đường rợp bóng cây, ngang qua các công trình kiến trúc cổ kính thời Pháp, bạn sẽ có cảm giác như được quay ngược thời gian. Tuy nhiên, Hà Nội ngày nay không chỉ là câu chuyện của quá khứ. Thành phố nghìn năm tuổi này đang được thổi luồng sinh khí mới với những quán cà phê hiện đại, nhà hàng đẳng cấp quốc tế và các phòng trưng bày nghệ thuật đầy sáng tạo. Khi màn đêm buông xuống, bạn có thể lựa chọn giữa những quán bar sân thượng sang trọng hay những quán bia hơi nhộn nhịp. Nếu đây là lần đầu tiên bạn đến Hà Nội, có những trải nghiệm bạn nhất định phải thử ít nhất một lần trong đời. Từ những ngôi chùa cổ kính đến các khu chợ tấp nập, Hà Nội có tất cả. Nói một cách khác, nơi đây chính là trái tim văn hóa của Việt Nam."
  },
  "Travel Destinations": {
    "Travel Destinations": "Điểm đến du lịch",
    "The Temple of Literature": "Văn Miếu - Quốc Tử Giám",
    "detail": "Văn Miếu – Quốc Tử Giám là một trong những quần thể lịch sử đa dạng và quan trọng nhất tại Hà Nội, nằm phía nam Kinh thành Thăng Long. Đây được công nhận là trường đại học đầu tiên của Việt Nam. Quần thể được bao quanh bởi tường gạch và chia thành năm sân, mỗi sân có những nét kiến trúc riêng biệt. Các sân được ngăn cách bởi các bức tường gạch với ba cổng nối chúng. Từ ngoài vào trong, các cổng là: Cổng Văn Miếu, Cổng Đại Trung, Khuê Văn Các, Cổng Đại Thành và Cổng Thái Học.",
    "Vietnam Museum of Ethnology": "Bảo tàng Dân tộc học Việt Nam",
    "Ho Chi Minh’s Stilt House": "Nhà sàn Chủ tịch Hồ Chí Minh",
    "Vietnam Women’s Museum": "Bảo tàng Phụ nữ Việt Nam",
    "Tay Ho Temple": "Đền Tây Hồ",
    "Hoan Kiem Lake": "Hồ Hoàn Kiếm",
    "Hoa Lo Prison": "Nhà tù Hỏa Lò",
    "National Day September 2: Hanoi Offers Free Admission to 5 Attractions": "Ngày Quốc Khánh 2/9: Hà Nội Miễn Phí Vé Tham Quan 5 Điểm Đến",
    "Long Bien Bridge – A Witness of History": "Cầu Long Biên – Chứng Nhân Lịch Sử",
    "The Hanoi Old Quarter – Renewed Every Day": "Phố Cổ Hà Nội – Được Đổi Mới Mỗi Ngày",
    "Thay Pagoda – Sacred, Majestic, and Beautiful": "Chùa Thầy – Linh Thiêng, Tráng Lệ và Đẹp",
    "Hanoi Old Quarter": "Phố Cổ Hà Nội",
    "Dong Xuan Market": "Chợ Đồng Xuân",
    "West Lake": "Hồ Tây",
    "Long Bien Bridge": "Cầu Long Biên",
    "Ho Chi Minh Museum": "Bảo tàng Hồ Chí Minh",
    "Giong Temple": "Đền Gióng",
    "Ba Da Pagoda": "Chùa Bà Đá"
  },
  "Travel Journey": {
    "Travel Journey": "Hành Trình Du Lịch",
    "Ancient City Tour": "Tham Quan Thành Phố Cổ",
    "Culture And Spiritual": "Văn Hóa Và Tâm Linh",
    "Premium And Night": "Trải Nghiệm Cao Cấp & Ban Đêm",
    "Vacation And Relax": "Kỳ Nghỉ & Thư Giãn",
    "Spa And Relax Ancient Town": "Spa & Thư Giãn Tại Phố Cổ",
    "Hoan Kiem Lake Family Resort": "Khu Nghỉ Dưỡng Gia Đình Hồ Hoàn Kiếm",
    "Luxury West Lake Resort": "Khu Nghỉ Dưỡng Cao Cấp Hồ Tây",
    "Relax Spa Old Quarter And Hoan Kiem Lake": "Spa Thư Giãn Phố Cổ & Hồ Hoàn Kiếm",
    "Spiritual And Cultural Retreat": "Kỳ Nghỉ Văn Hóa & Tâm Linh",
    "Traditional Hanoi Cuisine": "Ẩm Thực Truyền Thống Hà Nội",
    "Night Cuisine of Hanoi Old Quarter": "Ẩm Thực Đêm Phố Cổ Hà Nội",
    "3 Days 2 Nights Hanoi Culinary Journey": "Hành Trình Ẩm Thực Hà Nội 3 Ngày 2 Đêm"
  },
  "Hanoi Old Quarter": {
    "name": "Phố Cổ Hà Nội",
    "introduction": "Phố Cổ Hà Nội là trung tâm lịch sử của thủ đô, nổi tiếng với 36 phố gắn liền với các nghề truyền thống. Nơi đây lưu giữ những ngôi nhà ống cổ, các đền chùa linh thiêng và không khí nhộn nhịp của các khu chợ. Đi bộ qua các con phố, du khách có thể khám phá văn hóa ngàn năm tuổi, thưởng thức các món ăn đặc trưng như phở, bún chả, bánh cuốn và hòa mình vào lối sống giản dị nhưng đặc sắc của người Hà Nội.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d7447.887925057722!2d105.84514704191967!3d21.03492808638189!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abbf21b895f7%3A0x641bc6c48732c7a4!2zUGjhu5EgY-G7lSBIw6AgTuG7mWksIEhvw6BuIEtp4bq_bSwgSMOgIE7hu5lpLCBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759475090004!5m2!1svi!2s",
    "location": "Khu vực này bao phủ khoảng 100 ha với 10 phường và 76 phố, tạo thành một hình tam giác: phía bắc giáp phố Hàng Đâu, phía tây giáp phố Phùng Hưng, phía nam giáp các phố Hàng Bông - Hàng Gai - Cầu Gỗ - Hàng Thùng, phía đông giáp các phố Trần Quang Khải và Trần Nhật Duật. Phố Cổ nằm gần Hồ Hoàn Kiếm và sông Hồng.",
    "description": [
      {
        "title": "Lịch sử và Tổng quan",
        "image": "OldTownHistory",
        "content": [
          "Phố Cổ hình thành từ thời Lý - Trần (thế kỷ 11) là khu dân cư đông đúc phía đông Kinh thành Thăng Long, nơi nghề thủ công và thương mại phát triển, tạo nên các phố nghề chuyên biệt (như Hàng Mã bán đồ cúng, Hàng Bạc bán bạc, Hàng Đào bán lụa). Dưới thời Lê, thuộc huyện Phụng Thiên; dưới thời Pháp, được cải tạo với ảnh hưởng kiến trúc Pháp, Trung Quốc và Ấn Độ. Ngày nay, đây vẫn là khu vực buôn bán sầm uất nhất Hà Nội, với nhà ống hẹp (2-3m rộng, 50-60m sâu), mái ngói, sân trời, và các công trình như cổng Ô Quan Chưởng, đền Bạch Mã, chùa Cầu Đông và đình Quang Đông. Nó phản ánh văn hóa thương mại cổ với các phố như Hàng Buồm và Hàng Ngang (nơi Chủ tịch Hồ Chí Minh soạn Tuyên ngôn Độc lập năm 1945)."
        ]
      }
    ],
    "image": "OldTown",
    "activities": [
      {
        "image": "OldTown1",
        "content": [
          "Dạo qua 36 phố nghề (Hàng Mã, Hàng Đào, Tạ Hiện); thăm các điểm đến nổi bật như cổng Ô Quan Chưởng, đền Bạch Mã, ngôi Nhà Cổ số 87 Mã Mây (triển lãm, xưởng thủ công); mua sắm tại chợ Đồng Xuân; đi dạo phố đi bộ Hồ Hoàn Kiếm (chụp ảnh, xem biểu diễn); tham gia tour xích lô hoặc tour ẩm thực (đường phố); trải nghiệm phố đường tàu (các quán cà phê dọc đường sắt – xem lịch tàu); tham gia các lễ hội như Tết Trung Thu (rước đèn).",
          "Phố Cổ Hà Nội giữ vị trí độc đáo với nhiều di sản văn hóa vật thể và phi vật thể. Qua thời gian, những ngôi nhà nhỏ lợp ngói vẫn tồn tại trong ký ức của nhiều thế hệ người Hà Nội. Trong đó có những ngôi nhà độc đáo, lối sống đặc trưng và những con phố đầy hoài niệm.",
          "Phố Cổ Hà Nội là di sản đô thị với kiến trúc đặc sắc, các phố nghề truyền thống, các phố buôn bán chuyên biệt và nhiều di tích văn hóa lịch sử gắn với Thăng Long – Đông Đô – Hà Nội. Kiến trúc sư To Thị Toan, nguyên Phó Giám đốc Ban Quản lý Phố Cổ, cho biết mặc dù Hà Nội phát triển mạnh, Phố Cổ vẫn lưu giữ mọi chi tiết kiến trúc, từ nhỏ nhất đến những di sản vật thể và phi vật thể lớn lao được tổ tiên truyền lại."
        ]
      },
      {
        "image": "OldTown2",
        "content": [
          "Về kiến trúc, hầu hết các ngôi nhà trong Phố Cổ là nhà ống với mặt tiền hẹp, sân trời và mái ngói dốc sơn vôi vàng. Cuộc sống hàng ngày của hàng nghìn cư dân vẫn tiếp diễn trong những ngôi nhà cổ này, mỗi ngôi mang dấu ấn văn hóa và lối sống truyền thống của người Hà Nội."
        ]
      },
      {
        "image": "OldTown3",
        "content": [
          "Cách bố trí và thiết kế nội thất của các ngôi nhà truyền thống phản ánh gu thẩm mỹ và sự tinh tế của người Hà Nội. Bàn thờ tổ tiên là không gian linh thiêng nhất, trang trí với câu đối, hoành phi, và hương trầm quanh năm. Đồ nội thất cổ như giường, tủ chạm khắc, sách xưa, bình cổ và đồng hồ quả lắc cũ làm nổi bật chiều sâu, sự tinh tế và tinh thần trầm tư của người xưa."
        ]
      }
    ]
  },
  "Dong Xuan Market": {
    "name": "Chợ Đồng Xuân",
    "introduction": "Chợ Đồng Xuân là chợ lớn và lâu đời nhất Hà Nội, nằm ngay trung tâm Phố Cổ. Được xây dựng vào năm 1889 dưới thời Pháp thuộc, đây không chỉ là trung tâm buôn bán sầm uất với các mặt hàng từ vải vóc, quần áo, đồ lưu niệm đến ẩm thực truyền thống, mà còn là điểm đến văn hóa gắn bó mật thiết với đời sống người Hà Nội. Du khách có thể tận hưởng không khí nhộn nhịp, khám phá ẩm thực đường phố và tìm hiểu lịch sử hơn 100 năm của chợ.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.863466040991!2d105.84746377515339!3d21.03814838745631!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abb8e6c24487%3A0xd9def483e7f217e6!2zQ2jhu6MgxJDhu5NuZyBYdcOibiwgxJDhu5NuZyBYdcOibiwgSG_DoG4gS2nhur9tLCBIw6AgTuG7mWkgMTAwMDAwLCBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759475170965!5m2!1svi!2s",
    "location": "Chợ Đồng Xuân nằm trong Phố Cổ Hà Nội, thuộc phường Đồng Xuân, quận Hoàn Kiếm. Phía Đông giáp ngõ Đồng Xuân, phía Tây giáp phố Đồng Xuân, phía Nam giáp phố Cầu Đông, phía Bắc giáp phố Hàng Khoai. Chợ cách Hồ Hoàn Kiếm khoảng 800m, gần ga Long Biên và phố Hàng Mã.",
    "image": "DongXuanMarket",
    "description": [
      {
        "title": "Lịch sử:",
        "content": [
          "Theo ghi chép, chợ Đồng Xuân đã tồn tại trước năm 1888, ban đầu nằm phía nam sông Tô Lịch chảy từ phố Hàng Cá theo đường Ngõ Gạch. Khoảng năm 1889, khi sông Tô Lịch và hồ Thái Cực được lấp, người Pháp đã quy hoạch và chuyển tất cả các cửa hàng vào khu đất trống ở phường Đồng Xuân, hình thành Chợ Đồng Xuân.",
          "Năm 1890, người Pháp chính thức xây dựng Chợ Đồng Xuân với 5 cổng vòm và 5 dãy chợ, mỗi dãy dài 52m, cao 19m, rộng 25m, diện tích khoảng 6.500 m². Mặt tiền theo phong cách kiến trúc Pháp với 5 khối tam giác, lỗ thông gió hình tổ ong và mái tôn gợn sóng.",
          "Ban đầu, chợ mở cửa hai ngày một lần, nhưng với nhu cầu kinh tế ngày càng tăng, sau đó mở cửa hàng ngày từ sáng đến tối.",
          "Khoảng năm 1990, chợ được cải tạo: hai dãy bên bị phá bỏ, ba dãy chính được xây lại thành ba tầng. Năm 1994, một trận hỏa hoạn nghiêm trọng phá hủy gần hết các quầy hàng bên trong chợ.",
          "Năm 1995, Chợ Đồng Xuân được xây dựng lại với số vốn 68 tỷ VND. Ba tầng rộng gần 14.000 m² với khoảng 2.000 quầy. Ngày nay, chợ có các khu vực buôn bán, nhiều cầu thang, lối ra vào các phía, hai cầu thang ngoài trời, năm cầu thang dẫn lên tầng trên và hệ thống thang máy."
        ],
        "image": "DongXuanMarketHistory"
      }
    ],
    "activities": [
      {
        "image": "DongXuanMarketActivities",
        "content": [
          "Mua sắm tại Chợ Đồng Xuân là trải nghiệm thú vị. Là một trong những chợ bán buôn lớn nhất miền Bắc, nơi đây cung cấp nhiều loại hàng hóa — từ thực phẩm, điện tử, quần áo, giày dép đến sản phẩm gia dụng. Du khách có thể dạo qua vô số quầy, khám phá sự đa dạng và không khí đặc trưng của chợ."
        ]
      },
      {
        "image": "DongXuanMarketActivities1",
        "content": [
          "Chợ đêm Đồng Xuân trải dài từ Hồ Hoàn Kiếm qua Hàng Ngang, Hàng Đào đến cuối phố Hàng Dương, hoạt động đến nửa đêm. Dọc đường, bạn sẽ thấy vô số quầy bán quần áo, giày dép và đồ ăn với giá cả phải chăng.",
          "Đừng bỏ lỡ con phố ẩm thực gần Chợ Đồng Xuân, thường được gọi là 'thiên đường ẩm thực trong con ngõ nhỏ'. Dù chỉ dài khoảng 200m, nơi đây tập trung nhiều quán ăn phục vụ vô số món ngon với giá rất hợp lý, mang đến hương vị Hà Nội đích thực."
        ]
      }
    ]
  },
  "West Lake": {
    "name": "Hồ Tây",
    "introduction": "Hồ Tây – hồ tự nhiên lớn nhất Hà Nội – được coi là 'lá phổi xanh' của thủ đô. Nơi đây không chỉ mang vẻ đẹp thơ mộng mà còn gắn với nhiều truyền thuyết. Xung quanh hồ là các con đường rợp bóng cây, quán cà phê lãng mạn bên hồ và các địa danh nổi tiếng như chùa Trấn Quốc và phủ Tây Hồ. Du khách có thể đạp xe, dạo bộ, ngắm hoàng hôn và tận hưởng không khí trong lành ngay giữa lòng thành phố.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d29786.921698599304!2d105.80322226624347!3d21.058070808122626!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aafe7260066b%3A0x4c2c988309aaa3db!2zSOG7kyBUw6J5!5e0!3m2!1svi!2s!4v1759475214634!5m2!1svi!2s",
    "image": "WestLake",
    "location": "Hồ Tây nằm ở phía tây bắc Hà Nội, thuộc quận Tây Hồ, cách trung tâm thành phố khoảng 11 km. Đây là hồ tự nhiên lớn nhất Hà Nội, diện tích khoảng 500 ha. Con đường quanh hồ dài 18 km, rợp bóng cây xanh. Hồ Tây hình thành từ một nhánh của sông Hồng khi dòng sông thay đổi, tạo nên hồ nước ngọt rộng lớn.",
    "description": [
      {
        "title": "Lịch sử hình thành:",
        "image": "WestLake",
        "content": [
          "Hồ Tây tồn tại từ thời Hùng Vương, khi đó được gọi là bến Lâm Ấp, một bến sông nối với sông Hồng. Trong thời Lý - Trần, Hồ Tây trở thành khu nghỉ dưỡng cho vua và quý tộc, với nhiều phủ đền được xây dọc bờ hồ.",
          "Trong lịch sử, Hồ Tây có nhiều tên gọi gắn với truyền thuyết và dân gian: Đầm Xác Cáo, Làng Bắc, Đầm Đầm, Tây Hồ, Đoài Hồ.",
          "Từ vùng hoang dã và đầm lầy, nhờ nỗ lực khai hoang của nhiều thế hệ, trong đó có sự đóng góp của các phi tần triều đại, Hồ Tây trở thành danh thắng văn hóa và du lịch nổi tiếng của Thăng Long – Hà Nội. Nếu Hồ Tây là nhụy hoa, thì 'Thập Tam Trại' là những cánh hoa tỏa hương thơm ngát."
        ]
      },
      {
        "title": "Các di tích lịch sử:",
        "image": "TranQuocPagoda",
        "content": [
          "Phủ Thụy Hoa (Thời Lý): nay thuộc khu vực chùa Trấn Quốc.",
          "Phủ Tư Hoa (Thời Lý): nay là chùa Kim Liên.",
          "Phủ Thụy Chương (Thời Lê): nay là Trường Chu Văn An."
        ]
      },
      {
        "title": "Truyền thuyết và câu chuyện lịch sử:",
        "image": "WestLake3",
        "content": [
          "Hồ Tây, trước đây gọi là Đầm Xác Cáo, hồ Kim Ngưu, Làng Bắc, Đầm Đầm, Đoài Hồ, là hồ tự nhiên lớn nhất trong nội thành Hà Nội. Hồ rộng hơn 500 ha với chu vi 18 km, nằm phía tây bắc trung tâm Hà Nội. Địa lý lịch sử chứng minh Hồ Tây từng là một phần của sông Hồng trước khi dòng chảy thay đổi.",
          "Theo 'Đại Nam Tây Hồ chí', Hồ Tây có từ thời Hùng Vương khi là bến dọc sông Hồng, gọi là bến Lâm Ấp tại làng Long Đỗ. Thời Hai Bà Trưng, bến kết nối với sông Hồng. Xung quanh hồ là rừng tre, gụ, lau và nhiều loài động vật quý hiếm. Bờ tây có hang Gia La (nay là Quận La, phường Xuân La), bờ đông có hang Nhà Lâm (nay là các phố Yên Ninh, Hòe Nhai), bờ nam có hang Bình Sa (sau là Giáp Cổ Xã, nay thuộc quận Hoàn Kiếm). Dân cư thưa thớt, sống chủ yếu bằng săn bắt và đánh cá.",
          "Về địa hình, Hồ Tây là hồ ngoại sinh hình lòng chảo, chứng minh từng là một phần của sông Hồng cổ. 'Đại Việt sử ký toàn thư' ghi rằng năm 1044, vua Lý Thái Tông dùng Hồ Tây (khi đó gọi là Đầm Đầm) để bẫy voi rừng bằng voi thuần từ Chămpa.",
          "Qua nhiều thế kỷ, Hồ Tây trở thành danh thắng nổi tiếng. Thời Lý - Trần, các vua xây dựng phủ đền quanh hồ làm khu nghỉ dưỡng và giải trí, như phủ Thụy Hoa và Tư Hoa (Thời Lý, nay là chùa Kim Liên) và phủ Hàm Nguyên (Thời Trần, nay là chùa Trấn Quốc). Truyền thuyết kể rằng công chúa Tư Hoa, con vua Lý Thánh Tông, biến khu vực này thành các đồn điền dâu tằm và trồng tơ cùng các cung nữ, lập làng Nghi Tam làm trung tâm dệt lụa.",
          "Thời Trần, công chúa Túc Trinh, con vua Trần Thánh Tông, góp phần khai hoang đất đai quanh Hồ Tây, giúp dân nghèo lập làng như làng Cổ Nhuế.",
          "Thế kỷ 17, phi tần Vũ Thị Ngọc Xuân, vợ Chúa Trịnh Trắc, giúp dân khai hoang Minh Cao – Xuân Đỉnh (nay thuộc quận Tây Hồ). Trước đây, chim di cư như vịt trời từ Hồ Tây được coi là đặc sản dâng vua, nhưng do săn bắn quá mức và thay đổi môi trường, các loài chim này biến mất khoảng năm 1994."
        ]
      }
    ]
  },
  "Hoa Lo Prison": {
    "name": "Nhà tù Hỏa Lò",
    "introduction": "Nhà tù Hỏa Lò được xây dựng vào cuối thế kỷ 19 dưới thời Pháp thuộc. Đây từng là nơi giam giữ nhiều chiến sĩ cách mạng Việt Nam. Ngày nay, địa điểm này trở thành một trong những điểm tham quan lịch sử nổi bật của Hà Nội, giúp du khách tìm hiểu cuộc đấu tranh giành độc lập, chiêm ngưỡng hiện vật quý giá và cảm nhận tinh thần kiên cường, bất khuất của người Việt.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.1836948816194!2d105.84390317515307!3d21.02533468789649!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab96aa51de95%3A0x9701e10bee31af54!2zRGkgdMOtY2ggTmjDoCB0w7kgSOG7j2EgTMOy!5e0!3m2!1svi!2s!4v1759475254542!5m2!1svi!2s",
    "location": "Nhà tù Hỏa Lò nằm tại số 1 phố Hỏa Lò, phường Trần Hưng Đạo, quận Hoàn Kiếm, thành phố Hà Nội.",
    "image": "HoaLoPrison",
    "description": [
      {
        "title": "Giờ mở cửa",
        "content": [
          "Địa điểm mở cửa hàng ngày, kể cả ngày lễ và cuối tuần, từ 8:00 sáng đến 5:00 chiều.",
          "Phí vào cửa khá hợp lý, khoảng 30.000 VND/người. Có giảm giá hoặc miễn phí cho một số đối tượng như học sinh, người cao tuổi và những người có công với cách mạng."
        ]
      },
      {
        "title": "Lịch sử",
        "image": "HoaLoPrisonHistory",
        "content": [
          "Nhà tù Hỏa Lò được xây dựng năm 1896 và ban đầu có tên là Prison Centrale. Tuy nhiên, để tránh sự tò mò và kích động của công chúng, tên được đổi thành Maison Centrale, vẫn được khắc trên cổng chính. Nhà tù được xây ở ngoại ô Hà Nội như một trung tâm giam giữ cho cả Bắc Kỳ và Trung Kỳ, chủ yếu giam giữ tù chính trị và các nhà yêu nước chống thực dân. Trong thủ đô nhộn nhịp, Nhà tù Hỏa Lò là minh chứng u ám về lịch sử đầy biến động của Việt Nam. Được biết đến với tên gọi 'Địa ngục trần gian', nhà tù nổi tiếng với kiến trúc tàn bạo dùng để tra tấn và cưỡng bức. Chiếc máy chém đã khiến Hỏa Lò trở thành một trong những nhà tù khét tiếng nhất thế giới."
        ]
      },
      {
        "title": "Kiến trúc Nhà tù Hỏa Lò",
        "image": "HoaLoPrisonArchitecture",
        "content": [
          "Nhà tù ban đầu có diện tích hơn 12.000 m². Ngày nay, chỉ còn 2.434 m² được bảo tồn như di tích lịch sử. Nhà tù được xây trên đất làng Phú Khánh, một làng nghề gốm truyền thống với các lò nung ngày đêm, tạo nên tên gọi 'Hỏa Lò'. Thời Pháp thuộc, nhà tù được thiết kế với tường đá cao 4 mét, dày 0,5 mét, có dây thép gai điện. Khuôn viên được chia thành bốn khu: - Khu A và B: dành cho tù nhân đang điều tra, phạm tội nhẹ hoặc vi phạm nội quy. - Khu C: dành cho tù nhân Pháp hoặc người nước ngoài. - Khu D: dành cho tù nhân chờ thi hành án."
        ]
      },
      {
        "title": "Câu chuyện về Nhà tù Hỏa Lò",
        "image": "HoaLoPrison2",
        "content": [
          "Nhà tù được mệnh danh là 'Địa ngục trần gian', thiết kế để giam khoảng 500 tù nhân. Các phòng giam có điều kiện giam giữ và tra tấn khắc nghiệt và vô nhân đạo.",
          "Từ một làng nghề gốm nổi tiếng, người Pháp biến Hỏa Lò thành nơi tra tấn thể chất và tinh thần cho hàng nghìn chiến sĩ yêu nước. Dù bị giam cầm khắc nghiệt, các nhà cách mạng Việt Nam biến nhà tù thành trường học cách mạng, truyền bá lý thuyết chính trị và duy trì kháng chiến.",
          "Nhiều lãnh đạo Việt Nam nổi bật từng bị giam tại đây, bao gồm Phan Bội Châu, Lương Văn Can, Nguyễn Quyền, Hồ Tùng Mậu, Nguyễn Lương Bằng, cũng như năm Tổng Bí thư Đảng Cộng sản Việt Nam: Nguyễn Văn Cừ, Trường Chinh, Lê Duẩn, Nguyễn Văn Linh và Đỗ Mười.",
          "Du khách vẫn có thể thấy nhiều công cụ tra tấn tàn bạo từng sử dụng ở đây: máy chém, máy sốc điện và gậy. Tất cả cửa, ổ khóa và xích xiềng đều được nhập từ Pháp và quản lý nghiêm ngặt.",
          "Chiếc máy chém khổng lồ là công cụ khét tiếng nhất, khiến Hỏa Lò trở thành một trong những nhà tù khét tiếng trên thế giới. Du khách thường rùng mình khi nhìn thấy các cảnh phục dựng tra tấn và thi hành án.",
          "Tù nhân bị xiềng trong nhiều giờ, ngày, thậm chí nhiều năm. Dù chịu đựng nỗi đau khôn cùng, các tù nhân chính trị vẫn kiên cường, khiến người ta ngưỡng mộ tinh thần của họ.",
          "Hình ảnh các vụ đánh đập, xét xử và tra tấn tàn bạo vẫn in sâu trong ký ức người Việt. Mỗi góc Hỏa Lò mô tả sống động sự hy sinh và đấu tranh của các chiến sĩ cách mạng giành độc lập.",
          "Nhà tù được bao quanh bởi tường đá và bê tông cao 4 mét, có dây thép gai điện trên đỉnh. Các trại gác ở mỗi góc đảm bảo giám sát toàn diện. Cửa sắt, ổ khóa và xiềng xích đều được nhập từ Pháp. Các phòng giam và phòng biệt giam chật chội, ngột ngạt, do các cai ngục khét tiếng cai trị, không ngần ngại đàn áp tù nhân tàn nhẫn.",
          "Tuy vậy, tinh thần yêu nước và cách mạng chưa bao giờ chết. Các cuộc họp cách mạng bí mật, giáo dục chính trị và hoạt động tuyên truyền vẫn tiếp tục, ngay cả trong điều kiện tàn bạo.",
          "Các ấn phẩm cách mạng như 'Đời sống nhà tù' và 'Tạp chí nhà tù' được tạo ra ngay bên trong nhà tù, lan truyền nhận thức và thắp sáng ngọn lửa cách mạng ngay trong nơi giam giữ kẻ thù. Những nỗ lực này mang lại hy vọng và ánh sáng cho một cuộc sống tù đầy tăm tối."
        ]
      }
    ]
  },
  "Long Bien Bridge": {
    "name": "Cầu Long Biên",
    "introduction": "Cầu Long Biên, được người Pháp xây dựng năm 1902, là cây cầu thép đầu tiên bắc qua sông Hồng và trở thành biểu tượng lịch sử của Hà Nội. Trong hơn một thế kỷ, cầu đã chứng kiến nhiều cuộc chiến tranh và sự kiên cường của thủ đô qua bao thăng trầm. Ngày nay, Cầu Long Biên không chỉ là địa điểm giàu giá trị lịch sử mà còn là nơi lý tưởng để ngắm bình minh, hoàng hôn và thưởng ngoạn vẻ đẹp thơ mộng của sông Hồng.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.7406202206075!2d105.85526187515349!3d21.043061987287384!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abc8ca5f2f8f%3A0x6952d77987cbb0b!2zQ-G6p3UgTG9uZyBCacOqbiwgSMOgIE7hu5lpLCBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759475296359!5m2!1svi!2s",
    "image": "LongBienBridge",
    "location": "Cầu Long Biên bắc qua sông Hồng, nối các quận Hoàn Kiếm, Ba Đình và Long Biên của Hà Nội. Mặc dù gần phố cổ, việc di chuyển đến cầu thường gặp tắc đường vào giờ cao điểm từ 06:00 – 09:00 và 16:00 – 19:30.",
    "description": [
      {
        "title": "Thời gian xây dựng",
        "content": [
          "Cầu Long Biên được chính quyền Pháp khởi công ngày 12/9/1898 nhằm kết nối giao thông và thuận tiện cho việc khai thác thuộc địa. Sau hơn ba năm, cầu hoàn thành vào ngày 3/2/1902, lễ khánh thành diễn ra ngày 28/2/1902. Ban đầu, cầu được đặt theo tên Toàn quyền Đông Dương Paul Doumer, nhưng người dân gọi phổ biến là 'Cầu Sông Cái'. Năm 1945, Chủ tịch Ủy ban Nhân dân Hà Nội Trần Văn Lai đổi tên thành Cầu Long Biên."
        ]
      },
      {
        "title": "Kiến trúc độc đáo",
        "image": "LongBienBridge1",
        "content": [
          "Cầu Long Biên dài 2.290 mét, với 896 mét cầu dẫn, gồm 19 nhịp dầm thép và 20 trụ cao. Khi khánh thành, cầu được so sánh như tháp Eiffel nằm ngang, là cầu dài thứ hai thế giới sau cầu Brooklyn ở Mỹ.",
          "Cầu rộng 4,75 mét, chia ba làn chính: một đường ray xe lửa ở giữa, hai làn bên cho ô tô, xe máy, xe đạp và vỉa hè cho người đi bộ ở hai mép ngoài cùng.",
          "Kiến trúc cầu nổi bật với thiết kế hài hòa, cấu trúc thép nhiều lớp như rồng uốn lượn — mạnh mẽ, kiêu hãnh nhưng uyển chuyển. Toàn bộ cầu làm bằng thép chất lượng cao, sử dụng kỹ thuật xây dựng tiên tiến, đảm bảo thẩm mỹ và an toàn.",
          "Hiện nay, Hà Nội có nhiều cầu bắc qua sông Hồng như Chương Dương, Thăng Long, Thanh Trì, Vĩnh Tuy và Nhật Tân. Tuy nhiên, Cầu Long Biên vẫn là biểu tượng không thể thay thế của thủ đô, nhờ kiến trúc lịch sử và hơn 120 năm tồn tại."
        ]
      },
      {
        "title": "Bối cảnh lịch sử",
        "image": "LongBienBridgeHistory",
        "content": [
          "Cây cầu hơn 120 năm tuổi này xuất phát từ ý tưởng của Toàn quyền Đông Dương. Năm 1897, Paul Doumer ra lệnh nghiên cứu và quyết định nhanh chóng về việc xây cầu qua sông Hồng tại Hà Nội.",
          "Khi đó, Hà Nội tách biệt với các tỉnh bờ trái sông Hồng bởi dòng sông rộng hơn 1.700 mét với các bãi cát dịch chuyển. Việc bắc cầu gặp khó khăn, tốn kém và nguy hiểm, vì sông Hồng nổi tiếng dữ dội, nhất là mùa lũ.",
          "Với độ sâu hơn 20 mét và mực nước dâng lên 8 mét khi lũ, lòng sông luôn thay đổi tạo thách thức lớn cho kỹ sư. Nhiều người nghi ngờ việc xây trụ trong điều kiện này là rủi ro.",
          "Một cuộc thầu công khai được đăng trên Indochina Gazette năm 1897. Sáu công ty nộp hồ sơ, Daydé & Pillé thắng với phương án B, chi phí gần 5,4 triệu franc, gồm 19 nhịp dầm khung treo — thiết kế từng áp dụng tại cầu Tolbiac ở đường sắt Paris-Orléans. Daydé & Pillé có nhiều kinh nghiệm, từng xây cầu kênh Briare, cầu Mirabeau, ga Bordeaux-Saint-Jean và Grand Palais ở Paris.",
          "Ngày 12/9/1898, viên đá nền được đặt. Công việc khó nhất là xây trụ ở độ sâu 30 mét, sử dụng kỹ thuật khí nén do kỹ sư Jacques Triger phát minh. Tài liệu và minh họa lưu trữ mô tả toàn bộ quá trình: hạ caisson khí nén, điều chỉnh áp suất, đào đất, đổ bê tông. Công trình thi công bảy tháng mỗi năm, ngưng mùa lũ."
        ]
      },
      {
        "title": "Nhân chứng lịch sử",
        "image": "LongBienBridge2",
        "content": [
          "Suốt 120 năm, Cầu Long Biên đã chứng kiến nhiều sự kiện lịch sử ở Hà Nội. Năm 1902, Hoàng đế Thành Thái và Toàn quyền mới lên tàu từ ga Hà Nội để khánh thành cầu. Qua các năm, cầu được tu sửa, mở rộng, bao gồm mở rộng hai vỉa hè từ 1,3m lên 2,2m để phục vụ giao thông và người đi bộ.",
          "Năm 1945, ông Trần Văn Lai, Chủ tịch Ủy ban Nhân dân Hà Nội đầu tiên, đổi tên cầu từ Doumer thành Long Biên. Năm 1946–1947, cả quân Pháp và Việt Nam bảo vệ cầu. Năm 1954, cầu chứng kiến lịch sử khi quân Pháp rút về Hải Phòng qua cầu, trong khi quân Việt tiếp quản sau Giải phóng Hà Nội ngày 10/10.",
          "Trong chiến tranh chống Mỹ, cầu Long Biên chịu nhiều trận đánh và bị ném bom nặng, khiến nhiều phần cầu bị phá hủy nhiều lần.",
          "Năm 1972, trong chiến dịch ném bom 12 ngày của Mỹ, cầu bị hư hại nặng. Việc xe quân sự lớn đi qua cũng góp phần làm cầu xuống cấp, cần nhiều lần sửa chữa. Một số ảnh hiếm cho thấy nhịp cầu sập sau bom, kèm theo tài liệu và hình ảnh phục dựng.",
          "Bên cạnh đó, ký ức cộng đồng về cầu Long Biên cũng được lưu giữ, gồm ảnh của năm nhiếp ảnh gia, tranh của họa sĩ Trần Anh Tuấn và mô hình tre của cầu được tặng Trung tâm Lưu trữ Quốc gia I.",
          "Ngày nay, Cầu Long Biên vẫn là biểu tượng về sự kiên cường của Hà Nội trong chiến tranh. Các triển lãm và câu chuyện về cầu giúp thế hệ trẻ hiểu không chỉ vai trò lịch sử mà còn phần quan trọng trong quá khứ Hà Nội."
        ]
      }
    ]
  },
  "Ho Chi Minh Museum": {
    "name": "Bảo tàng Hồ Chí Minh",
    "introduction": "Bảo tàng Hồ Chí Minh là một trong những công trình văn hóa lớn nhất Việt Nam, khánh thành năm 1990 nhân kỷ niệm 100 năm ngày sinh Chủ tịch Hồ Chí Minh. Bảo tàng trưng bày hàng chục nghìn hiện vật và tài liệu quý giá về cuộc đời, sự nghiệp cách mạng và tư tưởng của Người. Tham quan bảo tàng giúp du khách hiểu sâu hơn về vị lãnh tụ vĩ đại cũng như cuộc đấu tranh giành độc lập của Việt Nam.",
    "map": "[https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.9260209792596!2d105.83008817515338!3d21.035645887542305!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba02e1deb6f%3A0x949d893f040b49d1!2zQuG6o28gdMOgbmcgSOG7kyBDaMOtIE1pbmg!5e0!3m2!1svi!2s!4v1759475330555!5m2!1svi!2s](https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.9260209792596!2d105.83008817515338!3d21.035645887542305!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba02e1deb6f%3A0x949d893f040b49d1!2zQuG6o28gdMOgbmcgSOG7kyBDaMOtIE1pbmg!5e0!3m2!1svi!2s!4v1759475330555!5m2!1svi!2s)",
    "image": "HoChiMinhMuseum",
    "location": "Nằm tại số 19 Ngọc Hà, quận Ba Đình, Hà Nội, gần Lăng Chủ tịch Hồ Chí Minh, bảo tàng là điểm dừng chân quan trọng trong bất kỳ lịch trình tham quan Hà Nội nào. Công trình bắt đầu xây dựng năm 1985 và chính thức mở cửa ngày 19/5/1990, nhân kỷ niệm 100 năm ngày sinh Chủ tịch Hồ Chí Minh.",
    "description": [
      {
        "title": "Thời gian mở cửa",
        "content": [
          "Thứ Ba, Tư, Năm, Thứ Bảy, Chủ Nhật: 8:00 - 12:00 | 14:00 - 16:30. Bảo tàng thu phí vào cửa đối với khách nước ngoài: 40.000 VND/người. Giảm 50% cho học sinh, trẻ em dưới 14 tuổi. Miễn phí cho cựu chiến binh Việt Nam, người khuyết tật và thành viên Hội đồng Bảo tàng Quốc tế (ICOM)."
        ]
      },
      {
        "title": "Thời gian xây dựng",
        "image": "HoChiMinhMuseum1",
        "content": [
          "Bảo tàng Hồ Chí Minh bắt đầu xây dựng ngày 31/8/1985, hoàn thành đúng dịp kỷ niệm 100 năm ngày sinh Chủ tịch Hồ Chí Minh vào ngày 19/5/1990. Nhân dân Liên Xô đóng góp quan trọng vào thiết kế và thi công. Bảo tàng có ba tầng và gây ấn tượng với kiến trúc độc đáo cùng bộ sưu tập hiện vật rộng lớn."
        ]
      },
      {
        "title": "Kiến trúc bảo tàng",
        "image": "HoChiMinhMuseum2",
        "content": [
          "Tầng 1 – trưng bày tiểu sử Hồ Chí Minh: Du khách bước vào đại sảnh chính thấy bức chân dung bằng đồng ấn tượng của Chủ tịch Hồ Chí Minh. Triển lãm tiếp tục với hình ảnh, tài liệu và hiện vật về cuộc đời và các mốc quan trọng trong phong trào cách mạng và xây dựng đất nước theo di nguyện của Người. Các hiện vật được chia thành 9 chủ đề chính:",
          "Chủ đề 1: Hiện vật và hình ảnh về thời thơ ấu và thanh niên của Hồ Chí Minh ở Nghệ An (1890–1910). Chủ đề 2: Hành trình tìm đường cứu nước đầy gian khó từ 1911–1920, làm việc, học tập và nghiên cứu phương pháp cách mạng. Chủ đề 3: Hình ảnh và tài liệu về hoạt động của Hồ Chí Minh tại Pháp. Chủ đề 4: Tài liệu về hình thành tư tưởng Hồ Chí Minh và các hoạt động thực tiễn dẫn đến việc thành lập Đảng Cộng sản Việt Nam. Chủ đề 5: Hiện vật giai đoạn thành lập Đảng và đấu tranh giành độc lập, bao gồm tài liệu trong thời gian bị giam tại Hồng Kông và Quảng Tây. Chủ đề 6: Hiện vật minh họa cuộc sống của Hồ Chí Minh trong 9 năm kháng chiến ở rừng Tây Bắc (1945–1954). Chủ đề 7: Triển lãm về hoạt động ngoại giao và xây dựng đất nước ở miền Bắc và đấu tranh giành độc lập ở miền Nam. Chủ đề 8: Tài liệu về những năm cuối đời và sự ra đi của Hồ Chí Minh (1969). Chủ đề 9: Tóm tắt hoạt động và di sản Người để lại cho dân tộc."
        ]
      },
      {
        "image": "HoChiMinhMuseum3",
        "content": [
          "Tầng 2 – tái hiện các chiến công vẻ vang dưới sự lãnh đạo của Hồ Chí Minh: Các chủ đề từ tầng 1 được mở rộng để cung cấp cái nhìn sâu hơn về cuộc đấu tranh giành độc lập và những chiến thắng dưới sự lãnh đạo của Người. Hiện vật và tài liệu phản ánh Việt Nam và thế giới thời bấy giờ, cũng như ý nghĩa của Cách mạng Tháng Mười Nga và vai trò của Việt Nam trong phong trào cách mạng quốc tế. Phần còn lại của tầng hai trưng bày triển lãm về Việt Nam trong thời kỳ đổi mới."
        ]
      },
      {
        "content": [
          "Tầng 3 – điểm lại các cột mốc lịch sử quan trọng trong cuộc đời Hồ Chí Minh: Tầng ba giới thiệu các hiện vật về các sự kiện lịch sử khu vực và thế giới ảnh hưởng lớn đến Nguyễn Tất Thành trẻ trên con đường trở thành lãnh tụ dân tộc."
        ]
      },
      {
        "title": "Quy định tham quan",
        "content": [
          "Là bảo tàng trang nghiêm, có ý nghĩa lịch sử lớn, du khách phải tuân thủ các quy định:",
          "Ăn mặc lịch sự, gọn gàng, không đội mũ, đi theo lộ trình hướng dẫn, không chen lấn, nhường đường cho người cao tuổi hoặc người khuyết tật.",
          "Không mang chất ma túy, vật dễ cháy, vũ khí, chất nguy hại hoặc gây ô nhiễm vào bảo tàng.",
          "Đặt hành lý, ba lô, túi xách tại khu vực quy định.",
          "Giữ vệ sinh, không hút thuốc, không ăn uống, tránh gây ồn ào.",
          "Không chạm vào hình ảnh, tài liệu, hiện vật hay thiết bị trong bảo tàng.",
          "Trẻ em dưới 10 tuổi phải có người lớn hoặc nhóm tổ chức đi kèm.",
          "Liên hệ quản lý bảo tàng nếu muốn quay phim hoặc chụp ảnh."
        ]
      }
    ]
  },
  "Ho Chi Minh Stilt House": {
    "name": "Nhà sàn Hồ Chí Minh",
    "introduction": "Nhà sàn Hồ Chí Minh, nằm trong khuôn viên Dinh Tổng thống, được xây dựng năm 1958 và là nơi ở cũng như làm việc của Chủ tịch Hồ Chí Minh trong 11 năm cuối đời. Ngôi nhà gỗ đơn giản này, xung quanh là vườn cây và ao cá yên bình, phản ánh lối sống giản dị và gần gũi với thiên nhiên của Người. Tham quan ngôi nhà giúp du khách hiểu về đời sống hàng ngày của Chủ tịch và trân trọng hơn tấm gương đạo đức cùng lối sống giản dị của vị lãnh tụ kính yêu này.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.8630960645824!2d105.83059557515342!3d21.03816318745575!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba6cb40909b%3A0x15d0fe7c07f55c3b!2zTmjDoCBzw6BuIELDoWMgSOG7kw!5e0!3m2!1svi!2s!4v1759475373642!5m2!1svi!2s",
    "image": "StiltHouse",
    "location": "Nhà sàn Hồ Chí Minh nằm trong Khu di tích Lịch sử Dinh Tổng thống, phường Ngọc Hà, quận Ba Đình, Hà Nội.",
    "description": [
      {
        "image": "StiltHouse2",
        "content": [
          "Bên cạnh ngôi nhà sàn của Hồ Chí Minh ở Nghệ An, nhà sàn tại Hà Nội cũng là điểm du lịch được nhiều người yêu thích. Với giá trị lịch sử và văn hóa lớn, nơi đây đã trở thành một trong những điểm đến nổi tiếng nhất của Hà Nội.",
          "Nhà sàn Hồ Chí Minh được khánh thành vào ngày 17/5/1958, nhân dịp kỷ niệm sinh nhật lần thứ 68 của Chủ tịch Hồ Chí Minh. Ẩn mình dưới những tán cây xanh tươi trong vườn Dinh Tổng thống, ngôi nhà được bao quanh bởi hàng rào hoa dâm bụt xanh và cổng chào bằng những cành cây đan xen. Nằm giữa khu vườn xanh mát, ngôi nhà là biểu tượng rõ rệt của lối sống giản dị của Người.",
          "Đây là nơi Chủ tịch Hồ Chí Minh sống và làm việc lâu nhất trong quá trình hoạt động cách mạng. Đây cũng là nơi đón tiếp các nhà lãnh đạo, đoàn khách chính thức và hàng triệu du khách Việt Nam từ khắp mọi miền đất nước.",
          "Hướng dẫn đi lại: Ngôi nhà gần Lăng Chủ tịch Hồ Chí Minh và có thể dễ dàng tiếp cận bằng phương tiện cá nhân hoặc công cộng. Nếu đi bằng xe cá nhân, du khách có thể đi theo nhiều tuyến đường khác nhau. Sau khi đến Lăng, gửi xe tại số 19 phố Ngọc Hà, gần cổng Bảo tàng Hồ Chí Minh hoặc trên phố Ông Ích Khiêm đối diện Bộ Quốc phòng. Nếu sử dụng xe buýt công cộng, đi các tuyến 09, 18, 22, 33, 45 hoặc 50; tất cả đều dừng tại số 18A phố Lê Hồng Phong."
        ]
      },
      {
        "title": "Giờ mở cửa",
        "content": [
          "Mùa hè (1/4 - 31/10): Buổi sáng: 7:30 - 11:00 | Buổi chiều: 13:30 - 16:00",
          "Mùa đông (1/11 - 31/3): Buổi sáng: 8:00 - 11:00 | Buổi chiều: 13:30 - 16:00"
        ]
      },
      {
        "title": "Nhà sàn Hồ Chí Minh",
        "image": "StiltHouse1",
        "content": [
          "Du khách có thể chiêm ngưỡng kiến trúc độc đáo của Nhà sàn Hồ Chí Minh, được thiết kế theo kiểu nhà sàn truyền thống của các dân tộc thiểu số. Ngôi nhà dài 10,5 mét, rộng 6,2 mét, gồm hai tầng. Tầng trệt là nơi làm việc của Chủ tịch Hồ Chí Minh vào mùa hè, phòng họp Bộ Chính trị và khu tiếp khách thân mật. Tầng trên có hai phòng, mỗi phòng khoảng 10m², dùng để nghỉ ngơi và làm việc.",
          "Ngôi nhà được làm từ gỗ chắc chắn, mái ngói và rèm bao quanh, tạo cảm giác ấm cúng và gần gũi. Khi tham quan, du khách sẽ hiểu thêm về lối sống giản dị của Chủ tịch Hồ Chí Minh thông qua các vật dụng hàng ngày như giường, bàn, ghế, giá sách và máy đánh chữ. Hướng dẫn viên sẽ giải thích chi tiết về ngôi nhà, giúp du khách hiểu sâu hơn về đời sống hằng ngày của Người.",
          "Bên cạnh khám phá kiến trúc, du khách còn có thể nghỉ ngơi và thưởng thức không gian rộng rãi của 'Ao cá Hồ Chí Minh', nơi Người thư giãn và cho cá ăn sau giờ làm việc."
        ]
      },
      {
        "title": "Quy định dành cho khách tham quan",
        "content": [
          "Ăn mặc lịch sự, đúng mực; tránh mặc trang phục quá ngắn.",
          "Đi nhẹ, nói khẽ, xếp hàng đúng trật tự, tránh gây ồn ào.",
          "Tuân thủ quy định gửi hành lý của bảo tàng.",
          "Không mang thiết bị điện tử, trang sức giá trị, thức ăn, vật dụng bằng kim loại.",
          "Cấm chụp ảnh hoặc quay phim ở khu vực cấm.",
          "Trẻ em dưới 3 tuổi không được vào bên trong."
        ]
      }
    ]
  },
  "Vietnam Museum of Ethnology": {
    "name": "Bảo tàng Dân tộc học Việt Nam",
    "introduction": "Bảo tàng Dân tộc học Việt Nam lưu giữ và trưng bày hơn 15.000 hiện vật, hình ảnh và phim tư liệu về 54 dân tộc trên cả nước. Với không gian triển lãm cả trong nhà và ngoài trời, du khách có thể chiêm ngưỡng trang phục truyền thống, nhạc cụ, vật dụng gia đình và những ngôi nhà dân tộc được tái hiện chân thực. Đây là điểm đến lý tưởng để khám phá văn hóa, phong tục và sự đa dạng phong phú của các cộng đồng dân tộc Việt Nam.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.808496822009!2d105.7961604751534!3d21.040347187380686!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab394353b821%3A0x47c950bb0f081a1c!2zQuG6o28gdMOgbmcgRMOibiB04buZYyBo4buNYyBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759474766377!5m2!1svi!2s",
    "image": "VietnamMuseumOfEthnology",
    "location": "Nằm trên phố Nguyễn Văn Huyên, Hà Nội, Bảo tàng Dân tộc học Việt Nam là một trong những bảo tàng nổi tiếng của thành phố, cách trung tâm khoảng 8 km, thuộc quận Cầu Giấy.",
    "description": [
      {
        "title": "Lịch sử",
        "content": [
          "Bảo tàng Dân tộc học Việt Nam bắt đầu xây dựng năm 1981 với diện tích ban đầu 3,27 ha. Sau đó mở rộng thêm 1 ha, tổng diện tích lên 4,4 ha. Bảo tàng được coi như một thế giới thu nhỏ, giới thiệu lịch sử và văn hóa 54 dân tộc Việt Nam thông qua nhiều hiện vật như trang phục, trang sức, vũ khí, nhạc cụ và nhiều hơn nữa.",
          "Đây là điểm đến lý tưởng cho học sinh, người yêu văn hóa và du khách. Bảo tàng cung cấp kiến thức thực tế về phong tục, đời sống hàng ngày và đặc điểm của từng dân tộc. Ngoài ra, bảo tàng còn tổ chức nhiều hoạt động giáo dục được du khách đánh giá cao."
        ],
        "image": "VietnamMuseumOfEthnology1"
      },
      {
        "title": "Giờ mở cửa",
        "content": [
          "Mở cửa hàng ngày từ 8:30 - 17:30.",
          "Đóng cửa vào thứ Hai và dịp Tết Nguyên đán."
        ]
      },
      {
        "title": "Giá vé tham quan",
        "content": [
          "Người lớn: 40.000 VND/người",
          "Sinh viên: 15.000 VND/người",
          "Học sinh: 10.000 VND/người",
          "Người cao tuổi / Người khuyết tật / Dân tộc thiểu số: giảm 50%",
          "Trẻ em dưới 6 tuổi / Người khuyết tật nặng / Thành viên ICOM / Nhà báo / Nhà tài trợ: miễn phí",
          "Dịch vụ bổ sung: Tham quan trong & ngoài nhà có hướng dẫn bằng tiếng Việt: 50.000 VND; Hướng dẫn trong nhà bằng tiếng Anh hoặc Pháp: 100.000 VND"
        ]
      },
      {
        "title": "Bố cục bảo tàng",
        "content": [
          "Bảo tàng được chia thành ba khu vực chính, cả trong nhà và ngoài trời, để du khách khám phá:",
          "Vườn Kiến trúc: Khu vực ngoài trời rộng 2 ha này trưng bày những ngôi nhà dân tộc miền Trung Tây Nguyên và vùng núi phía Bắc. Du khách có thể khám phá 10 mô hình được tái hiện gồm nhà Rông, nhà sàn, nhà ngói, v.v. Mọi chi tiết, từ cổng, giếng nước đến cầu thang, đều được tái hiện tỉ mỉ, tạo không gian sinh động phản ánh đặc trưng riêng của từng dân tộc."
        ],
        "image": "VietnamMuseumOfEthnology2"
      },
      {
        "content": [
          "Triển lãm Trống Đồng Đông Sơn: Du khách tìm hiểu về nghi lễ tôn giáo truyền thống, chiêm ngưỡng trang phục truyền thống, công cụ lao động xưa và vật dụng gia đình. Với hơn 15.000 hiện vật và hơn 42.000 phim, bản ghi âm, triển lãm này là phần quan trọng của bảo tàng, giới thiệu văn hóa độc đáo của 54 dân tộc Việt Nam."
        ],
        "image": "VietnamMuseumOfEthnology3"
      },
      {
        "content": [
          "Triển lãm Diều: Du khách tìm hiểu phong tục và đời sống hàng ngày thú vị của người dân các nước Đông Nam Á. Khu vực này cũng tổ chức các hoạt động giáo dục, chiếu phim và giao lưu văn hóa về các dân tộc Việt Nam và ASEAN."
        ],
        "image": "VietnamMuseumOfEthnology4"
      },
      {
        "content": [
          "Bảo tàng còn tổ chức các trò chơi dân gian như: ném bóng, đu dây, đi trên cầu treo, trò chơi cân bằng. Đây là những trải nghiệm đặc sắc mà du khách không nên bỏ qua."
        ],
        "image": "VietnamMuseumOfEthnology5"
      },
      {
        "content": [
          "Du khách cũng có thể thưởng thức các màn biểu diễn nghệ thuật dân gian như:",
          "Múa rối nước: Biểu diễn phản ánh đời sống hàng ngày và câu chuyện dân tộc qua rối nước sinh động. Giá vé: 90.000 VND/người lớn, 70.000 VND/trẻ em. Buổi sáng miễn phí.",
          "Hát Quan họ Bắc Ninh: Du khách thưởng thức các màn hát Quan họ và tương tác với nghệ sĩ. Những ai tự tin có thể tham gia trình diễn trong buổi biểu diễn."
        ],
        "image": "VietnamMuseumOfEthnology6"
      },
      {
        "title": "Quy định dành cho khách tham quan",
        "content": [
          "Tránh tham quan theo nhóm lớn để đảm bảo trải nghiệm tốt.",
          "Có hướng dẫn viên bằng tiếng Việt, Anh và Pháp. Có thể yêu cầu trực tiếp, mua vé tại cổng hoặc đăng ký trước.",
          "Không mang vũ khí, vật liệu dễ cháy, nổ hoặc độc hại.",
          "Mang theo tiền và vật dụng có giá trị.",
          "Giữ vệ sinh và tránh gây ồn.",
          "Không mang đồ ăn, thức uống vào bảo tàng.",
          "Không chạm, di chuyển hoặc ngồi lên hiện vật.",
          "Không mang vật nuôi vào bảo tàng."
        ]
      }
    ]
  },
  "Vietnam National Museum of History": {
    "name": "Bảo tàng Lịch sử Quốc gia Việt Nam",
    "introduction": "Nằm ngay trung tâm Hà Nội, Bảo tàng Lịch sử Quốc gia Việt Nam lưu giữ và trưng bày hàng chục nghìn hiện vật quý giá phản ánh lịch sử Việt Nam từ thời tiền sử đến hiện đại. Với kiến trúc Pháp cổ độc đáo kết hợp với các màn trưng bày khoa học, bảo tàng mang đến cho du khách hành trình khám phá các nền văn hóa cổ đại, triều đại phong kiến, phong trào cách mạng và di sản lịch sử của dân tộc. Đây là điểm đến không thể bỏ qua đối với những ai muốn hiểu sâu về lịch sử Việt Nam.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.204311178126!2d105.8567948751531!3d21.024509487924828!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abe9661234d7%3A0x7d497bffb5ce2892!2zQuG6o28gdMOgbmcgTOG7i2NoIHPhu60gUXXhu5FjIGdpYQ!5e0!3m2!1svi!2s!4v1759475412261!5m2!1svi!2s",
    "location": "Số 1 Tràng Tiền, Cửa Nam, Hà Nội || Số 216 Trần Quang Khải, Hoàn Kiếm, Hà Nội",
    "image": "VietnamNationalMuseumOfHistory",
    "description": [
      {
        "title": "Giờ mở cửa",
        "content": [
          "Buổi sáng: 8:00 – 12:00",
          "Buổi chiều: 13:30 – 17:00",
          "(Mở cửa hàng ngày trừ thứ Hai đầu tháng)"
        ]
      },
      {
        "title": "Vé vào cửa",
        "content": [
          "Người lớn: 40.000 VND/người",
          "Sinh viên đại học, cao đẳng, trung cấp: 20.000 VND/người",
          "Học sinh: 10.000 VND/người",
          "Miễn phí cho trẻ em dưới 6 tuổi và người khuyết tật nặng theo quy định hiện hành",
          "Giảm giá: 50% cho các nhóm đối tượng ưu tiên, người cao tuổi và người khuyết tật nặng theo quy định"
        ]
      },
      {
        "title": "Các khoản phí khác",
        "content": [
          "Chụp ảnh: 15.000 VND/máy",
          "Quay phim: 30.000 VND/máy"
        ]
      },
      {
        "title": "Lịch sử",
        "image": "VietnamNationalMuseumOfHistory1",
        "content": [
          "Bảo tàng Lịch sử Quốc gia Việt Nam được thành lập từ việc hợp nhất Bảo tàng Lịch sử Việt Nam và Bảo tàng Cách mạng Việt Nam. Nằm ở trung tâm Hà Nội, gần nhiều di tích lịch sử thiêng liêng như Tháp Rùa - Hồ Hoàn Kiếm; Cầu Thê Húc - Đền Ngọc Sơn - Tháp Bút, v.v. Bảo tàng giới thiệu lịch sử Việt Nam từ thời tiền sử đến hiện đại qua bộ sưu tập phong phú gồm tài liệu, hiện vật, hình ảnh, trong đó có nhiều Bảo vật Quốc gia. Khu Tràng Tiền trưng bày lịch sử Việt Nam đến cuối triều Nguyễn 1945, trong khi khu Trần Quang Khải trưng bày lịch sử từ giữa thế kỷ 19 đến nay."
        ]
      },
      {
        "content": [
          "Hiện tại, bảo tàng lưu giữ và trưng bày hơn 200.000 hiện vật và tài liệu về lịch sử và văn hóa Việt Nam. Từ thời tiền sử đến năm 1945, bảo tồn gần 110.000 hiện vật, bao gồm di tích, đồ cổ và 20 Bảo vật Quốc gia.",
          "Các bộ sưu tập quý hiếm gồm văn hóa Thời kỳ Đá cũ, Thời kỳ Đồ đồng, Thời kỳ Sắt sơ khai, Văn hóa Đông Sơn, gốm sứ cổ Việt Nam, đồ đồng thời Lê-Nguyễn, điêu khắc Chăm, và các loại hình trang trí từ Trung Quốc, Nhật Bản, Ấn Độ, Đông Nam Á.",
          "Từ giữa thế kỷ 19 đến nay, bảo tàng lưu giữ khoảng 80.000 hiện vật và tài liệu về lịch sử cách mạng Việt Nam, Đảng Cộng sản Việt Nam, Chủ tịch Hồ Chí Minh và các lãnh đạo Đảng khác.",
          "Bảo tàng là thành viên của Hội đồng Bảo tàng Quốc tế (ICOM) và là thành viên sáng lập của Hiệp hội Bảo tàng Quốc gia Châu Á (ANMA). Bảo tàng thường xuyên trao đổi kinh nghiệm và hợp tác với gần 30 bảo tàng trong và ngoài nước. Năm 2013, bảo tàng tổ chức Hội nghị ANMA lần thứ 4 tại Hà Nội.",
          "Tham quan Bảo tàng Lịch sử Quốc gia Việt Nam giúp hiểu sâu về di sản văn hóa lâu đời của đất nước và nuôi dưỡng niềm tự hào về tinh thần kiên cường của các thế hệ đi trước trong xây dựng và bảo vệ Tổ quốc."
        ],
        "image": "VietnamNationalMuseumOfHistory2"
      },
      {
        "content": [
          "Thời tiền sử ở Việt Nam: Triển lãm trưng bày dấu tích con người trên các vùng núi, trung du, đồng bằng và ven biển, bao gồm răng người, công cụ, hóa thạch động vật. Thời kỳ Đá mới cho thấy sự phát triển mới về công cụ đá mài, gốm và nông nghiệp sơ khai.",
          "Giai đoạn dựng nước: Người Việt cổ làm chủ việc luyện đồng, rèn sắt và sản xuất công cụ, trang sức, vũ khí. Đến giữa thiên niên kỷ 1 TCN, xuất hiện ba trung tâm văn hóa lớn ở Việt Nam, đặt nền tảng cho các quốc gia cổ: Văn hóa Đông Sơn (Văn Lang và Âu Lạc), Văn hóa Đồng Nai và Óc Eo (Vương quốc Phù Nam), Văn hóa Sa Huỳnh (Vương quốc Chăm).",
          "Thời kỳ sau Công nguyên (thế kỷ 1-10): Năm 111 TCN, Việt Nam chịu sự thống trị của các triều đại phương Bắc. Năm 938, chiến thắng Bạch Đằng của Ngô Quyền kết thúc 1.000 năm Bắc thuộc, mở ra thời kỳ độc lập dưới triều Ngô, Đinh, Tiền Lê (939-1009), Lý-Trần (1009-1400), Hồ (1400-1407), Lê-Mạc (1428-1788), Tây Sơn (1778-1802) và Nguyễn (1802-1945)."
        ],
        "image": "VietnamNationalMuseumOfHistory3"
      },
      {
        "content": [
          "Khu Trần Quang Khải lưu giữ hiện vật và tài liệu lịch sử Việt Nam từ giữa thế kỷ 19. Ban đầu là Sở Thương mại Đông Dương, được chuyển thành bảo tàng năm 1954. Triển lãm gồm:",
          "Phong trào đấu tranh giành độc lập dân tộc (1858-1945)",
          "30 năm kháng chiến chống xâm lược (1945-1975)",
          "Xây dựng đất nước từ 1976 đến nay"
        ],
        "image": "VietnamNationalMuseumOfHistory4"
      },
      {
        "content": [
          "Bảo tàng mang kiến trúc lãng mạn Pháp độc đáo. Mặt tiền được thiết kế tạo không gian triển lãm rộng với đại sảnh hình bát giác, mỗi cạnh dài 11 mét. Hậu sảnh hình chữ nhật kéo dài qua các phòng được bố trí khoa học.",
          "Tầng trệt chứa không gian triển lãm, kho lưu trữ, nhà kho và văn phòng hành chính. Bảo tàng được thiết kế kiểm soát độ ẩm để giữ hiện vật khô trong thời tiết ẩm ướt Hà Nội. Tòa nhà có mái bát giác nhiều tầng với ba lớp dốc khác nhau. Mái dưới rộng hơn, che nắng, chắn mưa, được chống đỡ bằng cột đôi và hệ thống đòn tay cách điệu, phản ánh thẩm mỹ Đông Á mạnh mẽ."
        ],
        "image": "VietnamNationalMuseumOfHistory5"
      },
      {
        "content": [
          "Tham gia các chương trình giáo dục tại bảo tàng: Du khách có thể chiêm ngưỡng các hiện vật quý giá từ thời tiền sử đến hiện đại. Hoạt động tương tác tại Phòng Khám phá bao gồm thử trang phục truyền thống, làm thủ công và chơi trò chơi dân gian. Trẻ em có thể tham gia các chương trình giáo dục đặc biệt như Câu lạc bộ Lịch sử Trẻ và Bài học Lịch sử, mang đến cách học lịch sử sinh động và hấp dẫn."
        ],
        "image": "VietnamNationalMuseumOfHistory6"
      }
    ]
  },
  "Vietnam Women’s Museum": {
    "name": "Bảo tàng Phụ nữ Việt Nam",
    "introduction": "Bảo tàng Phụ nữ Việt Nam là điểm đến độc đáo tại Hà Nội, trưng bày hơn 40.000 hiện vật về vai trò, cuộc sống và đóng góp của phụ nữ trong gia đình, xã hội và lịch sử dân tộc. Với các chủ đề như phụ nữ trong gia đình, phụ nữ trong chiến tranh, thời trang truyền thống và hiện đại, bảo tàng mang đến góc nhìn sâu sắc và cảm xúc về phụ nữ Việt Nam qua các thời kỳ. Đây là nơi giàu giá trị văn hóa và truyền cảm hứng cho cả du khách trong nước và quốc tế.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.204311178126!2d105.8567948751531!3d21.024509487924828!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab0015696227%3A0x3826297573752daa!2zQuG6o28gdMOgbmcgUGjhu6UgbuG7ryBWaeG7h3QgTmFt!5e0!3m2!1svi!2s!4v1759475441712!5m2!1svi!2s",
    "location": "36 Lý Thường Kiệt, phường Cửa Nam, Hà Nội. (Bảo tàng Phụ nữ Việt Nam nằm ở vị trí trung tâm thuận tiện, cách Hồ Hoàn Kiếm khoảng 10 phút đi bộ.)",
    "image": "VietnameseWomenMuseum",
    "description": [
      {
        "title": "Lịch sử",
        "content": [
          "Bảo tàng Phụ nữ Việt Nam được thành lập năm 1987 và chính thức khánh thành năm 1995, trực thuộc Hội Liên hiệp Phụ nữ Việt Nam. Kể từ khi mở cửa, bảo tàng đã tổ chức nhiều triển lãm để giới thiệu tới du khách trong và ngoài nước các bộ sưu tập có giá trị lịch sử và văn hóa liên quan đến phụ nữ Việt Nam."
        ]
      },
      {
        "title": "Giờ mở cửa",
        "content": [
          "08:00 – 17:00 từ thứ Hai đến Chủ nhật",
          "Bảo tàng đón khách tham quan hàng ngày từ 8 giờ sáng đến 5 giờ chiều."
        ]
      },
      {
        "title": "Vé tham quan",
        "content": [
          "Người lớn: 40.000 VND/người",
          "Sinh viên: 20.000 VND/người",
          "Trẻ em dưới 10 tuổi: miễn phí",
          "Các mức giá trên chỉ mang tính tham khảo. Giá vé có thể thay đổi tùy theo thời điểm hoặc dịch vụ/sự kiện đi kèm."
        ]
      },
      {
        "content": [
          "Triển lãm thường xuyên trải dài tầng 2, 3 và 4, trưng bày hơn 1.000 tài liệu, hiện vật và hình ảnh với ba chủ đề chính: Phụ nữ trong Gia đình, Phụ nữ trong Lịch sử và Thời trang Phụ nữ.",
          "Phụ nữ trong Gia đình: Tầng 2, làm nổi bật hình ảnh người phụ nữ Việt Nam với vai trò vợ và mẹ, đồng thời giới thiệu các nghi lễ, phong tục liên quan đến hôn nhân, sinh nở và đời sống gia đình.",
          "Phụ nữ trong Lịch sử: Tầng 3, giới thiệu vai trò và đóng góp của phụ nữ Việt Nam với những phẩm chất như nhân hậu, kiên cường, mạnh mẽ và tài năng, được thể hiện trong các phong trào kháng chiến và xây dựng đất nước hiện đại."
        ],
        "image": "VietnameseWomenMuseum2"
      },
      {
        "content": [
          "Thời trang Phụ nữ: Tầng 4, triển lãm trang phục, trang sức, mỹ phẩm và các vật dụng của phụ nữ 54 dân tộc Việt Nam, phản ánh đặc trưng văn hóa từng vùng."
        ],
        "image": "VietnameseWomenMuseum1"
      },
      {
        "content": [
          "Bảo tàng còn giới thiệu các triển lãm nghiên cứu về lịch sử, văn hóa, các vấn đề xã hội và bình đẳng giới, mang đến góc nhìn đa dạng về phụ nữ Việt Nam.",
          "Tín ngưỡng thờ Mẫu: Triển lãm “Thờ Mẫu: Tâm – Sắc – Lạc” truyền tải giá trị văn hóa địa phương của tín ngưỡng thờ Mẫu – một hoạt động văn hóa tâm linh liên quan đến phụ nữ.",
          "Không gian Nghệ thuật đương đại: Tầng 5, nơi các nghệ sĩ trẻ tự do thể hiện sáng tạo trong văn hóa và nghệ thuật.",
          "Hành trình Khởi nghiệp: Triển lãm giới thiệu 15 phụ nữ Việt Nam tiêu biểu vượt qua khó khăn và đạt thành công bước đầu trong các lĩnh vực như giáo dục trẻ em, đào tạo nghề, chăm sóc người khuyết tật, du lịch cộng đồng và sản xuất thực phẩm sạch."
        ],
        "image": "VietnameseWomenMuseum3"
      },
      {
        "content": [
          "Bảo tàng Phụ nữ Việt Nam còn tổ chức triển lãm trực tuyến trên website, giúp công chúng theo dõi các sự kiện và trưng bày trước đây. Một số triển lãm trực tuyến hiện có:",
          "Nông thôn đáng sống",
          "Bình yên sau bão",
          "Khao khát tỏa sáng",
          "Nơi tôi sống",
          "Bảo vệ biên cương",
          "Nữ tướng khăn vấn"
        ]
      },
      {
        "content": [
          "Hiện tại, bảo tàng lưu giữ gần 30.000 tài liệu và hiện vật về phụ nữ Việt Nam qua các thời kỳ lịch sử.",
          "Để cung cấp cái nhìn chính xác và toàn diện nhất, bảo tàng nghiên cứu, lựa chọn và sắp xếp hiện vật theo chủ đề cho từng bộ sưu tập."
        ],
        "image": "VietnameseWomenMuseum4"
      },
      {
        "title": "Dịch vụ tại Bảo tàng Phụ nữ Việt Nam",
        "content": [
          "Hướng dẫn nghe tự động – ngôn ngữ tiếng Việt, Anh, Pháp, Nhật, Hàn.",
          "Hướng dẫn viên đặc biệt cho du khách quốc tế.",
          "Hoạt động ngoại khóa cho trẻ em.",
          "Dịch vụ hướng dẫn viên cho nhóm tham quan.",
          "Cửa hàng quà lưu niệm và quán cà phê.",
          "Cơ sở tổ chức hội thảo, hội nghị.",
          "Tiện ích miễn phí: Wi-Fi, tủ đồ, lối đi cho xe lăn, thang máy, v.v."
        ]
      }
    ]
  },
  "Tay Ho Temple": {
    "name": "Tay Ho Temple",
    "type": "rest",
    "introduction": "Phủ Tây Hồ nằm trên bán đảo nhô ra giữa Hồ Tây, là một trong những điểm thờ Mẫu linh thiêng và nổi tiếng nhất Hà Nội. Không chỉ là nơi cầu tài, cầu lộc, cầu bình an của người dân và du khách, phủ còn hấp dẫn bởi không gian thanh tịnh, cảnh sắc thơ mộng giữa hồ nước mênh mông. Ghé thăm Phủ Tây Hồ, du khách vừa được trải nghiệm đời sống tín ngưỡng đặc sắc, vừa có cơ hội thưởng ngoạn vẻ đẹp nên thơ của Hồ Tây.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.439385117403!2d105.81715387515385!3d21.055106186873346!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aafdc1d3eab9%3A0x29ca439485e6f89e!2zUGh1zIkgVMOieSBIw7TMgA!5e0!3m2!1svi!2s!4v1759475473621!5m2!1svi!2s",
    "location": "Phủ Tây Hồ nằm ở số 52 phố Đặng Thai Mai, phường Quảng An, quận Tây Hồ, Hà Nội.",
    "image": "/app/data/touristattractions/477b06a7-phu-tay-ho-6.jpg",
    "description": [
      {
        "title": "Giới thiệu",
        "content": [
          "Mãi cho tới thời điểm hiện tại, người ta vẫn chưa biết được cụ thể Phủ Tây Hồ được xây dựng thời gian nào. Phủ được dự đoán xây dựng vào khoảng thế kỷ 17 nhưng cũng có thể muộn hơn. Trong những cuốn sách đầu tiên về các di tích của Thăng Long cũng không có ghi chép nào về Phủ Tây Hồ.",
          "Phủ Tây Hồ thờ ai là câu hỏi khá nhiều người thắc mắc. Nơi đây thờ Chúa Liễu Hạnh - người được triều nhà Nguyễn phong là “mẫu nghi thiên hạ”, một trong “Tứ bất tử” của Việt Nam. Bốn vị thánh bất tử trong tín ngưỡng dân gian Việt Nam là: Tản Viên Sơn Thánh (Sơn Tinh), Phù đổng Thiên Vương (Thánh Gióng), Thánh Mẫu Liễu Hạnh, Thánh Chử Đạo Tổ (Chử Đồng Tử).",
          "Truyền thuyết kể rằng, Chúa Liễu Hạnh là con gái của Ngọc Hoàng, vì làm vỡ ly ngọc quý mà bị đày xuống trần gian. Sau khi ngao du khắp nơi dưới hạ giới, bà bị thu hút bởi vẻ đẹp của Hồ Tây nên quyết định dừng chân tại đây, giúp nhân dân diệt trừ ma quái, tiêu diệt tham quan, bảo vệ cuộc sống yên bình cho người dân.",
          "Phủ Tây Hồ là nơi mọi người đi lễ đông nhất vào các ngày mùng 1 và ngày Rằm hàng tháng. Ngày 3/3 Âm lịch là ngày giỗ Mẫu Liễu Hạnh. Người dân sẽ tổ chức lễ rước kiệu các Mẫu từ Phủ Tây Hồ qua đường Yên Phụ, Cổ Ngư sau đó ngược lại đường Quán Thánh đến đền Nghĩa Lập tại số 32 phố Hàng Đậu lấy mã rồi quay lại. Ngày 6-7/3, tại Phủ tổ chức các cuộc thi văn nghệ, hát chầu văn ở chùa Phổ Linh thuộc thôn Tây Hồ thu hút rất nhiều người tham dự."
        ],
        "image": "/app/data/touristattractions/phu-tay-ho-0_1679923011.jpg"
      },
      {
        "title": "Thời gian mở cửa:",
        "content": [
          "Phủ Tây Hồ mở cửa từ 5 giờ sáng đến tầm 7 giờ tối. Vào những ngày lễ, rằm, Phủ Tây Hồ sẽ đóng cửa muộn hơn vì rất đông người tới dâng hương tại phủ, đặc biệt vào ngày 13/8 và mùng 3/3 âm lịch, ngày lễ bà chúa Liễu Hạnh. Cũng bởi vẻ đẹp độc đáo và nguồn gốc linh thiêng đó, Phủ Tây Hồ ngày càng nổi tiếng và trở thành điểm đến thường xuyên của người dân Hà thành.",
          "Mang trong mình những giá trị văn hóa, tâm linh, lịch sử to lớn, vào ngày 13/2/1996, Phủ Tây Hồ được Bộ Văn hóa, Thể thao và Du lịch công nhận là Di tích Lịch sử - Văn hóa."
        ]
      },
      {
        "title": "Kiến trúc và không gian tâm linh tại phủ:",
        "image": "/app/data/touristattractions/phu-tay-ho-1.jpg",
        "content": [
          "Phủ Tây Hồ nổi bật với lối kiến trúc cổ kính, đậm nét văn hóa dân gian Việt Nam, mang đến không gian linh thiêng giữa lòng Hà Nội. Cổng tam quan của phủ mở ra một khuôn viên rộng rãi, kết nối với hồ Tây thơ mộng, tạo nên sự giao thoa giữa kiến trúc truyền thống và cảnh quan thiên nhiên. Các bức tranh đắp nổi, điêu khắc tứ linh, tứ quý cùng hình tượng long phượng tạo nên nét đẹp trang nghiêm, kỳ vĩ, khắc họa đậm chất Việt.",
          "Điểm nhấn trong kiến trúc của phủ là mật cung và động Sơn Trang với ba gian lớn, chất liệu bê tông giả cổ sắc nâu bền vững, thể hiện vẻ đẹp trường tồn cùng thời gian. Khu vực sân vườn phủ Tây Hồ còn được che mát bởi những cây xanh tươi tốt, nổi bật là cây si cổ thụ - một di sản của Việt Nam giúp tỏa bóng mát quanh năm.",
          "Không gian thanh bình với làn gió từ hồ Tây thổi vào, phủ Tây Hồ không chỉ là nơi hành hương linh thiêng mà còn là chốn thư thái, giúp lòng người tìm lại sự an nhiên sau những bộn bề của cuộc sống."
        ]
      }
    ]
  },
  "Giong Temple": {
    "name": "Đền Gióng",
    "introduction": "Đền Gióng tại Sóc Sơn, Hà Nội, là một quần thể di tích gắn liền với truyền thuyết Thánh Gióng – vị anh hùng đánh đuổi giặc Ân. Quần thể bao gồm nhiều công trình như Đền Thượng, Đền Hạ, Đền Mẫu, Chùa Kiến Sơ, vừa mang giá trị lịch sử vừa có ý nghĩa tâm linh. Hàng năm, lễ hội Gióng được tổ chức long trọng, thu hút đông đảo du khách đến tưởng nhớ Thánh Gióng và khám phá nét đẹp văn hóa truyền thống Việt Nam.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d119149.94397837254!2d105.73732702911167!3d21.055251515617925!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135a8707f85a527%3A0xcad75e483eb36f9c!2zxJDDqsyAbiBHacOzbmcgUGjDuSDEkOG7lW5n!5e0!3m2!1svi!2s!4v1759475525997!5m2!1svi!2s",
    "location": "Đền Gióng tại Sóc Sơn, Hà Nội, tọa lạc trên núi Sóc, xã Vê Linh, huyện Sóc Sơn. Ngôi đền linh thiêng này thu hút nhiều du khách và cách trung tâm Hà Nội khoảng 30 km, dễ dàng di chuyển bằng xe buýt hoặc phương tiện cá nhân.",
    "image": "GiongTemple",
    "description": [
      {
        "content": [
          "Đền Gióng là quần thể di tích lịch sử nổi tiếng với nhiều đền, gồm Đền Trình, Chùa Non Nước, Đền Mẫu, Chùa Đại Bi, Đền Thượng, Chồng Đá, Tượng Thánh Gióng và nhà bia. Đặc biệt có tượng Thánh Gióng bằng đồng nguyên khối rất giá trị. Quần thể đền Gióng Sóc Sơn được công nhận là Di tích Lịch sử Quốc gia vào năm 1962.",
          "Ngôi đền nổi tiếng với truyền thống Thánh Gióng đánh đuổi giặc Ân để giành lại tự do cho đất nước. Thánh Gióng biểu tượng cho lòng dũng cảm kiên cường và quyết tâm bảo vệ hòa bình.",
          "Theo truyền thuyết, Đền Sóc Sơn ban đầu là một đền thờ nhỏ thờ Đông Thiên Vương. Khi vua Lê Hoàn đánh quân Tống, vua đã làm lễ cầu xin Thánh Gióng phù hộ.",
          "Lịch sử Đền Gióng gắn liền với sự phát triển của tín ngưỡng dân gian Việt Nam qua nhiều triều đại. Dù truyền thuyết Thánh Gióng có từ thời Hùng Vương, kiến trúc hiện nay được xây dựng quy mô lớn chính thức dưới triều Lý Thái Tông (1028-1054)."
        ],
        "image": "GiongTemple1"
      },
      {
        "title": "Mốc thời gian phát triển Đền Gióng",
        "content": [
          "Triều Lý (1010-1225): Vua Lý Thái Tông xây dựng ngôi đền đầu tiên ở Sóc Sơn và tôn Thánh Gióng là 'Phù Đổng Thiên Vương'.",
          "Triều Trần (1225-1400): Mở rộng quần thể đền, thêm các kiến trúc và bàn thờ.",
          "Triều Lê (1428-1788): Nhiều lần trùng tu quy mô lớn, đặc biệt dưới vua Lê Thánh Tông.",
          "Triều Nguyễn (1802-1945): Tiếp tục tu sửa; nổi bật năm 1823 dưới triều Minh Mạng.",
          "Hiện đại (1954-nay): Trùng tu lớn vào các năm 1978, 1994, 2004, và dự án bảo tồn toàn diện 2018-2020 với kinh phí 28,5 tỷ đồng.",
          "Theo Viện Nghiên cứu Bảo tồn Di sản Văn hóa (2019), quần thể Đền Gióng đã trải qua ít nhất 14 lần trùng tu lớn, mỗi lần để lại dấu ấn kiến trúc và nghệ thuật độc đáo. Mặc dù bị chiến tranh tàn phá, đặc biệt trong các cuộc chiến chống Pháp và Mỹ, ngôi đền vẫn được bảo tồn tương đối nguyên vẹn. Năm 2010, khi UNESCO công nhận lễ hội Gióng là Di sản Văn hóa Phi vật thể của Nhân loại, quần thể đền được áp dụng các biện pháp bảo tồn nghiêm ngặt hơn."
        ],
        "image": "GiongTemple2"
      },
      {
        "content": [
          "Đền Gióng Sóc Sơn là một trong những điểm du lịch nổi tiếng gần Hà Nội. Quần thể gồm nhiều đền nhỏ như:",
          "Đền Trình: Còn gọi là Đền Hạ, là điểm dừng đầu tiên trong quần thể đền Gióng Sóc Sơn. Thờ các vị thần núi Sóc, xây dựng vào thế kỷ 10, năm 980. Đền Hạ kiến trúc hình đình với tiền đường và hậu cung, gồm 5 gian với 1 bàn thờ, 3 bia đá và các dụng cụ lễ nghi.",
          "Đền Mẫu: Đối diện Chùa Đại Bi, thờ mẹ Thánh Gióng. Mặc dù nhỏ nhưng có kiến trúc tinh xảo và giếng nước trong.",
          "Chùa Đại Bi: Sau khi tham quan Đền Hạ, đi theo ngói đỏ tới Chùa Đại Bi. Đây là chùa Phật giáo với thiết kế độc đáo, trang trí câu đối mạ vàng và lưu giữ bia khen Phật giáo. Nơi đây cũng từng là nơi Ngô Chân Lưu tu hành (933-1011).",
          "Đền Thượng: Thờ Thánh Gióng và các vị thần khác. Lối vào có tượng ngựa đầu rồng, tượng trưng cho ngựa Thánh Gióng và rồng hậu duệ. Bên trong có đại điện với mành, trang trí rực rỡ."
        ],
        "image": "GiongTemple3"
      },
      {
        "content": [
          "Tại Đền Gióng, bạn có thể chiêm ngưỡng tượng đồng nguyên khối cao 15m, nặng 85 tấn, dài 16m, đặt ở độ cao 302m so với mực nước biển. Tượng mô tả Thánh Gióng cầm tre thúc ngựa phi lên trời.",
          "Tượng do nhà điêu khắc nổi tiếng Nguyễn Kim Xuân thực hiện, thuộc Hội Mỹ thuật Hà Nội, nằm trong quần thể Đền – Chùa Sóc, trở thành công trình văn hóa trọng điểm trong dịp kỷ niệm 1000 năm Thăng Long – Hà Nội năm 2010."
        ],
        "image": "GiongTemple4"
      },
      {
        "content": [
          "Chùa Non Nước trong quần thể Đền Sóc có diện tích 260m², cao 14m, gồm 80 cột gỗ chính, đường kính 35cm, dài 14m. Công trình sử dụng 30 tấn đồng để đúc tượng Phật, 600m³ gỗ lim và 30m³ đá xanh.",
          "Khi tham quan Chùa Non Nước, du khách sẽ trải nghiệm không gian linh thiêng và trang nghiêm. Chùa nằm ở độ cao 110m so với mực nước biển, gần tượng Thánh Gióng 30 tấn, cao hơn 8m, là điểm không thể bỏ qua trong quần thể Đền Gióng Sóc Sơn."
        ],
        "image": "GiongTemple5"
      },
      {
        "content": [
          "Nếu bạn băn khoăn 'Đi Sóc Sơn chơi gì?', hãy tham gia lễ hội Gióng. Diễn ra từ ngày 6 đến 8 tháng Giêng âm lịch, lễ hội tưởng nhớ anh hùng Thánh Gióng. Năm 2010, lễ hội được UNESCO công nhận là Di sản Văn hóa Phi vật thể của Nhân loại.",
          "Trong lễ hội, du khách có thể xem nghi lễ dâng hương, rước voi, trầu cau, rước cỏ voi, rước kiệu tổng, và các màn trình diễn dân gian. Ngoài ra còn có trò chơi dân gian như bắt vịt, đập nồi, hát quan họ, võ thuật, và các màn múa kết hợp."
        ],
        "image": "GiongTemple6"
      },
      {
        "title": "Lưu ý khi tham quan Đền Gióng Sóc Sơn",
        "content": [
          "Bạn có thể đến Đền Gióng bất cứ lúc nào vì gần Hà Nội. Tuy nhiên, do quần thể rộng, nên chọn giờ mát mẻ để tránh mệt mỏi.",
          "Nếu muốn trải nghiệm lễ hội, hãy lên kế hoạch từ ngày 6 đến 8 tháng Giêng âm lịch, khi đông du khách đến lễ, tham quan và vui chơi."
        ]
      },
      {
        "title": "Truyền thuyết Thánh Gióng và Ý nghĩa văn hóa",
        "content": [
          "Truyền thuyết Thánh Gióng là một trong những câu chuyện lâu đời và được yêu thích nhất trong văn hóa Việt Nam. Theo truyền thuyết, thời vua Hùng thứ 6, một cậu bé 3 tuổi ở làng Phù Đổng không biết nói, không biết đi, sống với mẹ già. Khi quân Ân xâm lược, vua sai tìm người giúp nước. Cậu bé đột nhiên nói, xin vua ngựa sắt, roi sắt, mũ sắt.",
          "Khi được trang bị, cậu lớn thành người khổng lồ, cưỡi ngựa sắt ra trận đánh thắng quân Ân. Sau chiến thắng, Thánh Gióng bay lên trời từ núi Sóc (nay là Sóc Sơn). Vua tôn phong 'Phù Đổng Thiên Vương' và xây đền tại nơi sinh và nơi bay lên trời.",
          "Truyền thuyết mang ý nghĩa sâu sắc: Sức mạnh dân tộc: cậu bé 3 tuổi hóa khổng lồ tượng trưng sức mạnh tiềm ẩn của Việt Nam chống giặc. Yêu nước: lòng dũng cảm của Thánh Gióng biểu tượng tình yêu đất nước. Khát vọng tự do: bay lên trời là ước muốn tự do, chống áp bức. Đoàn kết: cả làng giúp Gióng lớn lên thể hiện tinh thần cộng đồng. Trong nhận thức người Việt, Thánh Gióng là biểu tượng tinh thần bất khuất, truyền cảm hứng cho nhiều thế hệ. Câu chuyện được đưa vào văn học, nghệ thuật và giáo dục như bài học về yêu nước và tự lực."
        ],
        "image": "GiongTemple7"
      }
    ]
  },
  "Thay Pagoda": {
    "name": "Chùa Thầy",
    "introduction": "Chùa Thầy, tọa lạc dưới chân núi Sài Sơn (huyện Quốc Oai, Hà Nội), là ngôi chùa cổ gắn với Thiền sư Từ Đạo Hạnh – danh tăng thời Lý. Quần thể chùa gồm Đền Hạ, Đền Trung, Đền Thượng và Thủy đình độc đáo trên hồ Long Chiểu, nơi tổ chức múa rối nước truyền thống. Tham quan Chùa Thầy, du khách sẽ chiêm ngưỡng kiến trúc cổ, cảnh sắc nên thơ và tìm hiểu đời sống văn hóa dân gian, tâm linh phong phú của người Việt.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.241447043721!2d105.64370757515306!3d21.023022987975807!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3134512bbe5baab7%3A0x6195ecacc2336c44!2zQ2jDuWEgVGjhuqd5!5e0!3m2!1svi!2s!4v1759475564176!5m2!1svi!2s",
    "location": "Chùa Thầy, còn gọi là Chùa Ca, tọa lạc dưới chân núi Sài Sơn, cách trung tâm Hà Nội khoảng 25 km về phía Tây Nam. Ngôi chùa chính thức có tên Thiên Phúc Tự, ẩn mình dưới núi Phật Tích (núi Thầy). Đây là di tích lịch sử – văn hóa nổi tiếng với kiến trúc từ thế kỷ 17. Chùa Thầy là một trong những ngôi chùa đẹp và linh thiêng của Hà Nội, thu hút khách tham quan, lễ Phật và tìm hiểu kiến trúc độc đáo.",
    "image": "ChuaThay",
    "description": [
      {
        "title": "Cách di chuyển tới Chùa Thầy",
        "content": [
          "Bằng phương tiện cá nhân (ô tô, xe máy): Từ trung tâm Hà Nội, đi theo Đại lộ Thăng Long (CT08) đến ngã tư Sài Sơn, rẽ phải khỏi đường cao tốc khoảng 3 km theo biển chỉ dẫn. Lưu ý: xe máy không được chạy trên đường gom Đại lộ Thăng Long. Từ Big C – ngã tư Trần Duy Hưng, đi khoảng 15 km đến đường rẽ vào chùa. Phí gửi xe: xe máy 10.000 VND, ô tô 30.000 VND.",
          "Bằng xe buýt: Đi tuyến CNG 01 từ bến Mỹ Đình đến bến xe Sơn Tây. Tuyến này dừng ngay trước chùa, thuận tiện cho khách tham quan."
        ]
      },
      {
        "title": "Lịch sử Chùa Thầy",
        "content": [
          "Chùa Thầy được xây dựng thời Lý, gắn với cuộc đời Thiền sư Từ Đạo Hạnh. Ban đầu là am nhỏ Hương Hải Ẩm. Sau đó, vua Lý Nhân Tông xây lại thành hai cụm chùa: Đền Hạ (Thiên Phúc Tự) và Đền Thượng (Đình Sơn Tự).",
          "Đầu thế kỷ 17, Đình Quan Công và hoàng gia trùng tu, xây dựng các điện Phật, hậu cung, nhà bia và tháp chuông. Năm 1997, Bưu điện Việt Nam phát hành bộ tem 'Danh thắng Việt Nam' có Chùa Thầy. Ngày nay, chùa vừa là nơi thờ tự vừa là điểm du lịch khám phá kiến trúc và lịch sử."
        ]
      },
      {
        "title": "Kiến trúc Chùa Thầy",
        "content": [
          "Du khách ấn tượng với cảnh núi non hùng vĩ xung quanh chùa. Chùa Thầy ở Sài Sơn, Quốc Oai, theo kiến trúc thời Lý với bố cục 'Tam' gồm ba chùa song song xây trên nền đá xanh cao. Tiền điện dùng cho nghi lễ và giảng dạy (Đền Hạ), điện giữa thờ Tam Bảo (Đền Trung), điện trong thờ ba kiếp Từ Đạo Hạnh và Đền Thượng. Các miếu và tháp chuông bố trí dọc đường lên núi.",
          "Chùa tọa lạc dưới chân núi Sài Sơn, hướng Nam, núi Long Đầu bên trái và núi Sài Sơn phía sau. Hồ Long Chiểu trước mặt tạo hình miệng rồng. Ba điện song song (Hạ, Trung, Thượng) nối bằng hành lang tạo tổng thể kiến trúc hài hòa.",
          "Đền Hạ: thờ Đức Ông và các hiền giả; hành lang trưng bày tượng Bát Bộ Kim Cương. Đền Trung: thờ Phật, tượng Hộ pháp và các thiên vương. Đền Thượng: thờ Phật A Di Đà, ba kiếp Từ Đạo Hạnh và tượng phụ mẫu.",
          "Chùa quay mặt về hướng Nam, trước chùa, nằm giữa Sài Sơn và Long Đẩu là một hồ rộng mang tên Long Chiểu hay Long Trì (ao rồng). Sân có hàm rồng. Phần chính của chùa Thầy gồm ba tòa song song với nhau gọi là chùa Hạ, chùa Trung và chùa Thượng. Giữa chùa Hạ và chùa Trung có ống muống nối với nhau, tạo thành thế hạ công thượng nhất.",
          "Chùa Hạ là nhà tiền tế, bày các tượng Đức Ông, Thánh hiền. Ống muống để tượng Bát bộ Kim Cương. Chùa Trung bày bàn thờ Phật, hai bên có hai tượng Hộ pháp, tượng Thiên vương. Chùa Thượng hay chùa trên tách biệt hẳn, ở vị trí cao nhất, biển đề Đại hùng Bảo điện, đồng thời là nhà Thánh, để tượng Di Đà tam tôn, tượng ba kiếp của Thiền sư Từ Đạo Hạnh, tượng cha mẹ Từ Đạo Hạnh."
        ],
        "image": "ChuaThay1"
      },
      {
        "content": [
          "Chùa còn có hai hành lang hai bên, tháp chuông phía sau và quảng trường phía trước hướng ra hồ Long Chiểu, tạo hình miệng rồng. Hai cây cầu, Nhật Tiên và Nguyệt Tiên, xây năm 1602, nối quảng trường với các khu vực xung quanh, tạo thành 'râu rồng'. Cầu Nhật Tiên dẫn tới đảo nhỏ có miếu Tam Phụ, cầu Nguyệt Tiên dẫn lên núi.",
          "Lên núi là Đền Thượng. Phía sau có Hang Phật Tích, nơi Từ Đạo Hạnh để xác nhập kiếp vua Lý Thần Tông. Gần đó có các hang linh như Bút Mộc, Hang Bò, Hang Gió, mỗi hang có đặc trưng tự nhiên riêng.",
          "Từ sân này có hai cầu là Nhật tiên kiều và Nguyệt tiên kiều nối sang hai bên, tạo thành hai râu rồng. Hai cầu này do Phùng Khắc Khoan xây vào năm 1602. Cầu Nhật Tiên nối sang một hòn đảo nhỏ, trên đảo có đền thờ Tam phủ. Cầu Nguyệt Tiên nối vào đường lên núi.",
          "Trước chùa, Thủy đình nổi lên như hoa sen trên hồ, tô điểm cảnh quan. Tháng 3, cây phượng cổ thụ nở rực, báo hiệu mùa lễ hội. Người dân tin rằng sự kết hợp cảnh chùa và hoa phượng mang may mắn, tạo trải nghiệm thú vị cho du khách."
        ],
        "image": "ChuaThay2"
      },
      {
        "content": [
          "Hang Cắc Cò là hang tự nhiên, thường được ví như phiên bản thu nhỏ của Sơn Đoòng gần Hà Nội. Hang vừa linh thiêng vừa huyền bí, có cảnh quan tự nhiên tuyệt đẹp.",
          "Khám phá toàn bộ hang phải trèo qua đá nhọn trong bóng tối sâu. Chinh phục hang là trải nghiệm thú vị, vừa ngắm cảnh vừa cảm nhận phiêu lưu."
        ],
        "image": "HangCacCo"
      },
      {
        "title": "Lễ hội Chùa Thầy",
        "content": [
          "Lễ hội truyền thống diễn ra từ ngày 5 đến 8 tháng 3 âm lịch, trọng tâm vào ngày 7. Giống các chùa lớn khác, lễ hội có nghi lễ và trình diễn dân gian. Chùa giữ các nghi lễ chính như Mộc Đức, đón bàn thờ tổ tiên, dâng lễ và rước kiệu.",
          "Trong lễ hội, người dân và du khách tham gia các hoạt động như đấu vật, múa rối nước, trò chơi suối núi và các trò chơi dân gian sôi động khác."
        ],
        "image": "ChuaThay3"
      }
    ]
  },
  "Ba Da Pagoda": {
    "name": "Chùa Bà Đá",
    "introduction": "Chùa Bà Đá, còn gọi là Linh Quang Tự, nằm trên phố Nhà Thờ, quận Hoàn Kiếm, là một trong những ngôi chùa cổ và nổi tiếng của Hà Nội. Được xây dựng vào thời Lê, chùa gắn liền với truyền thuyết về pho tượng Phật bằng đá tự nhiên, từ đó chùa có tên dân gian “Chùa Bà Đá”. Ngày nay, chùa vừa là nơi thờ tự, vừa là điểm tham quan yên bình, thu hút nhiều du khách và phật tử đến lễ bái và tham quan.",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.0975487801456!2d105.84775287515316!3d21.028782487777995!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab956d281f97%3A0xa4275008ea27b36b!2zQ2jDuWEgQsOgIMSQw6E!5e0!3m2!1svi!2s!4v1759475609171!5m2!1svi!2s",
    "location": "Chùa Bà Đá (còn gọi là Linh Quang Tự, Sung Khanh Tự) là ngôi chùa cổ tại số 3 phố Nhà Thờ, Hàng Trống, Hoàn Kiếm, Hà Nội, cách Hồ Hoàn Kiếm chỉ 100 mét.",
    "image": "ChuaBaDa",
    "description": [
      {
        "title": "Giới thiệu về Chùa Bà Đá",
        "content": [
          "Chùa Bà Đá là một trong bốn ngôi chùa 'Ba' nổi tiếng ở Hà Nội, cùng với Chùa Ba Đanh, Chùa Ba Nành và Chùa Ba Ngò. Nằm ngay trung tâm phố cổ, đây là điểm đến của các nhà sư, ni cô và khách tham quan tham dự các lễ hội do Giáo hội Phật giáo Hà Nội tổ chức.",
          "Ban đầu, chùa Bà Đá là trụ sở phái Lâm Tế, một trong hai phái Thiền lớn ở Bắc Việt. Ngày nay, chùa là trụ sở chính của Giáo hội Phật giáo Hà Nội và tổ chức Trường Trung học Phật học.",
          "Chùa được xây dựng năm 1056 dưới triều vua Lý Thánh Tông (1460–1497). Trong quá trình tu sửa Thăng Long, người ta phát hiện một pho tượng đá tự nhiên hình người phụ nữ tại làng Bảo Thiên Tự Tháp (nay là khu phố Nhà Thờ). Dân làng lập đền thờ gọi là Đền Bà Đá. Sau này, đền được mở rộng thành chùa lớn, thờ pho tượng Phật, đổi tên thành Chùa Bà Đá, tên chính thức là Linh Quang Tự, nghĩa là 'Chùa ánh sáng thiêng liêng'. Trong thời Tây Sơn tấn công, chùa bị hư hại. Theo ghi chép, năm 1850, chùa được hòa thượng Giác Vương phục hồi và mở rộng thêm.",
          "Thời Pháp thuộc, quy hoạch đô thị làm hỏng pho tượng đá gốc. Một pho tượng Phật Thích Ca bằng đá thay thế được đưa vào. Hiện nay, chùa Bà Đá là văn phòng Giáo hội Phật giáo Hà Nội, trụ trì do trưởng ban chấp hành điều hành thay vì theo truyền thống kế thừa Thiền.",
          "Các trụ trì nổi bật: Hòa thượng Thích Tâm Tịch (1915-2005), trụ trì 1981–2002, và Hòa thượng Thích Thanh Chinh (1919-2009), trụ trì 2002–2008."
        ],
        "image": "ChuaBaDa1"
      },
      {
        "content": [
          "Chùa có 5 gian điện bố trí theo hình chữ 'Nhất', nối với các hành lang tạo thành đại điện Phật lớn. Điện Thượng có 4 gian theo kiểu 'Đình' nối với hậu cung, tạo bố cục hình vuông, đối xứng. Hai hành lang chạy dọc hai bên dẫn đến hậu cung thờ tổ tiên và các vị nữ thần.",
          "Trước Tiền điện có lư hương và đôi đèn đá giữa hai tháp mộ cổ, trang trí hoa sen. Mái được đỡ bởi 4 cột đá xanh chạm khắc tinh xảo.",
          "Bên trong có nhiều pho tượng quý, bao gồm tượng Phật Thích Ca bằng gỗ lớn, hai bên là Anan và Ca Diếp, phía sau có Phật A Di Đà cùng Bồ Tát Quán Thế Âm và Đại Thế Chí. Dù đã cũ, các tượng vẫn giữ vẻ điềm tĩnh, thiền định.",
          "Chùa có hai quả chuông niên đại 1823 và 1881, cùng một chiếc mõ đúc năm 1842. Bên phải sân là văn phòng Trường Trung học Phật học Hà Nội. Bốn tháp mộ đứng đối xứng dọc tường ngoài Điện Thượng."
        ],
        "image": "ChuaBaDa2"
      },
      {
        "content": [
          "Chùa Bà Đá là nơi hành hương linh thiêng cho nhiều Phật tử, đặc biệt vào các ngày lễ và hội Phật, thu hút hàng nghìn khách đến lễ bái và tham quan.",
          "Du khách nên chuẩn bị lễ vật đơn giản nhưng thành tâm, như hoa tươi, trái cây, trầu cau, đồ chay, hoặc bánh lễ, để đặt lên bàn Phật.",
          "Các lễ vật đặc biệt như 'Oan Tài Lộc' thường được chọn vì ý nghĩa tượng trưng, trang nhã và bền lâu, làm tăng tính trang nghiêm của nghi lễ."
        ],
        "image": "ChuaBaDa3"
      }
    ]
  },
  "common": {
    "address": "Địa chỉ",
    "activities": "Hoạt động",
    "Same category": "Cùng danh mục",
    "Travel itinerary": "Lịch trình di chuyển",
    "Date": "Ngày",
    "Price": "Giá",
    "Children": "Trẻ em",
    "Adult": "Người lớn",
    "Age": "Tuổi",
    "Ticket Prices & Services": "Giá vé & Dịch vụ",
    "Policies & Terms": "Chính sách & Điều khoản",
    "Important Notes": "Lưu ý quan trọng",
    "Ratings & Reviews": "Đánh giá & Nhận xét",
    "Service Feedback": "Phản hồi về dịch vụ",
    "Comment": "Bình luận",
    "Submit": "Đăng"
  },
  "Ancient City Tour": {
    "name": "Ancient City Tour",
    "image": "HoChiMinhMausoleum",
    "introduction": "Ancient City Tour – Hành trình khám phá vẻ đẹp cổ kính của thành phố, nơi lưu giữ những di sản văn hóa, kiến trúc và lịch sử qua thời gian. Cùng chiêm ngưỡng những công trình xưa, hòa mình vào nhịp sống truyền thống và cảm nhận hơi thở của quá khứ giữa lòng đô thị hiện đại.",
    "type": "Visit Tour",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ ( Bố mẹ tự chăm sóc cho bé )",
      "Hai người lớn được kèm 1 trẻ em miễn phí ( nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50% )",
      "Trẻ em từ 5 - 8 tuổi tính 75% ( có chỗ ngồi riêng trên xe, suốt ăn riêng, vé thắng cảnh )",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buối chiều Lăng Bác không mở cửa thăm quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn thăm quan bình thường",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào thăm quan chùa Trấn Quốc và Lăng Bác",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc Quý khách có chuyến bay cùng ngày vui lòng báo trước đề được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, Quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân của mình. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 2100000,
      "default": 2800000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, thăm quan phát sinh ngoài chương trình",
          "Tiền típ ( bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục...."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "HoChiMinhMausoleum",
          "OnePillarPagoda",
          "HoanKiemLake1",
          "NgocSonTemple"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:45",
                "end": "08:00",
                "details": "Xe đón tại Khách Sạn để di chuyển ra tham quan Lăng Bác"
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Đoạn di chuyển vào thăm quan Lăng Bác, Quảng Trường Ba Đình , là công trình kiến trúc lịch sử và văn hóa tại Hà Nội."
              },
              {
                "start": "10:00",
                "end": "10:15",
                "details": "Sau khi tham quan xong Lăng Bác và chụp hình lưu niệm đoàn di chuyển ra xe để tới điểm tham quan tiếp theo."
              },
              {
                "start": "10:15",
                "end": "11:30",
                "details": "Đoàn mình di chuyển vào tham quan Chùa Một Cột là ngôi chùa cổ ở Hà Nội, nổi tiếng với kiến trúc độc đáo \"liên hoa đài\" - một điện thờ đặt trên một cột trụ duy nhất, quý khách ngắm cảnh vật nơi đây và chụp hình lưu niệm."
              },
              {
                "start": "11:30",
                "end": "12:00",
                "details": "Đoàn mình lên xe di chuyển về Khách Sạn nghỉ ngơi và ăn uống."
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "14:00",
                "end": "14:30",
                "details": "Xe đón đoàn tại khách sạn và di chuyển ra Hồ Hoàn Kiếm tham quan."
              },
              {
                "start": "14:30",
                "end": "16:15",
                "details": "Đoàn mình tham quan , đi bộ xung quanh Hồ Hoàn Kiếm ngắm cảnh và tận hưởng không khí xung quanh hồ chụp vài bức hình lưu niệm ở đây"
              },
              {
                "start": "16:15",
                "end": "17:00",
                "details": "Đoàn mình thăm quan Đền Ngọc Sơn biểu tượng văn hóa tâm linh nổi tiếng của thủ đô Hà Nội."
              },
              {
                "start": "17:10",
                "details": "Đoàn mình di chuyển lên xe về Khách Sạn nghỉ ngơi và buổi Tối tự do tham quan và mua sắm."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TempleOfLiterature",
          "VietnamMuseumOfEthnology",
          "HoaLoPrison"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Văn Miếu - Quốc Tử Giám , là nhân chứng lịch sử ngàn năm của thủ đô Hà Nội, Quốc Tử Giám còn là ngôi trường “khai sinh” ra rất nhiều nhân tài tuấn kiệt cho đất nước"
              },
              {
                "start": "10:30",
                "end": "12:00",
                "details": "Bảo Tàng Dân Tộc Học,  là nơi để bạn chiêm ngưỡng các tư liệu, hiện vật về văn hóa và lịch sử của 54 dân tộc ở Việt Nam."
              },
              {
                "start": "12:10",
                "end": "14:00",
                "details": "Di chuyển về khách sạn nghỉ ngơi và ăn uống"
              },
              {
                "start": "14:00",
                "end": "16:30",
                "details": "Đoàn mình lên xe di chuyển ra nhà Tù Hỏa Lò , là một là một minh chứng rõ nét cho cả một thời kì lịch sử khổ cực mà gian lao, biểu tượng cho tinh thần bất khuất, kiên cường của những người con Việt Nam yêu nước. Khu di tích vẫn còn trường tồn với thời gian cho đến tận ngày nay tại Hà Nội."
              },
              {
                "start": "17:00",
                "details": "Lên xe về khách sạn nghỉ ngơi , tối quý khách có thể tự do tham quan , hoặc di chuyển ra Phố Đi Bộ"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "DongXuanMarket"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Dạo 36 phố phường, Chợ Đồng Xuân , tự do tham quan và mua sắm các món quà lưu niệm"
              },
              {
                "start": "12:30",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "14:00",
                "details": "Quý Khách lên xe di chuyển về Khách Sạn và kết thúc tour"
              }
            ]
          }
        ]
      }
    ]
  },
  "Culture And Spiritual": {
    "name": "Culture And Spiritual",
    "introduction": "Culture and Spiritual Tour – Hành trình khám phá văn hóa và tâm linh đặc sắc, đưa bạn đến với những ngôi đền, chùa cổ kính, trải nghiệm phong tục truyền thống và tìm về sự bình yên trong tâm hồn giữa không gian linh thiêng đậm đà bản sắc dân tộc.",
    "type": "Visit Tour",
    "image": "WestLake",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ ( Bố mẹ tự chăm sóc cho bé )",
      "Hai người lớn được kèm 1 trẻ em miễn phí ( nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50% )",
      "Trẻ em từ 5 - 8 tuổi tính 75% ( có chỗ ngồi riêng trên xe, suốt ăn riêng, vé thắng cảnh )",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buối chiều Lăng Bác không mở cửa thăm quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn thăm quan bình thường",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào thăm quan chùa Trấn Quốc và Lăng Bác",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc Quý khách có chuyến bay cùng ngày vui lòng báo trước đề được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, Quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân của mình. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 2175000,
      "default": 2900000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, thăm quan phát sinh ngoài chương trình",
          "Tiền típ ( bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục...."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "HoChiMinhMausoleum1",
          "OnePillarPagoda2",
          "HoanKiemLake2"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "end": "07:45",
                "details": "Xe đón đoàn tại Khách Sạn"
              },
              {
                "start": "07:45",
                "end": "09:00",
                "details": "Di chuyển đến Lăng Bác biểu tượng của dân tộc Việt Nam, tham quan Lăng Bác chụp ảnh lưu niệm tại nơi đây"
              },
              {
                "start": "09:15",
                "end": "11:00",
                "details": "Đoàn ra xe di chuyển đến Chùa Một Cột , ngôi chùa nét cổ kính , cảm giác như một bông sen đang nở rộ"
              },
              {
                "start": "11:30",
                "end": "13:00",
                "details": "Ăn trưa , và nghỉ ngơi tại Khách Sạn"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "14:00",
                "end": "15:30",
                "details": "Di chuyển đến Hồ Hoàn Kiếm hồ trung tâm với Tháp Rùa, đi bộ tham quan Hồ Hoàn Kiếm hít thở không khí trong lành và tận hượng vẻ đẹp của hồ và tham qua Đền Ngọc Sơn đền thờ học giả cổ"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Dạo phố cổ , hoặc tự do tham quan , mua sắm"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TranQuocPagoda",
          "TempleOfLiterature1",
          "QuanSuPagoda"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "09:30",
                "details": "Xe đón đoàn mình và di chuyển đến Chùa Trấn Quốc chùa cổ nhất Hà Nội bên Hồ Tây , tham quan ngôi chùa"
              },
              {
                "start": "10:00",
                "end": "11:30",
                "details": "Đoàn mình di chuyển đến Văn Miếu di tích giáo dục cổ của Hà Nội , tham quan Văn Miếu và chụp hình lưu niệm nơi đây"
              },
              {
                "start": "12:00",
                "end": "14:00",
                "details": "Ăn trưa và nghỉ ngơi tại Khách Sạn"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "14:15",
                "end": "16:30",
                "details": "Di chuyển đến Chùa Quán Sứ trung tâm Phật giáo miền Bắc , tham quan chùa"
              },
              {
                "start": "17:00",
                "details": "Đoàn lên xe di chuyển về khách sạn nghỉ ngơi , tối khách tự do tham quan"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "Hanoi36Streets"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Dạo 36 phố phường, tự do tham quan và mua sắm các món quà lưu niệm"
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa nghỉ ngơi và Check Out Khách Sạn"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:00",
                "end": "16:00",
                "details": "Mua sắm"
              }
            ]
          }
        ]
      }
    ]
  },
  "Premium And Night": {
    "name": "Premium And Night",
    "introduction": "Premium And Night mang đến cho du khách trải nghiệm buổi tối độc đáo kết hợp giữa sự sang trọng, văn hóa và giải trí. Tận hưởng nhịp sống sôi động về đêm của thành phố, ẩm thực tinh tế và các dịch vụ cao cấp trong không khí khó quên.",
    "type": "Visit Tour",
    "image": "HaNoiFestival",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ ( Bố mẹ tự chăm sóc cho bé )",
      "Hai người lớn được kèm 1 trẻ em miễn phí ( nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50% )",
      "Trẻ em từ 5 - 8 tuổi tính 75% ( có chỗ ngồi riêng trên xe, suất ăn riêng, vé thắng cảnh )",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buổi chiều Lăng Bác không mở cửa tham quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn tham quan bình thường.",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào tham quan chùa Trấn Quốc và Lăng Bác.",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc có chuyến bay cùng ngày vui lòng báo trước để được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch.",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 2400000,
      "default": 3200000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, tham quan phát sinh ngoài chương trình.",
          "Tiền típ (bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục vụ..."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "HoChiMinhMausoleum2",
          "OnePillarPagoda3",
          "HoanKiemLake3"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "end": "07:45",
                "details": "Xe đón."
              },
              {
                "start": "07:45",
                "end": "09:00",
                "details": "Di chuyển đến Lăng Bác (nơi tưởng niệm lãnh tụ), tham quan Lăng Bác và Chùa Một Cột (chùa cổ)."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi."
              },
              {
                "start": "13:30",
                "end": "15:30",
                "details": "Di chuyển đến Hồ Hoàn Kiếm (hồ biểu tượng), tham quan hồ."
              },
              {
                "start": "16:00",
                "end": "18:00",
                "details": "Nghỉ ngơi, ăn uống để hoạt động tối."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Xem múa rối nước tại Hồ Hoàn Kiếm (văn hóa truyền thống)."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TempleOfLiterature1",
          "HoChiMinhMuseum"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Di chuyển đến Văn Miếu (trường cổ), tham quan Văn Miếu và Bảo tàng Hồ Chí Minh (bảo tàng về Bác)."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi."
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "18:00",
                "end": "20:00",
                "details": "Show 3D Mapping tại Văn Miếu."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "Hanoi36Streets1"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Dạo 36 phố phường, tự do tham quan và mua sắm các món quà lưu niệm."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa fusion, nghỉ ngơi và check-in."
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Di chuyển đến Vincom Center (trung tâm thương mại cao cấp), mua sắm."
              }
            ]
          }
        ]
      }
    ]
  },
  "Vacation And Relax": {
    "name": "Vacation And Relax",
    "type": "Vacation Tour",
    "introduction": "Vacation And Relax là kỳ nghỉ hoàn hảo dành cho những ai tìm kiếm sự yên bình và thoải mái. Tận hưởng khung cảnh thanh bình, các hoạt động nhẹ nhàng và những khoảnh khắc thư giãn giúp làm mới cơ thể và tâm trí.",
    "image": "WestLake1",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ (Bố mẹ tự chăm sóc cho bé).",
      "Hai người lớn được kèm 1 trẻ em miễn phí (nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50%).",
      "Trẻ em từ 5 - 8 tuổi tính 75% (có chỗ ngồi riêng trên xe, suất ăn riêng, vé thắng cảnh).",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buổi chiều Lăng Bác không mở cửa tham quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn tham quan bình thường.",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào tham quan chùa Trấn Quốc và Lăng Bác.",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc có chuyến bay cùng ngày vui lòng báo trước để được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch.",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 2625000,
      "default": 3600000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, tham quan phát sinh ngoài chương trình.",
          "Tiền típ (bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục vụ..."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "WestLake1"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "details": "Xe đón tại khách sạn trung tâm."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Di chuyển đến Hồ Tây (hồ lớn nhất Hà Nội, không gian xanh yên bình), check-in khách sạn ven hồ, thư giãn."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi."
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Spa massage thư giãn (1 giờ)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Dạo hồ bằng xe đạp, ăn tối nhẹ."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TranQuocPagoda"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Di chuyển đến Chùa Trấn Quốc (chùa cổ bên hồ, nơi cầu bình an), tham quan nhẹ nhàng."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa chay và nghỉ ngơi."
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Tham gia lớp học Yoga hoặc Thiền (1 giờ)."
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Thưởng thức trà đạo và đọc sách tại quán cà phê ven hồ."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HotelImage"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "11:00",
                "details": "Thư giãn tại khách sạn, spa cuối."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi."
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Mua sắm nhẹ nhàng tại Vincom Plaza (trung tâm thương mại cao cấp)."
              },
              {
                "start": "16:30",
                "details": "Kết thúc tour, xe đưa về khách sạn hoặc sân bay."
              }
            ]
          }
        ]
      }
    ]
  },
  "Spa And Relax Ancient Town": {
    "name": "Spa And Relax Ancient Town",
    "image": "BoutiqueHotel",
    "introduction": "Spa And Relax Ancient Town mang đến một nơi nghỉ dưỡng yên tĩnh ngay giữa lòng phố cổ. Hãy đắm mình trong các liệu pháp spa truyền thống, không gian thư giãn và nét quyến rũ cổ kính của những con phố xưa.",
    "type": "Vacation Tour",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ ( Bố mẹ tự chăm sóc cho bé )",
      "Hai người lớn được kèm 1 trẻ em miễn phí ( nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50% )",
      "Trẻ em từ 5 - 8 tuổi tính 75% ( có chỗ ngồi riêng trên xe, suốt ăn riêng, vé thắng cảnh )",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buối chiều Lăng Bác không mở cửa thăm quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn thăm quan bình thường",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào thăm quan chùa Trấn Quốc và Lăng Bác",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc Quý khách có chuyến bay cùng ngày vui lòng báo trước đề được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, Quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân của mình. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 2625000,
      "default": 3600000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, thăm quan phát sinh ngoài chương trình",
          "Tiền típ ( bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục...."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "Hanoi36Streets"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "details": "Xe đón."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Di chuyển đến 36 Phố Phường (khu phố cổ sôi động nhưng yên tĩnh buổi sáng), check-in khách sạn boutique."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Spa massage thư giãn thảo dược (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Dạo phố cổ, ăn tối nhẹ"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HoanKiemLake1"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Di chuyển đến Hồ Hoàn Kiếm (hồ biểu tượng), tham quan nhẹ nhàng và chụp ảnh lưu niệm."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa chay và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Tham gia lớp học nấu ăn món Việt (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Thưởng thức cà phê trứng tại quán cà phê cổ nổi tiếng"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HotelImage"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "11:00",
                "details": "Thư giãn khách sạn, spa cuối"
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Mua sắm nhẹ nhàng tại Vincom Plaza (trung tâm thương mại cao cấp)"
              },
              {
                "start": "16:30",
                "details": "Kết thúc tour, xe đưa về khách sạn hoặc sân bay"
              }
            ]
          }
        ]
      }
    ]
  },
  "Hoan Kiem Lake Family Resort": {
    "name": "Hoan Kiem Lake Family Resort",
    "image": "HoanKiemLake1",
    "introduction": "Hoan Kiem Lake Family Resort là điểm đến lý tưởng cho các gia đình mong muốn nghỉ ngơi và vui chơi. Tận hưởng những giây phút thư giãn bên hồ, tham gia các hoạt động thân thiện với gia đình và đắm chìm trong không khí yên bình giữa lòng thành phố.",
    "type": "Vacation Tour",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ ( Bố mẹ tự chăm sóc cho bé )",
      "Hai người lớn được kèm 1 trẻ em miễn phí ( nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50% )",
      "Trẻ em từ 5 - 8 tuổi tính 75% ( có chỗ ngồi riêng trên xe, suốt ăn riêng, vé thắng cảnh )",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buối chiều Lăng Bác không mở cửa thăm quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn thăm quan bình thường",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào thăm quan chùa Trấn Quốc và Lăng Bác",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc Quý khách có chuyến bay cùng ngày vui lòng báo trước đề được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, Quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân của mình. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 2400000,
      "default": 3200000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, thăm quan phát sinh ngoài chương trình",
          "Tiền típ ( bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục...."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "HoanKiemLake1"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "details": "Xe đón."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Di chuyển đến Hồ Hoàn Kiếm (hồ biểu tượng), check-in khách sạn ven hồ, thư giãn."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Chơi trò chơi gia đình quanh hồ hoặc spa massage thư giãn (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Dạo hồ bằng xe đạp, ăn tối nhẹ"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "NgocSonTemple"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Tham quan nhẹ nhàng Hồ Hoàn Kiếm và Đền Ngọc Sơn (đền thờ học giả cổ)"
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa chay và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Tham gia lớp học nấu ăn món Việt cho cả gia đình (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Thưởng thức cà phê trứng tại quán cà phê cổ nổi tiếng"
              }
            ]
          }
        ]
      }
    ]
  },
  "Luxury West Lake Resort": {
    "name": "Luxury West Lake Resort",
    "type": "Vacation Tour",
    "introduction": "Luxury West Lake Resort mang đến một kỳ nghỉ sang trọng bên hồ Tây thanh bình. Trải nghiệm tiện nghi cao cấp, khung cảnh tuyệt đẹp và dịch vụ tinh tế cho một kỳ lưu trú thật đẳng cấp.",
    "image": "WestLake1",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ ( Bố mẹ tự chăm sóc cho bé )",
      "Hai người lớn được kèm 1 trẻ em miễn phí ( nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50% )",
      "Trẻ em từ 5 - 8 tuổi tính 75% ( có chỗ ngồi riêng trên xe, suốt ăn riêng, vé thắng cảnh )",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buối chiều Lăng Bác không mở cửa thăm quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn thăm quan bình thường",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào thăm quan chùa Trấn Quốc và Lăng Bác",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc Quý khách có chuyến bay cùng ngày vui lòng báo trước đề được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, Quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân của mình. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 4125000,
      "default": 5500000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, thăm quan phát sinh ngoài chương trình",
          "Tiền típ ( bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục...."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "WestLake1"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "details": "Xe đón."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Di chuyển đến Hồ Tây (hồ lớn nhất Hà Nội, không gian xanh yên bình), check-in khách sạn ven hồ, thư giãn."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Spa massage thư giãn thảo dược (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Dạo hồ bằng xe đạp, ăn tối nhẹ"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "TranQuocPagoda"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Di chuyển đến Chùa Trấn Quốc (chùa cổ bên hồ, nơi cầu bình an), tham quan chùa."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa chay và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Tham gia lớp học Yoga hoặc Thiền (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Thưởng thức trà đạo và đọc sách tại quán cà phê ven hồ"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HotelImage2"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "11:00",
                "details": "Thư giãn khách sạn, spa cuối"
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Mua sắm nhẹ nhàng tại Vincom Plaza (trung tâm thương mại cao cấp)"
              },
              {
                "start": "16:30",
                "details": "Kết thúc tour, xe đưa về khách sạn hoặc sân bay"
              }
            ]
          }
        ]
      }
    ]
  },
  "Relax Spa Old Quarter And Hoan Kiem Lake": {
    "name": "Relax Spa Old Quarter And Hoan Kiem Lake",
    "type": "Vacation Tour",
    "introduction": "Relax Spa Old Quarter And Hoan Kiem Lake là sự kết hợp hoàn hảo giữa sự thư giãn và nét truyền thống. Tận hưởng các liệu pháp spa phục hồi năng lượng trong khi khám phá vẻ đẹp cổ kính của Phố Cổ và nét yên bình của Hồ Hoàn Kiếm.",
    "image": "Hanoi36Streets",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ ( Bố mẹ tự chăm sóc cho bé )",
      "Hai người lớn được kèm 1 trẻ em miễn phí ( nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50% )",
      "Trẻ em từ 5 - 8 tuổi tính 75% ( có chỗ ngồi riêng trên xe, suốt ăn riêng, vé thắng cảnh )",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buối chiều Lăng Bác không mở cửa thăm quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn thăm quan bình thường",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào thăm quan chùa Trấn Quốc và Lăng Bác",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc Quý khách có chuyến bay cùng ngày vui lòng báo trước đề được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, Quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân của mình. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 3600000,
      "default": 4800000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, thăm quan phát sinh ngoài chương trình",
          "Tiền típ ( bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục...."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "Hanoi36Streets"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "details": "Xe đón tại khách sạn trung tâm."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Di chuyển đến 36 Phố Phường (khu phố cổ sôi động nhưng yên tĩnh buổi sáng), check-in khách sạn boutique."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Spa massage thư giãn thảo dược (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Dạo phố cổ, ăn tối nhẹ"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HoanKiemLake1"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Di chuyển đến Hồ Hoàn Kiếm (hồ biểu tượng), tham quan nhẹ nhàng và chụp ảnh lưu niệm."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa chay và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Tham gia lớp học nấu ăn món Việt cho cả gia đình (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Thưởng thức cà phê trứng tại quán cà phê cổ nổi tiếng"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "NgocSonTemple"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "12:00",
                "details": "Tham quan nhẹ nhàng Hồ Hoàn Kiếm và Đền Ngọc Sơn (đền thờ học giả cổ)"
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa chay và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Tham gia lớp học nấu ăn món Việt cho cả gia đình (1 giờ)"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Thưởng thức cà phê trứng tại quán cà phê cổ nổi tiếng"
              }
            ]
          }
        ]
      },
      {
        "image": [
          "HotelImage"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "08:00",
                "end": "11:00",
                "details": "Thư giãn khách sạn, spa cuối"
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "16:00",
                "details": "Mua sắm nhẹ nhàng tại Vincom Plaza (trung tâm thương mại cao cấp)"
              },
              {
                "start": "16:30",
                "details": "Kết thúc tour, xe đưa về khách sạn hoặc sân bay"
              }
            ]
          }
        ]
      }
    ]
  },
  "Spiritual And Cultural Retreat": {
    "name": "Spiritual And Cultural Retreat",
    "image": "OnePillarPagoda",
    "introduction": "Spiritual And Cultural Retreat mời bạn khám phá sự bình an nội tâm và nét phong phú của văn hóa. Trải nghiệm những địa điểm linh thiêng, phong tục địa phương và những khoảnh khắc chiêm nghiệm giúp nuôi dưỡng tâm hồn và trí tuệ.",
    "type": "Vacation Tour",
    "policy": [
      "Trẻ em từ 1 - 4 tuổi: Miễn phí dịch vụ ( Bố mẹ tự chăm sóc cho bé )",
      "Hai người lớn được kèm 1 trẻ em miễn phí ( nếu có trẻ em thứ 2 dưới 4 tuổi phụ thu 50% )",
      "Trẻ em từ 5 - 8 tuổi tính 75% ( có chỗ ngồi riêng trên xe, suốt ăn riêng, vé thắng cảnh )",
      "Trẻ em từ 9 tuổi trở lên tính 100% giá tour như người lớn."
    ],
    "notes": [
      "Thứ 2, thứ 6 hàng tuần và các buối chiều Lăng Bác không mở cửa thăm quan nhưng các điểm khu vực bên ngoài Lăng Bác vẫn thăm quan bình thường",
      "Quý khách nên mang theo trang phục lịch sự, mặc quần dài hoặc váy dài qua đầu gối khi vào thăm quan chùa Trấn Quốc và Lăng Bác",
      "Quý khách có chế độ ăn kiêng, ăn chay hoặc Quý khách có chuyến bay cùng ngày vui lòng báo trước đề được nhân viên tư vấn và sắp xếp thời gian hợp lý.",
      "Quý khách cung cấp đầy đủ thông tin họ và tên, năm sinh, giới tính, Quốc tịch trước ngày khởi hành để được mua bảo hiểm du lịch",
      "Trước khi xuống xe, nên kiểm tra hành lý tư trang cá nhân của mình. Công ty không chịu trách nhiệm bồi hoàn nếu Quý khách bị mất hoặc thất lạc tài sản cá nhân."
    ],
    "price": {
      "child": 2625000,
      "default": 3600000,
      "extend": {
        "title": "Không bao gồm:",
        "content": [
          "Thuế VAT.",
          "Vé tham quan, vé xe điện.",
          "Đồ uống tự gọi trong bữa ăn, thăm quan phát sinh ngoài chương trình",
          "Tiền típ ( bồi dưỡng) cho hướng dẫn viên, lái xe, nhân viên phục...."
        ]
      }
    },
    "schedules": [
      {
        "image": [
          "TempleOfLiterature",
          "HoChiMinhMuseum"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "details": "Xe đón tại khách sạn trung tâm."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Di chuyển đến Văn Miếu (trường cổ), tham quan Văn Miếu và Bảo tàng Hồ Chí Minh (bảo tàng về Bác)."
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "18:00",
                "end": "20:00",
                "details": "Show 3D Mapping tại Văn Miếu."
              }
            ]
          }
        ]
      },
      {
        "image": [
          "OnePillarPagoda",
          "HoChiMinhMausoleum2"
        ],
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:30",
                "details": "Xe đón tại khách sạn trung tâm."
              },
              {
                "start": "08:00",
                "end": "10:00",
                "details": "Di chuyển đến Lăng Bác (nơi tưởng niệm lãnh tụ), tham quan Lăng Bác và Chùa Một Cột (chùa cổ)"
              },
              {
                "start": "12:00",
                "end": "13:00",
                "details": "Ăn trưa và nghỉ ngơi"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "15:30",
                "details": "Di chuyển đến Hồ Hoàn Kiếm (hồ biểu tượng), tham quan hồ"
              },
              {
                "start": "16:00",
                "end": "18:00",
                "details": "Nghỉ ngơi ăn uống để hoạt động tối"
              },
              {
                "start": "19:00",
                "end": "21:00",
                "details": "Xem múa rối nước tại hồ Hoàn Kiếm (văn hóa truyền thống)"
              }
            ]
          }
        ]
      }
    ]
  },
  "Traditional Hanoi Cuisine": {
    "name": "Traditional Hanoi Cuisine",
    "image": "CuisineList",
    "introduction": "Traditional Hanoi Cuisine mang đến hương vị đậm đà của di sản ẩm thực Thủ đô. Thưởng thức những món ăn truyền thống, nguyên liệu địa phương và công thức lâu đời phản ánh tinh hoa văn hóa Hà Nội.",
    "type": "Cuisine Tour",
    "notes": [
      "Mang giày thể thao/dép thấp để dễ đi bộ trên phố cổ",
      "Báo trước nếu có chế độ ăn kiêng/ăn chay/dị ứng thực phẩm.",
      "Chuẩn bị tiền mặt nhỏ (10.000 – 50.000 VNĐ) để mua thêm món ăn.",
      "Chuẩn bị ô/nón chống nắng hoặc áo mưa mỏng tùy thời tiết."
    ],
    "policy": [
      "Trẻ em 1 – 4 tuổi: miễn phí dịch vụ (bố mẹ tự lo)",
      "Hai người lớn được kèm 1 trẻ em miễn phí, trẻ thứ 2 dưới 4 tuổi phụ thu 50%",
      "Trẻ em 5 – 8 tuổi: tính 75% giá tour (có chỗ ngồi, suất ăn riêng)",
      "Trẻ em từ 9 tuổi: tính 100% giá tour như người lớn"
    ],
    "price": {
      "extend": {
        "title": "Không bao gồm",
        "content": [
          "Thuế VAT.",
          "Đồ uống tự gọi ngoài chương trình",
          "Chi phí phát sinh không nằm trong lịch trình",
          "Tiền tip cho HDV, lái xe, nhân viên phục vụ"
        ]
      },
      "services": {
        "title": "Dịch vụ bao gồm :",
        "content": [
          "Xe du lịch vận chuyển đưa đón theo chương trình.",
          "Hướng dẫn viên song ngữ Anh – Việt",
          "Vé trải nghiệm/ăn thử tại các điểm (6 – 7 món ăn)",
          "01 bữa chính (bún chả hoặc phở) kèm đồ uống nhẹ",
          "Bảo hiểm du lịch trọn gói (mức bồi thường tối đa 20 triệu).",
          "Nước uống Dasani 350ml/khách/ngày"
        ]
      }
    },
    "schedules": [
      {
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:45",
                "end": "08:30",
                "details": "Xe và HDV đón khách tại khách sạn khu vực Phố Cổ – Nhà Hát Lớn."
              },
              {
                "start": "08:45",
                "end": "09:30",
                "details": "Ăn sáng với phở bò/gà truyền thống – món ăn quốc hồn quốc túy"
              },
              {
                "start": "09:45",
                "end": "10:15",
                "details": "Dạo phố cổ, thưởng thức bánh cuốn Thanh Trì nóng hổi."
              },
              {
                "start": "10:30",
                "end": "11:15",
                "details": "Tham quan chợ Đồng Xuân, thưởng thức chè long nhãn hạt sen."
              },
              {
                "start": "11:30",
                "end": "12:30",
                "details": "Ăn trưa với bún chả Hà Nội, nem rán vàng giòn"
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "12:45",
                "end": "13:30",
                "details": "Thưởng thức cà phê trứng tại quán cổ truyền phố Nguyễn Hữu Huân"
              },
              {
                "start": "13:45",
                "end": "14:30",
                "details": "Tham quan chợ Hàng Da, thưởng thức bánh tôm Hồ Tây"
              },
              {
                "start": "14:45",
                "end": "15:30",
                "details": "Thưởng thức bánh mì Việt Nam với pate, chả lụa, rau thơm."
              },
              {
                "start": "15:45",
                "end": "16:30",
                "details": "Thư giãn bên Hồ Hoàn Kiếm, nhâm nhi trà chén vỉa hè"
              },
              {
                "start": "16:45",
                "details": "Kết thúc tour, đưa khách về điểm đón ban đầu"
              }
            ]
          }
        ]
      }
    ]
  },
  "Night Cuisine of Hanoi Old Quarter": {
    "name": "Night Cuisine of Hanoi Old Quarter",
    "type": "Cuisine Tour",
    "introduction": "Night Cuisine of Hanoi Old Quarter đưa bạn vào hành trình khám phá hương vị đêm sôi động của thành phố. Dạo qua các quán ăn đường phố tấp nập, thưởng thức món ngon truyền thống và cảm nhận bầu không khí náo nhiệt giữa lòng Phố Cổ Hà Nội về đêm.",
    "image": "MarketActivities",
    "notes": [
      "Mang giày thể thao/dép thấp để dễ đi bộ trên phố cổ",
      "Báo trước nếu có chế độ ăn kiêng/ăn chay/dị ứng thực phẩm.",
      "Chuẩn bị tiền mặt nhỏ (10.000 – 50.000 VNĐ) để mua thêm món ăn.",
      "Chuẩn bị ô/nón chống nắng hoặc áo mưa mỏng tùy thời tiết."
    ],
    "policy": [
      "Trẻ em 1 – 4 tuổi: miễn phí dịch vụ (bố mẹ tự lo)",
      "Hai người lớn được kèm 1 trẻ em miễn phí, trẻ thứ 2 dưới 4 tuổi phụ thu 50%",
      "Trẻ em 5 – 8 tuổi: tính 75% giá tour (có chỗ ngồi, suất ăn riêng)",
      "Trẻ em từ 9 tuổi: tính 100% giá tour như người lớn"
    ],
    "price": {
      "extend": {
        "title": "Dịch vụ bao gồm",
        "content": [
          "Thuế VAT.",
          "Đồ uống tự gọi ngoài chương trình",
          "Chi phí phát sinh không nằm trong lịch trình",
          "Tiền tip cho HDV, lái xe, nhân viên phục vụ"
        ]
      },
      "services": {
        "title": "Dịch vụ bao gồm :",
        "content": [
          "Xe du lịch vận chuyển đưa đón theo chương trình.",
          "Hướng dẫn viên song ngữ Anh – Việt",
          "Vé trải nghiệm/ăn thử tại các điểm (6 – 7 món ăn)",
          "01 bữa chính (bún chả hoặc phở) kèm đồ uống nhẹ",
          "Bảo hiểm du lịch trọn gói (mức bồi thường tối đa 20 triệu).",
          "Nước uống Dasani 350ml/khách/ngày"
        ]
      }
    },
    "schedules": [
      {
        "schedule": [
          {
            "time": [
              {
                "start": "17:30",
                "end": "18:00",
                "details": "HDV đón khách tại khách sạn, khởi đầu hành trình ẩm thực đêm."
              },
              {
                "start": "18:15",
                "end": "18:45",
                "details": "Thưởng thức bún thang Hà Nội tại 11 Hàng Hòm, món ăn cầu kỳ với hơn 20 nguyên liệu."
              },
              {
                "start": "19:00",
                "end": "19:30",
                "details": "Dạo phố Tạ Hiện, thưởng thức nem chua rán, khoai tây chiên, ngô chiên kèm bia hơi"
              },
              {
                "start": "19:45",
                "end": "20:15",
                "details": "Thưởng thức xôi xéo lá sen tại phố Hàng Gà."
              },
              {
                "start": "20:30",
                "end": "21:00",
                "details": "Thưởng thức ốc luộc, ngao hấp sả tại phố Đinh Liệt."
              },
              {
                "start": "21:15",
                "end": "21:45",
                "details": "Đi chợ đêm Hàng Ngang – Hàng Đào, thưởng thức kem Tràng Tiền hoặc kem xôi dừa"
              },
              {
                "start": "22:00",
                "details": "Nhâm nhi trà chanh Nhà Thờ Lớn, hòa vào không khí sôi động."
              },
              {
                "start": "22:30",
                "details": "Kết thúc chương trình, đưa khách về khách sạn"
              }
            ]
          }
        ]
      }
    ]
  },
  "3 Days 2 Nights Hanoi Culinary Journey": {
    "name": "3 Days 2 Nights Hanoi Culinary Journey",
    "type": "Cuisine Tour",
    "introduction": "3 Days 2 Nights Hanoi Culinary Journey mang đến hành trình 3 ngày 2 đêm khám phá tinh hoa ẩm thực Việt Nam. Trải nghiệm các món ăn địa phương đặc sắc, tham quan chợ truyền thống và tham gia lớp học nấu ăn để cảm nhận trọn vẹn hương vị Hà Nội.",
    "image": "LongTour",
    "notes": [
      "Mang giày thể thao/dép thấp để dễ đi bộ trên phố cổ",
      "Báo trước nếu có chế độ ăn kiêng/ăn chay/dị ứng thực phẩm.",
      "Chuẩn bị tiền mặt nhỏ (10.000 – 50.000 VNĐ) để mua thêm món ăn.",
      "Chuẩn bị ô/nón chống nắng hoặc áo mưa mỏng tùy thời tiết."
    ],
    "policy": [
      "Trẻ em 1 – 4 tuổi: miễn phí dịch vụ (bố mẹ tự lo)",
      "Hai người lớn được kèm 1 trẻ em miễn phí, trẻ thứ 2 dưới 4 tuổi phụ thu 50%",
      "Trẻ em 5 – 8 tuổi: tính 75% giá tour (có chỗ ngồi, suất ăn riêng)",
      "Trẻ em từ 9 tuổi: tính 100% giá tour như người lớn"
    ],
    "price": {
      "extend": {
        "title": "Dịch vụ bao gồm",
        "content": [
          "Thuế VAT.",
          "Đồ uống tự gọi ngoài chương trình",
          "Chi phí phát sinh không nằm trong lịch trình",
          "Tiền tip cho HDV, lái xe, nhân viên phục vụ"
        ]
      },
      "services": {
        "title": "Dịch vụ bao gồm:",
        "content": [
          "Xe du lịch vận chuyển đưa đón theo chương trình.",
          "Hướng dẫn viên song ngữ Anh – Việt",
          "Vé trải nghiệm/ăn thử tại các điểm (6 – 7 món ăn)",
          "01 bữa chính (bún chả hoặc phở) kèm đồ uống nhẹ",
          "Bảo hiểm du lịch trọn gói (mức bồi thường tối đa 20 triệu).",
          "Nước uống Dasani 350ml/khách/ngày"
        ]
      }
    },
    "schedules": [
      {
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:45",
                "end": "08:15",
                "details": "Xe và HDV đón Quý khách tại khách sạn khu vực Phố Cổ/ Nhà Hát Lớn"
              },
              {
                "start": "08:30",
                "end": "09:15",
                "details": "Tham quan Chợ Đồng Xuân, tìm hiểu nguyên liệu tươi ngon phục vụ cho phở, bún chả, nem rán."
              },
              {
                "start": "09:30",
                "end": "10:15",
                "details": "Quý khách có thể thưởng thức thêm Phở bò/gà gia truyền, tìm hiểu lịch sử và sự biến tấu của món ăn quốc hồn quốc túy."
              },
              {
                "start": "10:30",
                "end": "11:00",
                "details": "Nghỉ tại quán cà phê lâu đời, trải nghiệm cà phê trứng – đặc sản độc đáo chỉ có ở Hà Nội."
              },
              {
                "start": "11:15",
                "end": "12:15",
                "details": "Thưởng thức bún chả Hà Nội tại quán nổi tiếng từng đón Tổng thống Obama"
              },
              {
                "start": "12:30",
                "end": "13:30",
                "details": "Ăn trưa tại nhà hàng: chả cá Lã Vọng, nem rán, canh măng vịt, rau muống xào tỏi."
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "14:00",
                "end": "15:00",
                "details": "Quý khách trải nghiệm làm bánh cuốn Thanh Trì – nghệ nhân hướng dẫn, du khách tự tay tráng bánh."
              },
              {
                "start": "15:15",
                "end": "16:30",
                "details": "Đi bộ khám phá phố cổ 36 phố phường, thưởng thức quà vặt: bánh gối, bánh rán, nem chua rán, chè xoài."
              },
              {
                "start": "17:00",
                "end": "18:00",
                "details": "Tham quan Hồ Hoàn Kiếm, dừng chân ăn Kem Tràng Tiền."
              },
              {
                "start": "18:30",
                "end": "20:00",
                "details": "Ăn tối với các món dân dã: lẩu riêu cua, bánh tôm Hồ Tây, cháo sườn Hàng Bồ."
              },
              {
                "start": "20:30",
                "end": "21:30",
                "details": "Tự do dạo chợ đêm Phố Cổ. Nghỉ đêm khách sạn 3* trung tâm."
              }
            ]
          }
        ]
      },
      {
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:00",
                "end": "08:00",
                "details": "Ăn sáng với bánh mì pate + cà phê."
              },
              {
                "start": "08:30",
                "end": "09:30",
                "details": "Khởi hành đi làng gốm Bát Tràng. Trải nghiệm nặn gốm, tham quan chợ gốm, ăn vặt bánh tẻ, bánh sắn nướng."
              },
              {
                "start": "11:00",
                "end": "12:30",
                "details": "Tham quan làng cổ Đường Lâm: đình cổ, giếng làng, nhà đá ong. Ăn trưa với các món đặc sản: gà mía, cá kho tương, rau luộc chấm tương, chè lam, kẹo dồi."
              },
              {
                "start": "14:00",
                "end": "16:00",
                "details": "Tham gia lớp học nấu ăn cùng đầu bếp Hà Nội. Du khách tự tay chế biến phở/bún chả/nem rán và thưởng thức thành quả."
              },
              {
                "start": "17:00",
                "end": "18:30",
                "details": "Về khách sạn nghỉ ngơi."
              },
              {
                "start": "21:00",
                "end": "23:00",
                "details": "Trải nghiệm chợ đầu mối Long Biên – nơi nhộn nhịp nhất Hà Nội về đêm. Thưởng thức chè nóng, bánh giò, xôi lạc, ngô nướng ngay tại chợ. Nghỉ đêm khách sạn"
              }
            ]
          }
        ]
      },
      {
        "schedule": [
          {
            "section": "Buổi sáng",
            "time": [
              {
                "start": "07:00",
                "end": "08:00",
                "details": "Ăn sáng với bún ốc Hồ Tây – món dân dã nổi tiếng của người Hà Nội."
              },
              {
                "start": "08:30",
                "end": "10:30",
                "details": "Tham quan làng cốm Vòng (Cầu Giấy). Tìm hiểu cách làm cốm, tự tay giã cốm và thưởng thức cốm tươi, bánh cốm, chè cốm."
              },
              {
                "start": "11:00",
                "end": "12:30",
                "details": "Ăn trưa tại nhà hàng: bún thang, chả rươi, canh cá rô, chè sen long nhãn."
              }
            ]
          },
          {
            "section": "Buổi chiều",
            "time": [
              {
                "start": "13:30",
                "end": "14:30",
                "details": "Ghé thăm nhà tù Hỏa Lò, nghe kể về những câu chuyện lịch sử gắn với Hà Nội xưa."
              },
              {
                "start": "15:00",
                "end": "16:00",
                "details": "Mua quà đặc sản về nhà: ô mai Hàng Đường, trà sen Hồ Tây, bánh cốm Nguyên Ninh"
              },
              {
                "start": "16:30",
                "details": "Xe đưa đoàn về điểm đón ban đầu. Kết thúc chương trình."
              }
            ]
          }
        ]
      }
    ]
  },
  "Cultural Heritage": {
    "Cultural Heritage": "Di sản văn hóa",
    "The place where national pride takes flight": "Nơi niềm tự hào Tổ quốc bay xa",
    "Local Cultural Events": "SỰ KIỆN VĂN HOÁ ĐỊA PHƯƠNG",
    "Local Cultural": "VĂN HOÁ ĐỊA PHƯƠNG",
    "detail": "Có một ngôi làng mà bước chân tới là thấy niềm tự hào dân tộc hiện diện khắp nơi bởi từ đây những lá cờ Tổ quốc được làm ra và tỏa đi khắp đất nước.",
    "The Keeper of the River’s Soul": "Người giữ hồn sông nước",
    "Hearing the River Tell Its Tales": "Nghe dòng sông kể chuyện",
    "Journey to the Land of Agarwood to Savor the Taste of Nem": "Tìm về xứ Trầm thưởng thức vị nem",
    "Hanoi Recognized with Nine More National Intangible Cultural Heritages": "Hà Nội có thêm 9 di sản văn hóa phi vật thể quốc gia",
    "Heritage": "DI SẢN",
    "Back to Trà Lộc Wetland": "Về Trà Lộc phá trằm",
    "Xu Xoa – The Refreshing Sweet Jelly of Central Vietnam": "Xu Xoa – The Refreshing Sweet Jelly of Central Vietnam",
    "Timeless Melodies: The Enduring Vitality of Revolutionary Music": "Giai điệu vượt thời gian: Sức sống bền bỉ của nhạc cách mạng",
    "The Meal of Independence": "Mâm cơm độc lập",
    "The Legendary Blue River Region": "Miền sông xanh huyền thoại"
  },
  "Highlight": {
    "Highlight": "Tiêu điểm"
  },
  "Heritage Award": {
    "Heritage Award": "Giải thưởng Heritage"
  },
  "Gallery": {
    "Gallery": "Gallery"
  },
  "Hoan Kiem Lake": {
    "name": "Hồ Hoàn Kiếm (Hồ Gươm)",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.097617496516!2d105.84978977515314!3d21.028779737778155!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab953357c995%3A0x1babf6bb4f9a20e!2zSOG7kyBIb8OgbiBLaeG6v20!5e0!3m2!1svi!2s!4v1760722403345!5m2!1svi!2s",
    "type": "rest",
    "introduction": "Hồ Hoàn Kiếm (Hồ Gươm) là biểu tượng văn hóa, lịch sử của thủ đô Hà Nội và là điểm đến yêu thích của du khách trong và ngoài nước. Nằm giữa trung tâm thành phố, hồ không chỉ là nơi thư giãn lý tưởng mà còn gắn liền với nhiều truyền thuyết và công trình kiến trúc cổ kính.",
    "location": "Hồ Hoàn Kiếm nằm ngay trung tâm quận Hoàn Kiếm, được bao quanh bởi các phố Hàng Khay, Lê Thái Tổ và Đinh Tiên Hoàng, Hà Nội.",
    "description": [
      {
        "title": "Vị trí hồ Hoàn Kiếm",
        "content": [
          "Hồ Hoàn Kiếm (Hồ Gươm) nằm ngay trung tâm quận Hoàn Kiếm nên rất thuận tiện cho du khách tìm đến ngắm cảnh và khám phá nhiều trải nghiệm thú vị vào bất cứ thời điểm nào trong ngày.",
          "Do nằm ở vị trí đắc địa, là nơi kết nối giữa khu phố cổ như Hàng Ngang, Hàng Đào, Cầu Gỗ, Lương Văn Can... với khu phố Tây là Nhà Thờ, Tràng Thi, Hàng Bài, Tràng Tiền, Hàng Khay..., nên Hồ Hoàn Kiếm thu hút nhiều du khách trong và ngoài nước đến tham quan, khám phá trong chuyến du lịch Hà Nội."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20020219.png"
      },
      {
        "title": "Lịch sử hồ Hoàn Kiếm",
        "content": [
          "Hồ đã có từ rất lâu, khoảng vài nghìn năm trước. Trước khi mang tên chính thức là Hoàn Kiếm, hồ từng có nhiều tên gọi khác nhau như hồ Lục Thủy vì nước hồ có màu xanh biếc quanh năm, hay hồ Thủy Quân vì triều đình xưa dùng nơi đây để duyệt thủy binh.",
          "Tên gọi Hoàn Kiếm xuất hiện vào đầu thế kỷ 15, gắn với truyền thuyết vua Lê Thái Tổ trả gươm báu cho Rùa thần sau khi dùng để đánh tan giặc Minh, mở ra triều đại nhà Lê thịnh vượng.",
          "Truyền thuyết kể rằng, khi vua Lê Lợi dạo thuyền trên hồ Lục Thủy, rùa vàng nổi lên và ngậm thanh gươm Thuận Thiên lặn xuống đáy hồ. Nhà vua cho rằng đó là ý trời, nên đổi tên hồ thành Hồ Hoàn Kiếm – nghĩa là trả gươm.",
          "Đến cuối thế kỷ 16, chúa Trịnh cho ngăn hồ thành hai phần tả - hữu, gọi là hồ Vọng. Đến năm 1884, phần hồ Hữu Vọng bị lấp để mở rộng thủ đô, còn hồ Tả Vọng chính là Hồ Hoàn Kiếm ngày nay."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20020426.png?t=1760727949906"
      },
      {
        "title": "Phương tiện di chuyển đến hồ Hoàn Kiếm",
        "content": [
          "Nếu du khách nghỉ tại các khách sạn quanh khu phố cổ, chỉ cần vài phút đi bộ là có thể đến hồ Hoàn Kiếm, đền Ngọc Sơn hay phố đi bộ hồ Gươm.",
          "Nếu ở xa trung tâm, du khách có thể đi taxi hoặc xe bus. Các tuyến xe bus đi qua hồ Hoàn Kiếm gồm số 09, 14 và 16 với tần suất 15–20 phút/chuyến (từ 5h05 đến 21h05).",
          "Khi đi taxi, du khách nên chọn các hãng uy tín như Mai Linh, Thành Công để tránh bị chặt chém."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20020658.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20004213.png",
    "activities": [
      {
        "content": [
          "Dạo bộ quanh hồ và chụp ảnh với Tháp Rùa – biểu tượng của thủ đô Hà Nội.",
          "Tham quan đền Ngọc Sơn và cầu Thê Húc đỏ rực vươn ra giữa hồ.",
          "Thưởng thức kem Tràng Tiền, cà phê phố cổ, hoặc trải nghiệm không khí sôi động ở phố đi bộ hồ Gươm vào cuối tuần."
        ]
      }
    ]
  },
  "Ngoc Son Temple": {
    "name": "Đền Ngọc Sơn",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.049800072293!2d105.84981117515318!3d21.0306932877124!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135abc000809ea7%3A0xbb2716ec0282371d!2zxJDhu4FuIE5n4buNYyBTxqFu!5e0!3m2!1svi!2s!4v1760723454577!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "Đền Ngọc Sơn là biểu tượng văn hóa tâm linh nổi tiếng của thủ đô Hà Nội, thu hút du khách nhờ vẻ đẹp cổ kính và giá trị lịch sử lâu đời. Với vị trí đắc địa giữa lòng Hồ Gươm, đây là điểm đến không thể bỏ qua trong hành trình khám phá Hà Nội ngàn năm văn hiến.",
    "location": "Phố Đinh Tiên Hoàng, phường Hàng Trống, quận Hoàn Kiếm, Hà Nội",
    "description": [
      {
        "title": "Vị trí Đền Ngọc Sơn",
        "content": [
          "Đền Ngọc Sơn tọa lạc trên một gò đất được gọi là đảo Ngọc Sơn ở phía đông bắc của Hồ Gươm.",
          "Cổng đền nằm tại phố Đinh Tiên Hoàng, phường Hàng Trống, quận Hoàn Kiếm, thủ đô Hà Nội.",
          "Đền Ngọc Sơn được xây dựng vào thế kỉ 19, để thờ Quan Đế giúp trấn áp điều ác, mang đến điều tốt lành cho người dân.",
          "Thời nhà Trần, đền được đổi tên thành Ngọc Sơn – nơi thờ binh tướng đã hy sinh trong cuộc kháng chiến chống quân Nguyên - Mông."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005215.png"
      },
      {
        "title": "Lịch sử hình thành",
        "content": [
          "Trong thời vua Lê Vĩnh Hựu (1735–1739), chúa Trịnh Giang xây dựng cung Khánh Thụy trên nền đất cũ của đền Ngọc Sơn và đắp hai núi đất ở bờ phía Đông, gọi là núi Đào Tai và núi Ngọc Bội.",
          "Cuối triều Lê, cung bị phá hủy một phần. Sau đó, nhà từ thiện Tín Trai dựng chùa Ngọc Sơn để thờ Phật, sau này trở thành đền thờ Văn Xương Đế Quân – vị thần bảo hộ công danh.",
          "Năm 1865, nhà nho Nguyễn Văn Siêu đã đại tu đền, xây thêm đình Trấn Ba, cầu Thê Húc, Đài Nghiên và Tháp Bút, biến nơi đây thành biểu tượng văn hóa và học thuật độc đáo của Hà Nội.",
          "Năm 2013, đền Ngọc Sơn được xếp hạng là di tích quốc gia đặc biệt, khẳng định giá trị lịch sử và văn hóa to lớn."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005316.png"
      },
      {
        "title": "Kiến trúc độc đáo của Đền Ngọc Sơn",
        "content": [
          "Đền Ngọc Sơn được thiết kế theo lối kiến trúc hình chữ Tam gồm ba nếp chính: bái đường, trung đường và hậu cung.",
          "Bái đường là nơi hành lễ đầu tiên, trung đường thờ Văn Xương, Quan Vũ và Lã Tổ – các vị thần học vấn; hậu cung thờ Trần Hưng Đạo – vị anh hùng dân tộc.",
          "Phía Nam đền có đình Trấn Ba với kiến trúc hình vuông, mái hai tầng tám mái, thể hiện đặc trưng của kiến trúc Việt cổ.",
          "Bao quanh đền là ba công trình nổi tiếng: Tháp Bút, Đài Nghiên và cầu Thê Húc – tượng trưng cho tinh thần hiếu học và tôn vinh tri thức của người Việt."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005446.png"
      },
      {
        "title": "Biểu tượng văn hóa quanh đền",
        "content": [
          "Tháp Bút cao 9m, được xây năm 1865, trên thân khắc ba chữ 'Tả Thanh Thiên' (viết lên trời xanh) thể hiện tinh thần học vấn.",
          "Dưới chân Tháp Bút là Đài Nghiên bằng đá xanh đặt trên lưng ba con cóc, khắc bài minh của Nguyễn Văn Siêu, ca ngợi tri thức và văn chương.",
          "Cầu Thê Húc được làm bằng gỗ, cong cong như con tôm, mang ý nghĩa 'nơi đậu tia nắng mặt trời buổi sáng sớm', tượng trưng cho sự may mắn và thịnh vượng.",
          "Sự kết hợp hài hòa giữa Tháp Bút, Đài Nghiên và cầu Thê Húc tạo nên cảnh quan tuyệt đẹp, biểu trưng cho triết lý âm dương hòa hợp và truyền thống hiếu học Việt Nam."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005535.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20004936.png"
  },
  "Turtle Tower": {
    "name": "Tháp Rùa",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.049550786968!2d105.84981117493851!3d21.030703263136587!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab952ba31a31%3A0xe4182b099be6c860!2zVGjDoXAgUsO5YQ!5e0!3m2!1svi!2s!4v1760723921200!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Tháp Rùa là biểu tượng lịch sử và văn hóa nổi tiếng của thủ đô Hà Nội, tọa lạc uy nghiêm giữa lòng hồ Hoàn Kiếm. Với vẻ đẹp cổ kính, kiến trúc độc đáo kết hợp giữa phương Tây và Việt Nam, Tháp Rùa đã trở thành hình ảnh gắn liền với Hà Nội ngàn năm văn hiến.",
    "location": "Phía Nam hồ Hoàn Kiếm, quận Hoàn Kiếm, Hà Nội",
    "description": [
      {
        "title": "Vị trí của Tháp Rùa",
        "content": [
          "Tháp Rùa được xây dựng trên một gò đảo nhỏ tọa lạc tại phía Nam của hồ Hoàn Kiếm, trung tâm thủ đô Hà Nội.",
          "Tháp nằm ở vị trí đắc địa, bao quanh là mặt nước hồ phẳng lặng và cây xanh, tạo nên khung cảnh yên bình và thơ mộng.",
          "Nhờ vị trí nổi bật giữa lòng hồ, Tháp Rùa thu hút rất nhiều du khách trong và ngoài nước ghé thăm, trở thành một phần không thể tách rời của hình ảnh Hà Nội."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010032.png"
      },
      {
        "title": "Lịch sử ra đời của Tháp Rùa",
        "content": [
          "Tháp Rùa được xây dựng trên một gò đất rộng khoảng 350m², còn gọi là gò Rùa – nơi trước kia rùa hồ Gươm thường lên phơi nắng hoặc đẻ trứng.",
          "Theo sử sách, gò Rùa có từ thời vua Lê Thánh Tông và từng là nơi dựng Điếu Đài để vua câu cá. Đến thời Lê Trung Hưng, chúa Trịnh cho xây đình Tả Vọng trên gò, nhưng đến thời Nguyễn thì không còn nữa.",
          "Năm 1886, ông Nguyễn Ngọc Kim (Bá hộ Kim) xin phép chính quyền Pháp xây một ngọn tháp trên gò Rùa để chôn cất hài cốt thân phụ, nhờ vị trí được cho là hợp phong thủy.",
          "Ban đầu, công trình được gọi là Tháp Bá hộ Kim, về sau đổi tên thành Tháp Rùa – gắn liền với truyền thuyết vua Lê Lợi trả gươm cho Rùa thần sau khi đánh tan giặc Minh.",
          "Dù chỉ mới hơn 130 năm tuổi, nhưng việc xây tháp trên gò Rùa đã có lịch sử hơn 500 năm, từ thời vua Lê Thái Tông (1435)."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010158.png"
      },
      {
        "title": "Thời điểm lý tưởng để tham quan Tháp Rùa",
        "content": [
          "Mùa thu (tháng 8 đến tháng 11) được xem là thời điểm đẹp nhất để ghé thăm Tháp Rùa.",
          "Lúc này Hà Nội có tiết trời mát mẻ, bầu không khí trong lành, hương hoa sữa thoang thoảng và lá vàng rơi khắp nơi tạo nên khung cảnh nên thơ, lãng mạn.",
          "Ngoài ra, buổi tối cũng là thời điểm lý tưởng để ngắm Tháp Rùa rực rỡ ánh đèn phản chiếu xuống mặt hồ, mang đến vẻ đẹp huyền ảo khó quên."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010315.png"
      },
      {
        "title": "Cách di chuyển đến Tháp Rùa",
        "content": [
          "Du khách có thể đến Hà Nội bằng nhiều phương tiện như máy bay, tàu hỏa, xe khách hoặc xe máy.",
          "Từ sân bay Nội Bài, có thể di chuyển bằng taxi, xe bus hoặc dịch vụ đưa đón sân bay để đến khu vực hồ Hoàn Kiếm.",
          "Các tuyến xe bus đi qua hồ gồm: 09, 14, 08, 31, 36, 04,… Ngoài ra, taxi các hãng như Mai Linh, Ba Sao, Thành Công đều hoạt động quanh khu vực này.",
          "Nếu lưu trú tại khu phố cổ, bạn chỉ cần đi bộ vài phút là có thể chiêm ngưỡng Tháp Rùa ngay giữa lòng hồ Gươm."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010418.png"
      },
      {
        "title": "Kiến trúc độc đáo của Tháp Rùa",
        "content": [
          "Tháp Rùa là sự kết hợp hài hòa giữa phong cách Gothic châu Âu và kiến trúc cổ Việt Nam.",
          "Tháp được xây dựng trên gò đất hình chữ nhật với bốn tầng, chiều cao tổng cộng 8,8m.",
          "Tầng 1 có móng cao 0,8m, chiều dài 6,28m, rộng 4,54m, có tổng cộng 14 cửa vòm – tạo nên không gian mở và thông thoáng.",
          "Tầng 2 và tầng 3 có kích thước nhỏ dần, trong đó tầng 3 có một cửa tròn đường kính 0,6m hướng ra phía Đông.",
          "Tầng 4 là vọng lâu nhỏ, mỗi bề khoảng 2m. Trên mặt phía Đông khắc ba chữ 'Quy Sơn Tháp' (Tháp Núi Rùa). Mái tháp mang dáng dấp truyền thống Việt với đầu đao uốn cong và hình rồng chầu mặt nguyệt.",
          "Tổng thể kiến trúc của Tháp Rùa tạo nên vẻ đẹp trang nghiêm, cổ kính nhưng vẫn hòa hợp với cảnh quan thiên nhiên xung quanh."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20010502.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20005735.png"
  },
  "One Pillar Pagoda": {
    "name": "Chùa Một Cột",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.921351789057!2d105.83104567515325!3d21.03583268753582!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba1728475ed%3A0xdbe7366fe9dfc2ae!2zQ2jDuWEgTeG7mXQgQ-G7mXQ!5e0!3m2!1svi!2s!4v1760724531706!5m2!1svi!2s",
    "type": "spirituality",
    "introduction": "Chùa Một Cột – biểu tượng linh thiêng và kiến trúc độc đáo của Hà Nội, được xây dựng từ năm 1049 dưới triều vua Lý Thái Tông. Ngôi chùa mang hình dáng đóa sen vươn lên giữa hồ nước, thể hiện triết lý sâu sắc của Phật giáo về sự thanh tịnh và giác ngộ.",
    "location": "Phố Ông Ích Khiêm, Quận Ba Đình, Hà Nội",
    "description": [
      {
        "title": "Giới thiệu về Chùa Một Cột",
        "content": [
          "Chùa Một Cột, còn gọi là Diên Hựu Tự, được xây dựng vào năm 1049 dưới triều vua Lý Thái Tông.",
          "Ngôi chùa tọa lạc trong khuôn viên Ba Đình, gần Lăng Chủ tịch Hồ Chí Minh, và là biểu tượng văn hóa – tâm linh của Hà Nội."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011541.png"
      },
      {
        "title": "Ý nghĩa và sự tích ra đời",
        "content": [
          "Theo truyền thuyết, vua Lý Thái Tông nằm mộng thấy Phật Bà Quan Âm ban cho ông một đóa sen rực sáng.",
          "Sau khi tỉnh dậy, vua đã cho dựng chùa trên hồ Linh Chiểu, với kiến trúc giống như một bông sen nở giữa mặt nước, để tưởng nhớ ân đức của Phật Bà và cầu quốc thái dân an.",
          "Đến đời vua Lý Nhân Tông, chùa được cải tạo, xây hồ Linh Chiểu và thêm tòa sen mạ vàng ở đỉnh cột."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011639.png"
      },
      {
        "title": "Kiến trúc độc đáo",
        "content": [
          "Chùa Một Cột là biểu tượng nghệ thuật kiến trúc, điêu khắc và triết lý Phật giáo.",
          "Kết cấu gồm một cột đá lớn đỡ ngôi chùa nhỏ phía trên, mái cong hình rồng, tạo hình như đóa sen thanh khiết nở giữa mặt hồ tĩnh lặng.",
          "Kiến trúc thể hiện sự hòa hợp giữa trời và đất, con người và vũ trụ."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011746.png"
      },
      {
        "title": "Các khu vực nổi bật trong chùa",
        "content": [
          "Bậc thang dẫn lên chính điện gồm 13 bậc đá xây từ thời nhà Lý, vẫn còn nguyên vẹn qua hàng trăm năm.",
          "Bàn thờ Quan Thế Âm Bồ Tát đặt giữa Liên Hoa Đài, pho tượng được mạ vàng và đặt trên đài sen gỗ chạm khắc tinh xảo.",
          "Cây bồ đề bên chùa là món quà của Tổng thống Ấn Độ Rajendra Prasad tặng Chủ tịch Hồ Chí Minh, chiết từ cây bồ đề nơi Đức Phật thành đạo.",
          "Cổng Tam Quan có kiến trúc truyền thống Việt Nam, tượng trưng cho ba cách nhìn của Phật giáo: Hữu quan, Không quan và Trung quan."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011902.png"
      },
      {
        "title": "Thời gian mở cửa và giá vé",
        "content": [
          "Chùa mở cửa từ 7:00 – 18:00 hàng ngày.",
          "Miễn phí cho công dân Việt Nam đến vãn cảnh, lễ Phật hoặc cúng bái.",
          "Giá vé tham quan cho khách nước ngoài: 25.000 VND/người.",
          "Thời lượng tham quan trung bình: 1 – 3 giờ."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011951.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20011424.png",
    "activities": [
      {
        "content": [
          "Tham quan và chụp ảnh tại Liên Hoa Đài – biểu tượng của ngôi chùa.",
          "Thắp hương, cầu bình an và may mắn tại chính điện.",
          "Tìm hiểu về lịch sử triều Lý và giá trị kiến trúc cổ xưa của Hà Nội.",
          "Dạo quanh khu vực Lăng Bác và Quảng trường Ba Đình lân cận."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012031.png"
      }
    ]
  },
  "Imperial Citadel of Thang Long": {
    "name": "Hoàng Thành Thăng Long",
    "map": "\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3723.9364640247854!2d105.83768447515334!3d21.03522808755661!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135aba3381d7c49%3A0xb521a7d98f582937!2zSG_DoG5nIFRow6BuaCBUaMSDbmcgTG9uZw!5e0!3m2!1svi!2s!4v1760725453275!5m2!1svi!2s\"",
    "type": "culture",
    "introduction": "Hoàng Thành Thăng Long là quần thể di tích lịch sử tiêu biểu của Việt Nam, gắn liền với lịch sử hình thành và phát triển của kinh đô Thăng Long – Hà Nội suốt 13 thế kỷ. Đây là trung tâm chính trị, văn hóa, hành chính của các triều đại phong kiến Việt Nam và được UNESCO công nhận là Di sản Văn hóa Thế giới vào năm 2010.",
    "location": "Số 19C Hoàng Diệu, Quận Ba Đình, Thành phố Hà Nội",
    "description": [
      {
        "title": "Vị trí và hướng dẫn di chuyển",
        "content": [
          "Hoàng Thành Thăng Long tọa lạc ngay trung tâm Thủ đô Hà Nội, tại số 19C Hoàng Diệu, Quận Ba Đình.",
          "Du khách có thể dễ dàng di chuyển bằng xe máy, xe đạp hoặc ô tô. Từ hồ Hoàn Kiếm, đi theo hướng Tràng Thi, rẽ vào đường Điện Biên Phủ rồi vào đường Hoàng Diệu là đến cổng chính.",
          "Ngoài ra, có thể di chuyển bằng xe buýt tuyến số 22 để đến khu di tích.",
          "Giờ mở cửa: 8h00 – 17h00 hàng ngày."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012538.png"
      },
      {
        "title": "Lịch sử hình thành và kiến trúc",
        "content": [
          "Hoàng Thành Thăng Long có lịch sử kéo dài suốt 13 thế kỷ, trải qua nhiều triều đại phong kiến như Lý, Trần, Lê, Mạc, Nguyễn và cả thời kỳ kháng chiến chống Pháp.",
          "Thời Lý (thế kỷ 11–12): Vua Lý Thái Tổ dời đô từ Hoa Lư ra Thăng Long, xây dựng Kinh thành với ba vòng thành: Đại La thành, Hoàng thành và Tử Cấm thành.",
          "Thời Trần (thế kỷ 13–14): Các vua Trần xây dựng thêm nhiều công trình mới, mở rộng khu vực cung điện.",
          "Thời Lê sơ (thế kỷ 15): Hoàng thành được mở rộng gấp đôi quy mô, trở thành trung tâm quyền lực lớn nhất nước.",
          "Thời Mạc (thế kỷ 16): Nhà Mạc gia cố cửa thành, đắp thêm lũy đất, song bị quân Trịnh phá hủy khi chiếm đóng.",
          "Thời Lê trung hưng (thế kỷ 17–18): Chúa Trịnh Doanh đắp lại thành mới trên nền Đại La, đặt tên là Đại Đô.",
          "Thời Tây Sơn (thế kỷ 18): Vua Quang Trung vẫn cho tu sửa, xây thêm một số công trình tại đây dù dời đô vào Phú Xuân (Huế).",
          "Thời Nguyễn (thế kỷ 19–20): Thăng Long trở thành sở trấn Bắc Thành, quy mô giảm so với trước.",
          "Thời Pháp thuộc: Quân Pháp thay đổi cấu trúc Hoàng thành, xây thêm doanh trại quân sự.",
          "Năm 2002, khu di tích được khai quật trên diện tích 19.000m², phát hiện nhiều tầng văn hóa quý giá.",
          "Năm 2010, UNESCO công nhận Khu Trung tâm Hoàng Thành Thăng Long là Di sản Văn hóa Thế giới."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012635.png"
      },
      {
        "title": "Ý nghĩa lịch sử và văn hóa",
        "content": [
          "Hoàng Thành Thăng Long là biểu tượng cho tiến trình dựng nước và giữ nước suốt hơn một thiên niên kỷ.",
          "Khu trung tâm và khu khảo cổ tại số 18 Hoàng Diệu lưu giữ nhiều tầng di tích thể hiện sự kế thừa giữa các triều đại.",
          "Dù nhiều công trình xưa không còn nguyên vẹn, nhưng những dấu tích còn lại mang giá trị lịch sử, văn hóa và kiến trúc to lớn, thể hiện bản lĩnh và trí tuệ dân tộc Việt."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012731.png"
      },
      {
        "title": "Các công trình nổi bật trong khu di tích",
        "content": [
          "Cột cờ Hà Nội: Được xây dựng năm 1812 dưới thời vua Gia Long, gồm 3 tầng đế hình chóp vuông và thân cột cao, là biểu tượng nổi bật trên đường Điện Biên Phủ.",
          "Cửa Bắc (Chính Bắc Môn): Cổng thành duy nhất còn sót lại, xây năm 1805, thờ hai danh tướng Nguyễn Tri Phương và Hoàng Diệu.",
          "Điện Kính Thiên: Trung tâm hành lễ và thiết triều của triều đình xưa, hiện chỉ còn nền điện, bậc thềm đá và đôi rồng chạm khắc tinh xảo.",
          "Đoan Môn: Cửa chính dẫn vào điện Kính Thiên, gồm 5 cổng vòm cuốn bằng đá, mang nét uy nghi cổ kính."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012814.png"
      },
      {
        "title": "Tour tham quan đêm – Giải mã Hoàng Thành Thăng Long",
        "content": [
          "Tour “Giải mã Hoàng Thành Thăng Long” là hoạt động nổi bật dành cho du khách, diễn ra vào tối thứ 7 và Chủ nhật hàng tuần.",
          "Chuyến tham quan kéo dài 90 phút, khởi hành lúc 18h00, 18h30 và 19h00.",
          "Du khách được chiêm ngưỡng không gian cung đình lung linh dưới ánh đèn lồng, khám phá kiến trúc cổ, cổ vật quý và thưởng thức các điệu múa hoàng cung đặc sắc."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012858.png"
      },
      {
        "title": "Khu khảo cổ và hoạt động check-in",
        "content": [
          "Khu khảo cổ Hoàng Thành tại số 18 Hoàng Diệu gồm 4 khu vực chính, bảo tồn các tầng di tích qua nhiều thời kỳ.",
          "Tại đây, du khách có thể tham quan giếng cổ, nền móng cung điện và nhiều hiện vật quý được khai quật.",
          "Khu vực này cũng là điểm chụp ảnh nổi tiếng, thu hút nhiều du khách và giới trẻ đến check-in với cổ phục, áo dài."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012538.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20012333.png",
    "activities": [
      {
        "content": [
          "Tham quan các công trình nổi bật: Cột cờ Hà Nội, Cửa Bắc, Điện Kính Thiên, Đoan Môn.",
          "Tham gia tour đêm 'Giải mã Hoàng Thành Thăng Long' đầy hấp dẫn.",
          "Khám phá khu khảo cổ số 18 Hoàng Diệu và chiêm ngưỡng hiện vật quý.",
          "Chụp ảnh lưu niệm với trang phục cổ phục Việt Nam.",
          "Tìm hiểu lịch sử và văn hóa Thăng Long – Hà Nội qua các triển lãm và hiện vật trưng bày."
        ],
        "image": "/images/thanglong/activities.jpg"
      }
    ]
  },
  "Co Loa Citadel": {
    "name": "Thành Cổ Loa",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3722.0093731347138!2d105.86886257515512!3d21.112192484907943!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x313500b2ffacb0a3%3A0x952a436b3aab36de!2zRGkgdMOtY2ggVGjDoG5oIEPhu5UgTG9h!5e0!3m2!1svi!2s!4v1760725934191!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Thành Cổ Loa (còn gọi là Loa Thành) là tòa thành cổ nổi tiếng gắn liền với truyền thuyết An Dương Vương và câu chuyện Mỵ Châu – Trọng Thủy. Được xây dựng vào thế kỷ III TCN, Cổ Loa từng là kinh đô của nước Âu Lạc, thể hiện trình độ kỹ thuật và sáng tạo vượt bậc của người Việt cổ.",
    "location": "Xã Cổ Loa, huyện Đông Anh, thành phố Hà Nội",
    "description": [
      {
        "title": "Đôi nét giới thiệu về thành Cổ Loa",
        "content": [
          "Thành Cổ Loa được xây dựng từ thế kỷ III trước Công nguyên, là kinh đô của nước Âu Lạc do An Dương Vương sáng lập.",
          "Toàn khu di tích hiện có khoảng 60 di tích cổ, trong đó 7 di tích được xếp hạng cấp Quốc gia.",
          "Cổ Loa được xem là tòa thành có quy mô, cấu trúc lớn và độc đáo nhất Việt Nam, đồng thời lưu giữ nhiều giá trị lịch sử, kiến trúc và văn hóa phi vật thể đặc sắc.",
          "Nhiều công trình như Đền Thượng, Đình Cổ Loa, Am Bà Chúa, Giếng Ngọc... vẫn còn được bảo tồn và thu hút du khách trong và ngoài nước."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20013343.png"
      },
      {
        "title": "Giá vé và giờ mở cửa",
        "content": [
          "Giờ mở cửa: 8h00 – 17h00 hàng ngày.",
          "Giá vé tham quan: 5.000 – 10.000 VND/người.",
          "Miễn phí vé cho trẻ em dưới 15 tuổi và người có công với Cách mạng.",
          "Chi phí làm lễ dâng hương: 600.000 VND/đoàn.",
          "Phí thuê hướng dẫn viên: khoảng 300.000 VND/lượt."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014418.png"
      },
      {
        "title": "Thời điểm lý tưởng để tham quan",
        "content": [
          "Du khách có thể tham quan Cổ Loa vào bất kỳ thời điểm nào trong năm, nhưng đẹp nhất là mùa hè khi hoa phượng và bằng lăng nở rộ.",
          "Nếu muốn trải nghiệm không khí lễ hội, hãy đến vào ngày 5–6 tháng Giêng âm lịch, khi diễn ra Lễ hội Cổ Loa tôn vinh công đức của An Dương Vương.",
          "Ngoài ra, vào các ngày 1, 6, 11, 16, 21 và 26 âm lịch hàng tháng, khu vực này có tổ chức phiên chợ Sa truyền thống – một nét văn hóa dân gian đặc sắc chỉ họp 5 ngày mỗi tháng."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014519.png"
      },
      {
        "title": "Phương tiện và cách di chuyển",
        "content": [
          "Thành Cổ Loa nằm cách trung tâm Hà Nội hơn 20 km, thuộc huyện Đông Anh.",
          "Xe buýt là phương tiện thuận tiện và tiết kiệm nhất, giá vé từ 7.000 – 9.000 VND/lượt.",
          "Các tuyến xe buýt đi Cổ Loa: tuyến 15, 17 (Long Biên), 43 (Ga Hà Nội), 46 (Mỹ Đình), 59 (Như Quỳnh – Nông nghiệp).",
          "Ngoài xe buýt, du khách có thể đi bằng xe máy hoặc ô tô theo các hướng: Cầu Thăng Long, Cầu Chương Dương hoặc Cầu Nhật Tân."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014619.png"
      },
      {
        "title": "Kiến trúc độc đáo của thành Cổ Loa",
        "content": [
          "Thành Cổ Loa có hình dáng như vòng xoáy ốc, vì vậy còn gọi là Loa Thành.",
          "Theo sử sách, thành có tổng cộng 9 vòng xoáy trôn ốc, ngày nay chỉ còn lại 3 vòng chính: thành nội, thành trung và thành ngoại.",
          "Thành ngoại có chu vi khoảng 8 km, được xây bằng đất, cao 4–5 m, có chỗ cao đến 12 m, với tổng khối lượng đất khoảng 2,3 triệu m³.",
          "Thành trung chu vi 6,5 km, kiên cố hơn, còn thành nội rộng 2 km² – là nơi vua An Dương Vương sinh sống cùng hoàng tộc.",
          "Ngày nay, nhiều đoạn thành và hào nước vẫn còn tồn tại, minh chứng cho trình độ kỹ thuật quân sự độc đáo của người Việt cổ."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014726.png"
      },
      {
        "title": "Các địa điểm tham quan nổi bật",
        "content": [
          "Đền Thượng (Đền An Dương Vương): Xây trên nền cung điện cũ, thờ vua Thục Phán – người xây thành Cổ Loa. Bên trong có tượng đồng của vua và nhiều di vật cổ quý.",
          "Giếng Ngọc: Nằm trước Đền Thượng, gắn với truyền thuyết Mỵ Châu – Trọng Thủy. Tương truyền, nước giếng có thể làm sáng ngọc trai.",
          "Am Bà Chúa (Mộ Mỵ Châu): Nằm sau cây đa cổ thụ, thờ công chúa Mỵ Châu – biểu tượng của lòng trung trinh và bi kịch tình yêu.",
          "Đền thờ Cao Lỗ: Nơi thờ vị tướng tài đã giúp An Dương Vương xây thành và chế tạo nỏ Liên Châu huyền thoại.",
          "Đình Ngự Triều Di Quy: Tọa lạc trên nền điện thiết triều xưa, có kiến trúc vững chãi, hiện là nơi trưng bày nhiều hiện vật khảo cổ quý giá.",
          "Nhà trưng bày khảo cổ: Triển lãm các hiện vật cổ khai quật được, bao gồm bản đồ Cổ Loa xưa, mũi tên đồng, và mô hình nỏ thần."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014859.png"
      },
      {
        "title": "Ẩm thực và đặc sản tại Cổ Loa",
        "content": [
          "Bún Mạch Tràng – đặc sản của vùng Đông Anh, có sợi to, màu hơi đục, giòn và dai đặc trưng.",
          "Cháo trai Cổ Loa – món ăn nổi tiếng, được nấu từ trai sông Hoàng Giang, vị ngọt thanh, ăn kèm quẩy và cà muối, giá chỉ từ 15.000 VND/bát.",
          "Bên cạnh đó, khu chợ Cổ Loa còn bán nhiều món dân dã khác như bánh tẻ, bánh cuốn, bún riêu cua, mang đậm hương vị Bắc Bộ."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20014859.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20013254.png",
    "activities": [
      {
        "content": [
          "Tham quan các công trình lịch sử: Đền Thượng, Giếng Ngọc, Am Bà Chúa, Đền Cao Lỗ, Đình Ngự Triều Di Quy.",
          "Tìm hiểu truyền thuyết An Dương Vương – Mỵ Châu – Trọng Thủy qua các di tích.",
          "Tham gia Lễ hội Cổ Loa vào tháng Giêng âm lịch với các nghi thức rước kiệu, tế lễ truyền thống.",
          "Khám phá kiến trúc vòng thành ốc độc đáo và hệ thống hào nước cổ.",
          "Thưởng thức đặc sản địa phương như bún Mạch Tràng, cháo trai, bánh tẻ."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20015321.png"
      }
    ]
  },
  "Temple of Literature - Imperial Academy": {
    "name": "Văn Miếu - Quốc Tử Giám",
    "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3724.1140404633256!2d105.83309427515317!3d21.02812248780075!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ab9926e7bd67%3A0x580e078874d5df1e!2zVsSDbiBNacOqzIF1IOKAkyBRdcO0zIFjIFTGsMyJIEdpYcyBbQ!5e0!3m2!1svi!2s!4v1760728357702!5m2!1svi!2s",
    "type": "culture",
    "introduction": "Đến với Hà Nội, bất cứ ai cũng phải đến tham quan và trải nghiệm khu di tích lịch sử văn hóa, quần thể di tích về trường đại học đầu tiên của nước ta chính là Văn Miếu - Quốc Tử Giám.",
    "location": "58 Quốc Tử Giám, quận Đống Đa, Hà Nội",
    "description": [
      {
        "title": "Vài nét khái quát về Văn Miếu - Quốc Tử Giám",
        "content": [
          "Văn Miếu - Quốc Tử Giám không chỉ được xem là khu di tích lịch sử văn hóa mà còn là nơi được nhiều sĩ tử, học trò tới đây để cầu được những may mắn trong thi cử, học hành.",
          "Văn Miếu - Quốc Tử Giám ở đâu? Văn Miếu được nằm trong khu vực Đống Đa, Hà Nội và được nằm trong 4 phố chính gồm Nguyễn Thái Học, Tôn Đức Thắng, Văn Miếu và Quốc Tử Giám. Cổng vào Văn Miếu - Quốc Tử Giám chính là số 58 Quốc Tử Giám, Đống Đa, Hà Nội.",
          "Khi đến du lịch với Hà Nội ngàn năm văn hiến thì đây chắc chắn là địa điểm mà các bạn nên ghé thăm."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021557.png"
      },
      {
        "title": "Hướng dẫn đường đi và phương tiện",
        "content": [
          "Nếu di chuyển từ Hồ Gươm thì các bạn chỉ cần đi dọc theo đường Lê Thái Tổ, rẽ phải vào đường Trường Thi, đi về phía đường Cửa Nam, Nguyễn Khuyến rồi rẽ trái vào đường Văn Miếu là đến. Hãy đảm bảo luật an toàn giao thông và tránh đi vào đường một chiều nhé!",
          "Di chuyển bằng xe bus thì những tuyến 02, 23, 38, 25, 41 là những xe có điểm dừng gần nơi đây."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021650.png"
      },
      {
        "title": "Thời gian mở cửa và giá vé",
        "content": [
          "Thời gian mở cửa: Tất cả các ngày trong tuần, từ Thứ Hai đến Chủ Nhật.",
          "Mùa nóng (từ ngày 15/4 đến 15/10): Từ 7h30 đến 17h30.",
          "Mùa lạnh (từ ngày 16/10 đến 14/4): Từ 8h00 đến 17h00.",
          "Hiện nay, khách du lịch và người dân vào thăm quan phải mua vé vào cổng. Với người lớn là 30.000đ và vé trẻ em là 20.000đ. Mức giá này đang là mức khá rẻ và áp dụng chung cho cả các khách Việt Nam lẫn khách nước ngoài."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021757.png"
      },
      {
        "title": "Sơ đồ tổng quan về Văn Miếu - Quốc Tử Giám",
        "content": [
          "Văn Miếu - Quốc Tử Giám được chia làm 15 nơi cơ bản gồm: Hồ Văn, Bia Hạ Mã, Tứ trụ, Vườn Giám, Cổng Văn Miếu, Cổng Đại Trung, Khuê Văn Các, Giếng Thiên Quang, Bia tiến sĩ, Cổng Đại Thành, Khu Đại Thành, Cổng Thái Học, Khu Thái Học, Lầu chuông, Lầu trống."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021830.png"
      },
      {
        "title": "Lịch sử của Văn Miếu - Quốc Tử Giám",
        "content": [
          "Văn Miếu được xây dựng vào năm 1070 dưới thời vua Lý Thánh Tông, đây chính là nơi thờ Khổng Tử, Chu Công, Tứ Phủ.",
          "1076 vua Lý Nhân Tông cho lập thêm Quốc Tử Giám bên cạnh là trường đại học dành riêng cho con vua và các gia đình quý tộc. Đến thời vua Trần Thái Tông, nơi đây được đổi tên thành Quốc học viện và thu nhận cả con cái nhà thường dân có học lực xuất sắc.",
          "Lịch sử phát triển của Văn Miếu - Thời Hậu Lê, vua Lê Thánh Tông bắt đầu cho dựng bia của những người thi đỗ tiến sĩ. Thời Nguyễn, Quốc Tử Giám được lập Huế, Văn Miếu Thăng Long được sửa sang lại chỉ còn là Văn Miếu của trấn Bắc Thành, sau đó mới được đổi tên thành Văn Miếu Hà Nội.",
          "Văn Miếu - Quốc Tử Giám được nằm trong khuôn viên rộng khoảng 54.331 m2 bao gồm nhiều công trình kiến trúc khác nhau. Trải qua nhiều lần tu sửa nên quần thể này vẫn gồm Hồ Văn, Văn Miếu môn, Đại Trung môn, Khuê Văn Các, Giếng Thiên Quang, bia tiến sĩ, Đại Thành môn, nhà Thái Học.",
          "Nơi đây đã được Thủ tướng Chính phủ công nhận là Di tích quốc gia đặc biệt. Khuê Văn Các tại Văn Miếu - Quốc Tử Giám được chọn là biểu tượng của Thủ đô theo Luật Thủ Đô, 82 tấm bia Tiến sĩ tại nơi đây được UNESCO công nhận là Di sản tư liệu và ghi vào danh mục Ký ức thế giới toàn cầu."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021913.png"
      },
      {
        "title": "Các khu tham quan có tại Văn Miếu - Quốc Tử Giám",
        "content": [
          "Nổi bật là những bức tường bao quanh được xây bằng gạch và bên trong được chia thành 5 ngăn, mỗi khu vực có tường ngăn cách và cổng qua lại.",
          "Khu thứ nhất - Cổng chính Văn Miếu: Cổng chính Văn Miếu Môn đi đến cổng Đại Trung Môn được xây theo kiểu Tam Quan với kiểu chữ Hán cổ xưa, hai bên có cửa nhỏ là Thành Đức Môn và Đạt Tài Môn.",
          "Khu thứ hai - Khuê Văn Các: Từ Đại Trung Môn vào đến Khuê Văn Các ở đây các công trình kiến trúc không đồ sộ song tỷ lệ rất hài hòa và đẹp mắt. Kiến trúc gồm 4 trụ gạch vuông (85cm x 85cm) bên dưới đỡ tầng gác phía trên và có những kết cấu gỗ rất đẹp.",
          "Tầng trên có 4 cửa hình tròn, hàng lan can con tiện và con sơn đỡ mái bằng gỗ đơn giản, mộc mạc. Mái ngói chống hai lớp tạo thành công trình 8 mái, gờ mái và mặt mái phẳng. Gác là một lầu vuông tám mái, bốn bên tường gác là cửa sổ hình tròn mặt trời tỏa tia sáng. Hai bên trái Khuê Văn Các là Bi Văn Môn, Súc Văn Môn dẫn vào hai khu nhà bia Tiến sĩ.",
          "Khu thứ ba - Khu nhà bia tiến sĩ: Gồm hồ nước Thiên Quang Tỉnh, có hình vuông, hai bên hồ là khu nhà bia tiến sĩ, mỗi tấm được làm bằng đá, khắc tên các vị thi đỗ Trạng Nguyên, Bảng Nhãn, Thám Hoa, Hoàng Giáp, Tiến sĩ và được đặt trên lưng rùa. Những di vật quý nhất của khu di tích này hiện nay còn 82 tấm bia của các khoa.",
          "Khu thứ tư - Khu trung tâm: Thuộc kiến trúc chủ yếu của Văn Miếu có công trình lớn có bố cục song song và nối tiếp nhau. Tòa nhà ngoài là Bái Đường, Tòa trong là Thượng cung, đây chính là khu vực dùng để thờ Khổng Tử, Tứ Phối (Nhan Tử, Tăng Tử, Tử Tư, Mạnh Tư).",
          "Khu thứ năm - Nhà Thái Học: Vào thời Nguyễn trường Quốc Tử Giám bị bãi bỏ, nhà thái học bị đổi làm nhà Khải Thánh, thờ thân phụ, thân mẫu của Khổng Tử. Khu nhà này bị phá hủy trong giai đoạn kháng chiến chống Pháp và mới được xây dựng lại vào năm 1999. Nơi đây còn có cả nhà Tiền Đường - Hậu Đường, là nơi các vị Lý Thánh Tông, Lý Nhân Tông, Lê Thánh Tông và tư nghiệp Quốc Tử Giám Chu Văn An."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20022000.png"
      },
      {
        "title": "Ý nghĩa đặc trưng của Văn Miếu - Quốc Tử Giám",
        "content": [
          "Được mệnh danh là trường đại học đầu tiên của nước ta và là địa điểm lưu giữ những truyền thống hiếu học của người Việt.",
          "Việc được tiếp thêm động lực từ những bảng vàng của ông cha ta trong hành trình nỗ lực học tập và khám phá tri thức nhân loại.",
          "Ngày nay, nơi đây còn là nơi tổ chức các hội thơ, nơi khen tặng những học sinh ưu tú, xuất sắc và là địa điểm tham quan nổi tiếng được du khách trong nước và nước ngoài ghé thăm.",
          "Đây cũng chính là điểm hẹn “xin chữ” của người dân Thủ đô trong những ngày Tết truyền thống với những mong ước có một năm mới an lành, trong mùa thi cử của các sĩ tử."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20022047.png"
      },
      {
        "title": "Một vài lưu ý khi đến tham quan tại Văn Miếu - Quốc Tử Giám",
        "content": [
          "Tôn trọng di tích, chấp hành đúng quy định các đơn vị quản lý, không xâm hại các hiện vật, cảnh quan di tích, không xoa đầu rùa, viết, vẽ, đứng, ngồi lên bia Tiến sĩ,...",
          "Trang phục sử dụng nên gọn gàng, sạch sẽ, không mặc váy quá ngắn hay trang phục hở hang hoặc trong nhà. Không hút thuốc, đội nón, mũ trong điện thờ,...",
          "Thực hiện nếp sống văn minh nơi thờ tự.",
          "Không lợi dụng quyền tự do tín ngưỡng để thực hiện các hoạt động mê tín, lừa đảo,...",
          "Giữ gìn vệ sinh, bảo vệ cảnh quan môi trường.",
          "Không mang vũ khí, chất nổ, chất dễ cháy vào di tích."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20022131.png"
      }
    ],
    "image": "/app/data/touristattractions/Screenshot%202025-10-18%20021533.png",
    "activities": [
      {
        "content": [
          "Tham quan, chụp ảnh check-in tại Khuê Văn Các – biểu tượng của Hà Nội.",
          "Tìm hiểu lịch sử giáo dục Việt Nam qua các bia Tiến sĩ.",
          "Tham dự lễ hội, hội thơ xuân và xin chữ đầu năm."
        ],
        "image": "/app/data/touristattractions/Screenshot%202025-10-18%20022204.png"
      }
    ]
  },
  "TRAN QUOC PAGODA": {
    "name": "CHÙA TRẤN QUỐC",
    "map": "46 Thanh Niên, phường Yên Phụ, quận Tây Hồ, Hà Nội",
    "type": "Địa điểm du lịch tâm linh",
    "introduction": "Chùa Trấn Quốc - Địa điểm du lịch tâm linh nổi tiếng ở Hà Nội. Nếu có dịp du lịch Hà Nội hãy đến thăm chùa Trấn Quốc, một ngôi chùa cổ độc đáo tọa lạc tại địa chỉ 46 Thanh Niên, phường Yên Phụ, quận Tây Hồ. Với tuổi đời lên đến 1500 năm, đây là một trong những ngôi chùa cổ nhất Việt Nam và từng vinh dự lọt Top '10 ngôi chùa đẹp nhất thế giới'.",
    "location": "46 Thanh Niên, phường Yên Phụ, quận Tây Hồ, Hà Nội",
    "description": [
      {
        "content": [
          "Chùa Trấn Quốc soi bóng lung linh giữa Hồ Tây Hà Nội",
          "Thủ đô Hà Nội vẫn nổi danh là vùng đất với bề dày văn hoá, lịch sử cùng vô vàn danh lam thắng cảnh nổi tiếng và các công trình đền chùa, miếu mạo linh thiêng. Khi đến du lịch Hà Nội, du khách hãy dành chút thời gian ghé thăm chùa Trấn Quốc - ngôi chùa với tuổi đời 1500 năm mang nét đẹp kiến trúc lẫn giá trị lịch sử, tâm linh lâu đời."
        ]
      },
      {
        "title": "Chùa Trấn Quốc thờ ai?",
        "content": [
          "Nếu bạn đang có kế hoạch du lịch tâm linh ghé thăm các ngôi chùa Hà Nội thì không thể không tham quan chùa Trấn Quốc. Từng là trung tâm Phật giáo của Thăng Long thời Lý - Trần, chùa Trấn Quốc Hồ Tây hiện nay đã trở thành điểm đến tâm linh hấp dẫn, thu hút đông đảo du khách tới vãn cảnh, lễ bái hàng năm.",
          "Chùa Trấn Quốc theo hệ phái Bắc Tông. Bên trong điện chùa thờ Phật A Di Đà, Phật Thích Ca Mâu Ni và Phật Bà Quan Âm. Chùa cũng có ban thờ Quan Bình, Quan Vũ, Chu Thương, Đức Ông và các thị giả."
        ]
      },
      {
        "title": "Lịch sử chùa Trấn Quốc",
        "content": [
          "Theo sử sách, các tài liệu ghi lại, Trấn Quốc tự được xây dựng năm 541 thời Tiền Lý và có tên gọi ban đầu là chùa Khai Quốc. Thuở ban đầu, chùa nằm tại bãi đất làng Yên Hoà là làng Yên Phụ ngày nay.",
          "Đến năm 1440, vua Lê Thái Tông đã đổi tên chùa thành chùa An Quốc với mong muốn đất nước được bình an, lâu bền. Năm 1615, dưới triều vua Lê Kính Tông, chùa được dời sang khu vực đê Yên Phụ, xây dựng trên nền cũ là điện Hàn Nguyên của nhà Trần và cung Thuý Hoa của nhà Lý. Năm 1639, chúa Trịnh đã cho xây dựng hành lang hai bên tả hữu và tu sửa lại cổng tam quan. Đến thời vua Lê Hy Tông, chùa được đổi tên một lần nữa thành chùa Trấn Quốc. Chùa được đúc chuông, đắp thêm tượng và tôn tạo lại vô cùng hoành tráng vào đầu đời nhà Nguyễn. Năm 1821, vua Minh Mạng đã ngự giá tới tham quan chùa và ban 20 lạng bạc để mở rộng và trùng tu chùa. Tới năm 1842, vua Thiệu Trị ban 200 quan tiền và 1 đồng vàng lớn đồng thời cũng đổi tên chùa thành chùa Trấn Bắc. Nhưng dân chúng từ xưa vẫn quen gọi chùa với cái tên Trấn Quốc, nhờ vậy mà cái tên này vẫn được giữ mãi đến ngày nay. Trải qua bao thăng trầm, chùa Trấn Quốc tiếp tục được đời sau bảo tồn, gìn giữ và tôn tạo để xây dựng vẻ đẹp trang nghiêm cho ngôi chùa này."
        ]
      },
      {
        "title": "Giá trị và ý nghĩa của chùa Trấn Quốc",
        "content": [
          "Theo lịch sử ghi chép lại, dưới thời Pháp thuộc, Viện Viễn Đông Bác cổ đã có những nghiên cứu sâu sắc và đánh giá cao ngôi chùa cổ kính này. Đặc biệt, chùa Trấn Quốc còn được xếp hàng vào một trong 10 công trình lịch sử toàn cõi Đông Dương. Trải qua nhiều biến động của lịch sử, ngôi chùa vẫn được bảo vệ, tôn tạo, giữ gìn nét đẹp kiến trúc, văn hóa. Năm 1962, chùa Trấn Quốc được Bộ Văn hóa - Thông tin công nhận là Di tích lịch sử - văn hóa cấp Quốc gia. Đối với Phật giáo Việt Nam, chùa Trấn Quốc thực sự là một niềm tự hào, là di sản quý giá sở hữu nét đẹp về kiến trúc, lịch sử và văn hóa. Đến nay, công trình này vẫn là một trong những chốn cửa Phật linh thiêng, điểm đến tâm linh nổi tiếng của Hà Nội, thu hút đông đảo khách du lịch và các tăng ni, Phật tử đến hành lễ."
        ]
      },
      {
        "title": "Chùa Trấn Quốc ở đâu? Cách di chuyển",
        "content": [
          "Nằm trên hòn đảo phía Đông Hồ Tây, chùa Trấn Quốc là ngôi cổ tự linh thiêng bậc nhất Hà Nội có tuổi đời lên đến 1500 năm. Trấn Quốc Tự tọa lạc tại số 46 đường Thanh Niên, phường Yên Phụ, quận Tây Hồ, Hà Nội.",
          "Chỉ cách trung tâm thành phố khoảng 4km, bạn có thể dễ dàng di chuyển đến Chùa Trấn Quốc bằng các phương tiện cá nhân như xe máy, ô tô hoặc các phương tiện công cộng như taxi, grab, xe bus. Nếu di chuyển bằng xe bus, bạn có thể lựa chọn xe tuyến số 33 và tuyến số 50 đều có điểm dừng rất gần chùa."
        ]
      },
      {
        "title": "Giờ mở cửa và giá vé vào chùa Trấn Quốc",
        "content": [
          "Chùa Trấn Quốc mở cửa đón du khách tới tham quan, chiêm bái từ 8h - 16h hàng ngày. Riêng ngày mùng 1 và ngày Rằm hàng tháng, chùa mở cửa từ 6h - 18h và Giao thừa Tết Nguyên đán chùa mở cửa cả đêm.",
          "Chùa Trấn Quốc không thu vé tham quan đối với cả người dân Thủ đô và khách du lịch. Vì vậy, bạn có thể tự do tham quan, ngắm cảnh, lễ bái tại chùa."
        ]
      },
      {
        "title": "Khám phá kiến trúc chùa Trấn Quốc",
        "content": [
          "Hình ảnh chùa Trấn Quốc hiện lên thể hiện rõ các nét hoạ tiết phương Đông cùng cảnh quan thiên nhiên được sắp xếp dựa theo nguyên tắc và trình tự khắt khe của Phật giáo. Trải qua nhiều lần trùng tu, sửa chữa, chùa Trấn Quốc hiện nay có tổng diện tích khoảng hơn 3000m2 gồm 3 nếp nhà chính: Thiêu hương, Thượng điện và Tiền đường nối với nhau thành hình chữ Công.",
          "Nhà Tiền đường xây theo hướng Tây nằm giữa khuôn viên chùa. Hai bên là Thiêu hương và Thượng điện có hai dãy hành lang nối dài. Đằng sau là ngôi nhà ba gian có mái chồng diêm, sau đó là gác chuông nằm trên trục sảnh đường chính. Bên trái là nhà bia lưu giữ 14 tấm bia mang nhiều giá trị văn hoá, lịch sử và bên phải là nhà tổ. Thế kỷ 18 dưới thời vua Lê Ý Tông, ở phía sau chùa Trấn Quốc được xây thêm rất nhiều tháp.",
          "Đến năm 1998, Viện chủ Tổ đình chùa Trấn Quốc là Hòa thượng Kim Cương Tử đã cho xây dựng Bảo Tháp Lục Độ Đài Sen nổi bật giữa vườn tháp cổ. Bảo tháp được đặt đối xứng với cây bồ đề - quà tặng của Tổng thống Ấn Độ Rajendra Prasad trao tặng vào năm 1959 khi ông có chuyến thăm Thủ đô. Với những giá trị lịch sử đồ sộ và nét kiến trúc độc đáo này, năm 1989, chùa Trấn Quốc vinh dự được công nhận là Di tích Lịch sử Văn hoá cấp quốc gia."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "content": [
          "Tham quan kiến trúc chùa cổ",
          "Chiêm bái các điện thờ",
          "Tham quan vườn tháp cổ và Bảo Tháp Lục Độ Đài Sen",
          "Ngắm cảnh Hồ Tây"
        ]
      }
    ]
  },
  "QUAN THANH TEMPLE": {
    "name": "ĐỀN QUÁN THÁNH",
    "map": "Số 190 phố Quán Thánh, phường Quán Thánh, quận Ba Đình, Hà Nội",
    "type": "Di tích lịch sử văn hoá, Địa điểm tâm linh",
    "introduction": "Đền Quán Thánh - biểu tượng văn hóa và tâm linh của Hà Nội. Nếu là một người yêu thích du lịch tâm linh thì chắc chắn bạn không thể bỏ qua những ngôi chùa, ngôi đền cổ kính nổi tiếng Hà Nội như chùa Trấn Quốc, đền Bạch Mã, chùa Một Cột… Trong số đó, một biểu tượng văn hoá tâm linh của mảnh đất Kinh Kỳ đã đi vào sử sách chính là đền Quán Thánh.",
    "location": "Số 190 phố Quán Thánh, phường Quán Thánh, quận Ba Đình, Hà Nội",
    "description": [
      {
        "title": "Thông tin về đền Quán Thánh",
        "content": [
          "Đền Quán Thánh là tọa độ du lịch Hà Nội không thể bỏ lỡ. Di tích lịch sử chùa Vạn Niên, chùa Trấn Quốc, phủ Tây Hồ… và rất nhiều đền chùa khu vực Hồ Tây cùng với đền Quán Thánh đã góp phần tạo nên vẻ đẹp kiến trúc độc đáo, hài hoà cho Thủ đô. Bên cạnh đó còn chứa đựng biết bao giá trị văn hoá tâm linh quý báu. Đền Quán Thánh là một trong Thăng Long tứ trấn gồm 4 ngôi đền: Đền Quán Thánh trấn giữ phía Bắc, Đền Kim Liên trấn giữ phía Nam, Đền Voi Phục trấn giữ phía Tây, Đền Bạch Mã trấn giữ phía Đông.",
          "Đền Quán Thánh ở đâu? Đền Quán Thánh tọa lạc ở cuối đường Thanh Niên, thuộc phường Quán Thánh, quận Ba Đình, Hà Nội. Còn được biết đến với tên gọi Trấn Vũ Quán. Với vẻ đẹp cổ kính và chiều sâu lịch sử, đền Quán Thánh là điểm đến tâm linh nổi bật, thu hút đông đảo người dân và du khách thập phương đến tham quan, lễ bái."
        ]
      },
      {
        "title": "Đền Quán Thánh thờ ai?",
        "content": [
          "Đền Quán Thánh là nơi thờ Huyền Thiên Trấn Vũ – một trong bốn vị thần linh thiêng của Thăng Long Tứ Trấn, bảo vệ bốn hướng của kinh thành Thăng Long xưa. Theo truyền thuyết, Huyền Thiên Trấn Vũ là vị thần phương Bắc, có quyền năng hàng phục yêu ma, bảo vệ dân lành. Ngài từng giúp trừ rùa thành tinh thời Hùng Vương thứ 14, đánh bại cáo chín đuôi ở Tây Hồ, hỗ trợ An Dương Vương trấn áp tinh gà trắng để xây thành Cổ Loa, và tiêu diệt hồ ly tinh trên sông Hồng dưới triều Lý Thánh Tông. Vào thời Lê, đền còn là nơi các vua thường đến cầu mưa khi xảy ra hạn hán."
        ]
      },
      {
        "title": "Lịch sử đền Quán Thánh",
        "content": [
          "Theo những ghi chép được tìm thấy trên các văn bia và tài liệu sử sách, đền Quán Thánh được xây dựng vào đầu thời nhà Lý. Đền được trùng tu và cải tạo nhiều lần vào các năm 1677, 1768, 1838, 1841, 1856, 1893.",
          "Đến thời vua Lê Hy Tông, chúa Trịnh Tạc giao cho con là Trịnh Căn di tạo pho tượng Thánh Trấn Vũ và Trấn Vũ Quán. Lúc bấy giờ, nghệ nhân Vũ Công Chấn là người trực tiếp chỉ đạo đúc pho tượng Huyền Thiên Trấn Vũ đền Quán Thánh bằng đồng hun để thay thế cho pho tượng làm bằng gỗ trước đó.",
          "Đến năm 1794, dưới thời vua Cảnh Thịnh, Đô đốc Tây Sơn là Lê Văn Ngữ đã cho đúc thêm một chiếc khánh lớn làm bằng đồng để đặt ngay tại chính điện. Trong một lần đi tuần thú Bắc Thành, vua Minh Mạng đã đổi tên đền thành Chân Vũ Quán. Cái tên 'Chân Vũ Quán' được tạc lại bằng chữ Hán đặt trên nóc cổng tam quan. Tuy nhiên, bên trong Bái đường vẫn để bức hoành có tên Trấn Vũ Quán.",
          "Vua Thiệu Trị đã ghé thăm đền Quán Thánh và ban tặng tiền để đúc vòng vàng đeo lên pho tượng của Thánh Trấn Vũ vào năm 1842.",
          "Ngày nay, Đền Quán Thánh vẫn được biết đến với hai tên gọi khác nhau là Đền Quán Thánh và Trấn Vũ Quán. Chữ 'Quán' nằm trong cụm từ 'Đạo Quán', là nơi thờ tự của Đạo Giáo.",
          "Đầu năm 1962, Đền Quán Thánh cùng với chùa Trấn Quốc vinh dự được công nhận là di tích lịch sử văn hoá cấp Quốc gia. Vào tháng 8/2024, đền Quán Thánh chính thức được xếp hạng Di tích quốc gia đặc biệt."
        ]
      },
      {
        "title": "Kiến trúc đền Quán Thánh",
        "content": [
          "Kiến trúc đền Quán Thánh bao gồm tam quan, tiền đế, trung đế, sân bái và hậu cung, được thiết kế theo lối kiến trúc truyền thống của Trung Quốc.",
          "Cổng đền Quán Thánh tọa lạc trên mặt đường Thanh Niên với thiết kế cột trụ là bốn con phượng hoàng đấu lưng và con nghê nằm trên đỉnh. Xung quanh cột trụ khắc hình cá hoá rồng, mãnh hổ hạ sơn và các cặp câu đối đỏ vô cùng nổi bật.",
          "Phía sau cổng ngoài là tam quan gồm 2 tầng và 3 cửa. Điểm đặc biệt là tại cổng giữa tam quan có đắp nổi hình tượng thần Rahu - một vị thần Ấn Độ. Chi tiết này thể hiện phần nào sự hội nhập tín ngưỡng của người Việt đã có từ ngàn xưa. Bên cạnh đó, tại gác tam quan chính có đặt một quả chuông đồng được đúc từ đời vua Lê Hy Tông năm 1677. Đây chính là tiếng chuông đã đi vào ca dao, thơ ca Việt Nam 'Gió đưa cành trúc la đà. Tiếng chuông Trấn Vũ, canh gà Thọ Xương'.",
          "Đi qua cổng tam quan sẽ đến nhà bia với nhiều văn bia tạc khắc lưu lại các thời điểm trùng tu đền. Phía sau nhà bia là đền thờ liệt sỹ được xây dựng theo dạng phương đình. Bên trong là ban thờ và ảnh các chiến sĩ đã hy sinh thân mình trong chiến tranh ở khu vực đền Quán Thánh.",
          "Khu vực sân bái là nơi sắp xếp, bày biện lễ vật. Trước bái đường có bàn để chuẩn bị đồ lễ và hai lư hương lớn. Ở hậu cung có đặt bảng giới thiệu về tượng đồng Huyền Thiên Trấn Vũ. Bên hiên bái đường điêu khắc hình tượng cá hóa rồng, tượng hổ xuống núi. Tượng Huyền Thiên Trấn Vũ là công trình nghệ thuật điêu khắc độc đáo bậc nhất Việt Nam. Công trình chứng tỏ và khẳng định nghệ thuật tạc tượng, đúc đồng điêu luyện của người Việt từ cách đây hơn 3 thế kỷ.",
          "Tại nhà bái đường cũng có một pho tượng bằng đồng đen nhưng nhỏ hơn. Trong đền Quán Thánh còn có chiếc khánh bằng đồng được đúc từ thời chúa Trịnh. Các hình tượng trong đền đều được điêu khắc một cách tỉ mỉ, tinh xảo, mang đậm dấu ấn nghệ thuật thời nhà Lê."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Thông tin tham quan",
        "content": [
          "Giờ mở cửa: Các ngày trong tuần: 8h - 17h, Ngày mùng 1 và ngày 15 Âm lịch hàng tháng: 6h - 20h, Mở cửa xuyên đêm vào đêm giao thừa",
          "Giá vé: 10.000VNĐ/người lớn, 5.000 VNĐ/sinh viên, người cao tuổi, người khuyết tật, Miễn phí đối với trẻ em dưới 15 tuổi"
        ]
      },
      {
        "title": "Phương tiện di chuyển",
        "content": [
          "Phương tiện cá nhân: Từ trung tâm thành phố Hà Nội theo tuyến đường: Tràng Tiền → Tràng Thi → Cửa Nam → Nguyễn Thái Học → Thụy Khuê → đường Thanh Niên",
          "Xe buýt: các tuyến 41, 50, E05, HNCITYTOUR, HNCITYTOURCT",
          "Taxi, xe công nghệ"
        ]
      },
      {
        "title": "Trải nghiệm không thể bỏ qua",
        "content": [
          "Lễ Tứ Trấn theo tuần tự Đông - Tây - Nam - Bắc",
          "Xin lộc ở bức tượng Huyền Thiên Trấn Vũ",
          "Tham gia lễ hội đền Quán Thánh đặc sắc vào ngày mùng 3 tháng 3 Âm lịch",
          "Trải nghiệm tour đêm 'Tiếng chuông Trấn Vũ' (dự kiến ra mắt tháng 8/2025)",
          "Tham quan các địa điểm nổi tiếng gần đền: Quảng trường Ba Đình, Điện Kính Thiên, Bốt Hàng Đậu, Chùa Một Cột"
        ]
      }
    ]
  },
  "Huong Pagoda": {
    "name": "CHÙA HƯƠNG",
    "map": "xã Hương Sơn, huyện Mỹ Đức, Hà Nội",
    "type": "Địa điểm du lịch tâm linh",
    "introduction": "Du lịch tâm linh là một trong những loại hình du lịch thu hút đông đảo du khách ở nước ta. Nằm ở phía Bắc, có một ngôi chùa vang danh bốn cõi, những tín đồ Phật giáo đều mong muốn ít nhất một lần được đặt chân đến ngôi chùa này. Đó chính là chùa Hương, một nơi linh thiêng giữa chốn núi non hùng vĩ.",
    "location": "xã Hương Sơn, huyện Mỹ Đức, Hà Nội",
    "description": [
      {
        "title": "Giới thiệu chung về chùa Hương",
        "content": [
          "Chùa Hương hay còn được biết đến với tên gọi khác là chùa Hương Sơn, là một quần thể danh lam thắng cảnh tọa lạc ở xã Hương Sơn, huyện Mỹ Đức, Hà Nội. Quần thể chùa Hương được du khách thập phương phong cho danh hiệu 'Biệt chiếm nhất Nam thiên', là một trong những danh lam thắng cảnh đẹp nhất Việt Nam. Nơi đây xưa kia được coi là biểu tượng tín ngưỡng Phật giáo của thủ đô Hà Nội nói riêng và miền Bắc nói chung.",
          "Được xây dựng vào những năm cuối của thế kỷ 17, tuy nhiên do ảnh hưởng của cuộc kháng chiến chống Pháp, ngôi chùa gần như đã bị phá hủy hoàn toàn, ngôi chùa như hiện tại là một phần được phục dựng và trùng tu dưới sự hướng dẫn của cố hòa thượng Thích Thanh Chân vào năm 1988."
        ]
      },
      {
        "title": "Kiến trúc chùa Hương",
        "content": [
          "Được bao quanh bởi thung lũng suối Yến, cả quần thể chùa Hương gồm có chùa Ngoài và chùa Trong. Chùa Ngoài hay còn được gọi là chùa Trò, với tam quan được cất trên khoảng sân rộng lớn và tháp chuông được dựng ở sân thứ ba.",
          "Nếu như chùa Ngoài được cải tạo dưới bàn tay của con người, thì chùa Trong nằm trong động Hương Tích là tác phẩm tuyệt diệu của tạo hóa với những hang động cổ kỳ vĩ đẹp lay động lòng người. Đường lên thăm động Hương Tích du khách cần phải đi qua các bậc đá cheo leo, dân gian quan niệm rằng, có khổ ải mới đến được chân phương. Vì vậy nơi đây chưa bao giờ vì sự khó khăn của địa hình mà cản trở bước chân của các tín đồ đến đây hành hương.",
          "Động Hương Tích khi xưa còn là nơi vua chúa thường hay lui tới vãn cảnh, năm 1770 Tĩnh Đô Vương Trịnh Sâm đã lưu lại nơi đây 5 chữ Hán 'Nam thiên đệ nhất động', từ đó danh xưng này được lưu truyền cho đến ngày hôm nay."
        ]
      },
      {
        "title": "Lễ hội chùa Hương",
        "content": [
          "Chùa Hương thường thu hút đông đảo du khách thập phương vào mùa xuân, cao điểm là vào các tháng 2, 3 âm lịch do thời điểm này cảnh sắc và thời tiết đẹp nhất để du khách có thể vãn cảnh.",
          "Lễ hội chùa Hương khai hội vào ngày mùng 6 tháng giêng hàng năm và kết thúc vào hạ tuần tháng 3 âm lịch. Lễ hội diễn ra với nhiều hoạt động nghệ thuật đặc sắc như hát chèo, hát văn bên cạnh đó còn có các cuộc thi mang tính thể thao như leo núi, đua thuyền,...Xưa kia, người dân mở hội chùa Hương với ý nghĩa khai sơn, mở rừng. Ngày nay, lễ hội chùa Hương còn mang ý nghĩa khai chùa, mở chùa để người dân đến đây cầu tài cầu lộc cầu bình an cho gia đình mình."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "content": [
          "Tham quan quần thể chùa Hương",
          "Khám phá động Hương Tích",
          "Tham gia lễ hội chùa Hương",
          "Leo núi, đua thuyền"
        ]
      }
    ]
  },
  "ELEPHANT PHUC TEMPLE": {
    "name": "ĐỀN VOI PHỤC",
    "map": "số 362, Kim Mã, phường Ngọc Khánh, quận Ba Đình, Hà Nội",
    "type": "Di tích lịch sử, Địa điểm tâm linh",
    "introduction": "Đền Voi Phục - một trong 'tứ trấn' nổi tiếng của Thăng Long xưa, là điểm đến không thể bỏ qua khi khám phá Hà Nội. Đây không chỉ là nơi thờ thần Linh Lang uy nghiêm mà còn lưu giữ nhiều giá trị lịch sử, văn hóa độc đáo",
    "location": "số 362, Kim Mã, phường Ngọc Khánh, quận Ba Đình, Hà Nội",
    "description": [
      {
        "title": "Lịch sử và ý nghĩa tâm linh đền Voi Phục",
        "content": [
          "Đền Voi Phục là một ngôi đền trong Thăng Long tứ trấn của thành Thăng Long từ xưa. Đền nằm tại số 362, Kim Mã, phường Ngọc Khánh, quận Ba Đình, Hà Nội và có vị trí gần khu vui chơi giải trí của công viên Thủ Lệ. Địa điểm này cũng gần Trường Đại học Giao thông Vận tải và trường đường Đảng Lê Duẩn.",
          "Đền Voi Phục là một trong 'Thăng Long Tứ Trấn,' được xây dựng vào thời vua Lý Thái Tông (1028–1054). Đây là một di tích lịch sử Hà Nội nổi tiếng, nơi thờ thần Linh Lang – vị hoàng tử đã hy sinh trong cuộc kháng chiến chống quân Tống. Sau khi hy sinh vào năm 1076 tại phòng tuyến sông Câu, ông được phong là Đại Vương Thượng Đẳng Phúc Thần để tôn vinh những cống hiến to lớn.",
          "Đền Voi Phục thờ thần Linh Lang.",
          "Ngôi đền được đặt tại phía tây kinh thành Thăng Long, thuộc khu vực làng Thủ Lệ xưa, nay là phường Ngọc Khánh, quận Ba Đình, Hà Nội. Vì vị trí đặc biệt này, đền còn được gọi là 'Trấn Đoài' hoặc 'Trấn Tây,' tương ứng với bát quái phương Tây trong thuật phong thủy. Đây cũng là một trong những nét đặc trưng giúp đền Voi Phục trở thành điểm đến nổi bật trong các địa điểm tâm linh Hà Nội.",
          "Là một địa danh văn hóa lâu đời ở Hà Nội, đền Voi Phục không chỉ thu hút khách thập phương đến chiêm bái mà còn là nơi khám phá những giá trị lịch sử và tín ngưỡng đặc sắc. Đừng quên thêm điểm đến này vào hành trình du lịch của bạn để hiểu hơn về văn hóa và truyền thống của Thủ đô!"
        ]
      },
      {
        "title": "Kiến trúc đền Voi Phục",
        "content": [
          "Đền Voi Phục không chỉ nổi tiếng bởi giá trị lịch sử mà còn thu hút sự chú ý nhờ kiến trúc độc đáo mang đậm nét văn hóa Việt. Điểm nhấn đặc biệt là hai bức tượng voi quỳ trước cổng đền – hình ảnh tượng trưng cho sự trang nghiêm và tôn kính đối với thần Linh Lang. Từ đó, đền có tên gọi 'Voi Phục,' vừa thể hiện ý nghĩa phong thủy vừa làm nổi bật nét đặc trưng của di tích.",
          "Đền Voi Phục được xây dựng theo hình dạng chữ 'công' với três lối lên sân, trong đó lối giữa có 12 bậc đá rộng dành cho nghi lễ rước kiệu. Đền bao gồm các hạng mục chính như: Cổng tam quan, Khuôn viên và sân gạch, Chính điện, Hậu cung.",
          "Sự kết hợp hài hòa giữa kiến trúc và vị trí đắc địa phía tây Thăng Long giúp đền Voi Phục trở thành biểu tượng văn hóa – tín ngưỡng không thể thay thế trong lòng người dân Hà Nội. Đây không chỉ là nơi để cầu an, chiêm bái mà còn là điểm đến lý tưởng cho những ai muốn khám phá nét đẹp văn hóa truyền thống."
        ]
      },
      {
        "title": "Lễ hội đền Voi Phục",
        "content": [
          "Tuy nhiên, nếu bạn muốn tham gia vào lễ hội tại đền thì nên đến đền vào 9 - 11 tháng 2 âm lịch.",
          "Vào các ngày này đền có rất nhiều các hoạt động như múa lân, múa rồng, lễ tế, rước kiệu, đấu cờ, thắp nhang, chọi gà, văn nghệ,... Lịch cụ thể như sau: Mùng 9: Đây là ngày tế cáo để báo cáo và thỉnh thánh về dự lễ. Mùng 10: ngày mà tất cả các nghi lễ thức trung tâm của lễ hội như tế lễ, rước sách được cửa hành linh đình nhất. Ngày 11: Ngày tổng hạ Hào Nam rước long đình lên đền voi Phục lễ giải. Ngày 12: Người dân rước long đình lên Tổng thượng Thuỵ Chương. Ngày 13: Rước long đình cuống tổng hạ Hào Nam lễ giải."
        ]
      },
      {
        "title": "Thông tin tham quan",
        "content": [
          "Thời gian mở cửa vào đền Voi Phục bắt đầu từ 8h00 giờ sáng đến 17h00 giờ chiều mỗi tuần. Đặc biệt, riêng với ngày giao thừa đền mở đến hết đêm.",
          "Theo như thông tin được biết thời điểm hiện tại khi vào đền Voi Phục bạn sẽ không mất phí vé. Tuy nhiên, nếu như bạn muốn mua đồ thắp lễ thì sẽ mất khoản phí cho điều này."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Cách di chuyển",
        "content": [
          "Đối với phương tiện cá nhân: Bạn có thể di chuyển bằng cách đi theo bản đồ hướng dẫn. Bạn có thể sử dụng Google Map để không bị lạc đường.",
          "Đối với xe buýt: Bạn lựa chọn các tuyến xe như 16, 27, 32, 49, 34.",
          "Đối với xe taxi, xe công nghệ: Với hình thức di chuyển này thì bạn chỉ cần liên hệ với các đơn vị cung cấp dịch vụ. Sau đó cung cấp cho họ những thông tin về điểm đến của mình và giờ xuất phát. Khi tiếp nhận thông tin và sẽ được đưa đón tận nơi đến đền Voi Phục rất tiện lợi và an toàn."
        ]
      }
    ]
  },
  "KIM LIEN TEMPLE": {
    "name": "ĐỀN KIM LIÊN",
    "map": "phường Phương Liên, quận Đống Đa, Hà Nội",
    "type": "Di tích lịch sử, Địa điểm tâm linh",
    "introduction": "Đình Kim Liên được biết đến là một trong 'Thăng Long Tứ Trấn' - tức 4 ngôi đền linh thiêng thờ 4 vị thần trấn giữ 4 phía đông, tây, nam, bắc của kinh thành Thăng Long xưa. Đây cũng là điểm đến vô cùng ý nghĩa trên bản đồ du lịch Hà Nội mà bất cứ du khách nào cũng muốn được đến một lần.",
    "location": "phường Phương Liên, quận Đống Đa, Hà Nội",
    "description": [
      {
        "title": "Đôi nét về Đình Kim Liên",
        "content": [
          "Đình Kim Liên, Đền Kim Liên hay Đền Cao Sơn là trấn phía nam trong 'Thăng Long tứ trấn'. Đình trước kia thuộc phường Đông Tác, huyện Thọ Xương, phủ Hoài Đức, nay là phường Phương Liên, quận Đống Đa, Hà Nội.",
          "Đền mở cửa đón khách suốt tuần, từ 8 giờ sáng đến 6 giờ chiều và luôn miễn phí vé vào."
        ]
      },
      {
        "title": "Sự tích đền Kim Liên Hà Nội",
        "content": [
          "Đền Kim Liên còn được gọi là Đền Cao Sơn vì bên trong đền thờ Cao Sơn Đại Vương. Tương truyền rằng, vào thế kỷ 16, khi vua Lê Tương Dực đang cầm quân đi dẹp loạn nhằm khôi phục cơ nghiệp nhà Lê thì đi qua địa phận huyện Phụng Hóa. Thấy cảnh quang núi rừng rậm rạp, lại có ngôi đền cổ khắc 4 chữ 'Cao Sơn đại vương', vua bèn khẩn cầu thần phù trợ. Quả nhiên, sau 10 ngày đã thành công dẹp loạn. Sau đó, vua Lê Tương Dực liền cho xây dựng đền thờ thần Cao Sơn ở Phụng Hóa.",
          "Năm 1509, vua cho xây dựng lại đền thờ khang trang và to đẹp hơn ở phường Kim Hoa, nay là Kim Liên. Sau này, dân làng Kim Liên xây thêm cổng tam quan trước cổng đền và một số kiến trúc mới, tạo thành Đình Kim Liên như chúng ta vẫn thấy.",
          "Hiện nay, ngoài thần Cao Sơn thì Đình Kim Liên còn thờ Mẫu, Tam Phủ và Chủ tịch Hồ Chí Minh."
        ]
      },
      {
        "title": "Kiến trúc độc đáo",
        "content": [
          "Tứ trấn Thăng Long xưa là 4 ngôi đền vô cùng linh thiêng: Đền Bạch Mã trấn giữ phía Đông, Đền Voi Phục trấn giữ phía Tây, Đền Kim Liên trấn giữ phía Nam và Đền Quán Thánh trấn giữ phía Bắc.",
          "Đình Kim Liên được xây dựng trên một gò đất cao gần đầm Kim Liên. Cổng đình và cửa chính đều hướng về phía Tây. Kiến trúc của đình gồm 2 phần chính: phần phía trước gò có một cổng trụ biểu và dãy giải vũ hai bên sân gạch, phần kiến trúc chính là toàn bộ công trình của đình trên gò đất cao. Đi qua khoảng sân rộng là 9 bậc gạch cao được xây bằng gạch vồ có kích thước lớn thời Lê Trung Hưng.",
          "Đình chính gồm 3 phần là Nghi môn, Đại bái và Cung cấm. Nghi môn là nếp nhà 3 gian được xây theo kiểu tường hồi bít đốc, kiến trúc và họa tiết trang trí được thể hiện một cách sinh động và công phu theo phong cách nghệ thuật thời Nguyễn. Nhà Đại bái có 5 gian được tôn tạo với kiểu dáng kiến trúc truyền thống. Cung cấm là nếp nhà 3 gian, gian cuối là nơi thờ Cao Sơn Đại Vương, con gái vua Lê và Huệ Minh công chúa.",
          "Di vật cổ quan trọng nhất tại Đình Kim Liên là tấm bia đá 'Cao Sơn Đại Vương thần từ bi minh' nói về công lao của thần Cao Sơn, do sử thần Lê Tụng soạn năm 1510. Ngoài ra, còn có thêm 39 đạo sắc phong cho thần Cao Sơn."
        ]
      },
      {
        "title": "Lễ hội đình Kim Liên",
        "content": [
          "Hội Đình Kim Liên được tổ chức từ ngày 15-16/3 âm lịch hàng năm và ngày 16 là ngày hội chính. Ngoài lễ chính thì còn có lễ sóc vọng hàng tháng, lễ Kỳ an và lễ kỷ niệm ngày hóa thần vào ngày 12/8 âm lịch hàng năm.",
          "Sáng ngày 15 diễn ra cuộc thi cắt tóc, không khí tưng bừng và náo nhiệt khắp cả làng Kim Liên. Ngôi làng này còn nổi tiếng với những tay thợ vừa cắt tóc vừa múa kéo điêu luyện như nghệ nhân. Kết thúc cuộc thi là những trò chơi dân gian như đập niêu, đẩy gậy… tối đến lại tổ chức ca múa nhạc liên hoan vô cùng sôi động.",
          "Ngày hội chính là ngày 16/3. Sáng sớm, dân làng sẽ làm lễ Tế ở chính điện, đọc văn khấn Đình Kim Liên, sau đó là lễ dâng hương kính cẩn ở trước sân đình, rồi đến các dòng họ dâng lên mâm cỗ cầu kỳ và đẹp ngất ngây. Cuối cùng là lễ rước với 4 kiệu long trọng: Long đình, kiệu ông, kiệu bà và kiệu võng. Người dân đi thành hàng dài từ phố Kim Hoa đến Đào Duy Anh rồi quay lại Đình Kim Liên tạo nên hình ảnh vô cùng hoành tráng.",
          "Trong lễ hội, người dân còn tổ chức nhiều trò chơi truyền thống như chọi chim, cờ người, võ thuật, bắt vịt dưới ao…"
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Lưu ý khi tham quan",
        "content": [
          "Chú ý nơi cắm hương. Chỉ cắm vào bát hương, không cắm tùy tiện vào tay tượng, gốc cây hay đồ lễ.",
          "Sắp xếp để gọn tiền vào hòm công đức, không rải ở nhiều nơi.",
          "Không được dẫm lên bậu cửa, không bước vào từ cửa giữa mà nên bước vào từ cửa 2 bên.",
          "Không làm ồn, không chỉ trỏ lung tung, không nói lời bất kính, không đi qua trước mặt người đang quỳ lạy.",
          "Không mang đồ đã cúng ở đình về đặt lên ban thờ nhà mình."
        ]
      }
    ]
  },
  "Bach Ma Temple": {
    "name": "ĐỀN BẠCH MÃ",
    "map": "76 phố Hàng Buồm, Q. Hoàn Kiếm, TP. Hà Nội",
    "type": "Di tích lịch sử, Địa điểm tâm linh",
    "introduction": "Đền Bạch Mã là một trong những di tích lịch sử nổi tiếng ở Hà Nội. Giống như đền Quán Thánh, đền Bạch Mã cũng nằm trong cụm di tích Thăng Long Tứ Trấn. Đây là một ngôi đền linh thiêng, mang trong mình lịch sử và văn hóa đặc trưng của dân tộc.",
    "location": "76 phố Hàng Buồm, Q. Hoàn Kiếm, TP. Hà Nội",
    "description": [
      {
        "title": "Thông tin chung",
        "content": [
          "Đền Bạch Mã là một trong số 'Tứ Trấn' của kinh thành Thăng Long xưa. Vị trí của đền nằm trên địa bàn huyện Thọ Xương, phủ Hoài Đức, hiện nay có địa chỉ số 76 phố Hàng Buồm, quận Hoàn Kiếm, thành phố Hà Nội.",
          "Từ trung tâm thành phố Hà Nội, bạn có thể đến đền Bạch Mã bằng các phương tiện: Xe ô tô hoặc xe máy, Xe buýt: bắt các tuyến xe buýt số 18, 32, 34 để đến điểm dừng xe buýt Trần Nhật Duật."
        ]
      },
      {
        "title": "Đền Bạch Mã thờ ai? Lịch sử đền Bạch Mã Hà Nội",
        "content": [
          "Đền Bạch Mã được xây dựng từ thế kỷ 9 để thờ và tôn vinh thần Long Đỗ. Vào thế kỷ X, trong khi đi chinh chiến đánh giặc dẹp loạn, Đinh Bộ Lĩnh đã đến đền Bạch Mã phía đông thành Đại La để cầu nguyện và hứa sẽ phong sắc thần nếu được như ý nguyện.",
          "Sau khi đánh bại quân thù và thống nhất đất nước, Đinh Tiên Hoàng - vua đầu tiên của triều đại nhà Đinh, đã mơ thấy một vị thần tự gọi mình là Thần Bạch Mã đã nhắc nhở rằng vua chưa tổ chức đúng nghi thức để tôn vinh thần. Lúc tỉnh giấc, vua liền phong tặng đền thờ thần Bạch Mã tên là Hộ Quốc Bảo Cảnh Linh Thông Tế Thế, Đô Đại Thành Hoàng Linh Lang Bạch Mã Đại Vương Thượng Đẳng Phúc Thần và cho xây dựng thêm một đền thờ Thần Linh Lang Bạch Mã ở quê hương Hoàng hậu Dương Thị Nguyệt.",
          "Trong thời kỳ triều Nguyễn, vua Đồng Khánh đã ban sắc phong cho thần Bạch Mã là Hàm Quang Thượng Đẳng Thần.",
          "Năm 1010, khi vua Lý Thái Tổ dời đô từ Hoa Lư ra Thăng Long, thành đắp nhiều lần nhưng vẫn sụp đổ cho đến khi vua cầu nguyện tại đền thờ thần Long Đỗ và được hướng dẫn bởi một con ngựa trắng từ đền đi ra. Vua đã theo vết chân của ngựa và xây dựng thành Thăng Long mới. Lúc này, thần được phong làm Thành hoàng của kinh thành.",
          "Tính đến thời điểm hiện tại, ngôi đền đã được tu bổ nhiều lần, trong đó có 2 đợt trùng tu lớn nhất là vào niên hiệu Chính Hòa đời Lê Hy Tông và năm Minh Mệnh thứ 20. Đền Bạch Mã ngày này là địa điểm tham quan nổi tiếng ở vùng đất thiêng với cảnh quan tôn nghiêm."
        ]
      },
      {
        "title": "Tìm hiểu kiến trúc đền Bạch Mã",
        "content": [
          "Vừa đặt chân tới đền Bạch Mã, du khách sẽ ngay lập tức bị cuốn hút bởi nền tường màu vàng nổi bật cùng cánh cửa bằng gỗ đỏ được chạm khắc hoa văn rồng vàng, tạo nên vẻ đẹp cổ kính, trang nghiêm cho ngôi đền.",
          "Nét kiến trúc đặc trưng bên trong đền là toàn bộ khung nhà gỗ với hệ thống cột gỗ lim lớn, bộ đỡ mái được chế tác theo phong cách 'giá chiêng chồng rường con nhị' với nét chạm khắc tỉ mỉ, chắc chắn.",
          "Nhà Đại Bái đền Bạch Mã đặt áng thờ, gây ấn tượng với hình ảnh rồng phượng sơn son thếp vàng được chạm khắc vô cùng tinh xảo. Những chi tiết đầu rồng, hoành phi, câu đối không chỉ được thếp vàng sáng bóng đẹp mắt mà còn rất tinh tế và sống động.",
          "Nội thất của ngôi đền này bao gồm phương đình ở phía trong, bên trái là cây hương, bàn thờ, miếu thờ Tề Vương Phi, còn ở bên phải thờ Bể Núi. Tại Thiêu hương và Cung cấm có ban thờ và đồ tế lễ, tất cả đều được sắp xếp gọn gàng, trang trọng.",
          "Bên cạnh đó, tại đây còn lưu giữ nhiều hiện vật quý giá mang giá trị lịch sử to lớn, bao gồm sắc phong, đôi phổng, chuông đồng, kiệu rước, độc bình, 15 tấm bia văn với các điển tích, thần thoại kể về việc xây dựng đền, những nghi lễ tôn thờ thần cùng với các lần tôn tạo trong hơn 1000 năm qua."
        ]
      },
      {
        "title": "Lễ hội đền Bạch Mã",
        "content": [
          "Lễ hội đền Bạch Mã kéo dài trong hai ngày, từ ngày 12 đến 13 tháng Hai Âm lịch hàng năm để tưởng nhớ công ơn của thần Long Đỗ. Ngày đầu tiên, đội rước kiệu di chuyển từ đền Mã Mây đến đền Bạch Mã với đầy đủ các đội như đội múa rồng, đội tế nam quan, đội tế nữ và mô hình trâu để làm lễ tiến Xuân Ngưu. Lễ hội khai mạc bằng lễ cáo thỉnh và tiếp đó là lễ tế Thánh.",
          "Ngày thứ hai, các đội tế nam và dâng hương nữ của các làng lân cận vào lễ Thánh, kết thúc bằng lễ tế giã hội của đội tế nam đền Bạch Mã. Ngoài ra, lễ hội còn tổ chức nhiều chương trình vui chơi, giải trí và biểu diễn nghệ thuật dân tộc đặc sắc."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Địa điểm tham quan gần đó",
        "content": [
          "Đền Bà Kiệu cách 1,6 km",
          "Bảo tàng Lịch sử Quốc gia cách 1,7 km",
          "Hồ Gươm cách 2,3 km",
          "Bốt Hàng Đậu cách 2,6 km",
          "TTTM Vincom Mega Mall Times City cách đó khoảng 6 km"
        ]
      }
    ]
  },
  "LANG PAGODA": {
    "name": "CHÙA LÁNG",
    "map": "116 phố Chùa Láng, P. Láng Thượng, Q. Đống Đa, Hà Nội",
    "type": "Di tích lịch sử, Địa điểm tâm linh",
    "introduction": "Chùa Láng là địa điểm du lịch tâm linh nổi tiếng ở Hà Nội. Thăng Long - Hà Nội được biết đến là trung tâm chính trị, tôn giáo của đất nước từ rất lâu đời. Qua hàng ngàn năm lịch sử, nơi đây đã gìn giữ biết bao đền chùa cổ kính, đóng vai trò quan trọng trong đời sống tinh thần của người dân. Trong số đó, không thể không nhắc đến ngôi chùa mang danh Đệ Nhất Tùng Lâm - Chùa Láng.",
    "location": "116 phố Chùa Láng, P. Láng Thượng, Q. Đống Đa, Hà Nội",
    "description": [
      {
        "title": "Thông tin chung",
        "content": [
          "Chùa Láng còn được biết đến với tên gọi khác là Chiêu Thiền tự. Ngôi chùa Hà Nội này cách trung tâm thành phố khoảng 5km.",
          "Giờ mở cửa: 8:30 - 20:00 mỗi ngày. Trong những ngày đặc biệt như rằm, mùng 1 và lễ, Tết, thời gian mở cửa sẽ được kéo dài hơn thời gian bình thường.",
          "Chùa Láng ở ngay gần trung tâm Thủ đô nên việc di chuyển đến đó rất thuận tiện. Bạn có thể chọn phương tiện như ô tô, xe máy, xe buýt hoặc taxi để đến chùa. Nếu sử dụng xe buýt, sẽ có các tuyến xe số 09 BCT, 55A, 55B, 26, 28 là có điểm dừng gần Chùa Láng."
        ]
      },
      {
        "title": "Chùa Láng thờ ai? Lịch sử Chùa Láng Đống Đa Hà Nội",
        "content": [
          "Tương truyền, Chùa Láng được khởi công xây dựng vào thời vua Lý Anh Tông (trị vì từ 1138 - 1175), thờ thiền sư Từ Đạo Hạnh. Theo dân gian, vị thiền sư này đã đầu thai làm con trai của nhà quý tộc Sùng Hiền Hầu (em vua Lý Nhân Tông), sau đó được nối ngôi làm vua Lý Thần Tông (trị vì từ 1128 - 1138) khi vua không có con.",
          "Vì sự tích ấy, Lý Anh Tông, con trai của Lý Thần Tông đã cho dựng nên chùa Láng để thờ phụ vương và tiền thân của ngài là Thiền sư Từ Đạo Hạnh. Chùa đã trải qua nhiều lần tu sửa, trong đó có các lần quan trọng nhất vào các năm 1656, 1901 và 1989."
        ]
      },
      {
        "title": "Khám phá kiến trúc Chùa Láng",
        "content": [
          "Theo các tài liệu ghi lại, Chùa Láng trước đây có tổng cộng 100 gian, được xây dựng theo phong cách kiến trúc nội công ngoại quốc. Kiểu kiến trúc này đã phổ biến ở Việt Nam từ thời xưa, với đặc điểm là có hai hành lang dài kết nối nhà tiền đường và hậu đường tạo thành một khung hình chữ nhật đóng kín, ở giữa có thể là nhà thiêu hương hoặc nhà thượng điện.",
          "Hiện nay, Chùa Láng vẫn giữ được sự uy nghi, bề thế với một quần thể công trình hài hòa và cân đối với không gian xung quanh. Sự kết hợp tinh tế giữa kiến trúc chùa với thiên nhiên, sân vườn và những cây cổ thụ tạo nên một không gian yên bình và tĩnh lặng. Chùa Láng trước đây từng được mệnh danh là 'Đệ Nhất Tùng Lâm', mang ý nghĩa là nơi có rừng thông đẹp bậc nhất ở khu vực phía Tây kinh thành Thăng Long.",
          "Khi đến tham quan ngôi chùa, du khách sẽ nhìn thấy cổng tam quan đầu tiên. Cổng tam quan của chùa có bốn cột vuông, phía trên là 3 mái vòm gắn liền với sườn cột chứ không phủ trùm lên trên. Kiểu kiến trúc này có sự tương đồng với cổng trong cung của phủ vua chúa.",
          "Nhà Bát Giác được xây dựng có mái chồng 2 tầng, 16 mái, trên đầu được đắp 8 con rồng tượng trưng cho 8 đời vua Lý. Sau đó là các công trình chính của chùa như Bái Đường, Thượng Điện, nhà thiêu hương, nhà Tổ và Tăng phòng.",
          "Ngoài ra, Chùa Láng còn nổi tiếng gần xa khi sở hữu 198 pho tượng lớn nhỏ quý giá, trong đó có tượng vua Lý Thần Tông ngồi trên ngai vàng và pho tượng Thiền Sư Từ Đạo Hạnh là gây ấn tượng mạnh mẽ nhất. Ngoài ra, chùa còn lưu giữ nhiều bảo vật quý giá khác như 31 câu đối, 39 bức hoành phi, 15 bia đá…"
        ]
      },
      {
        "title": "Lễ hội Chùa Láng Hà Nội",
        "content": [
          "Mỗi năm, vào ngày mồng 7 tháng 3 âm lịch, người dân tại phường Láng Thượng lại tiến hành tổ chức lễ hội Chùa Láng với nghi thức trang trọng. Đây cũng chính là ngày sinh của Thiền Sư Từ Đạo Hạnh. Lễ hội bao gồm nhiều hoạt động thú vị, nhưng đặc biệt là phần rước kiệu Thánh từ Chùa Láng đến chùa Hoa Lăng để thăm thân mẫu. Tại lễ hội, người ta còn tái hiện lại cuộc đấu thần giữa Thiền Sư Từ Đạo Hạnh và sư Đại Điên.",
          "Không chỉ có những nghi thức trang trọng, lễ hội còn có nhiều trò chơi dân gian đặc sắc như 'bịt mắt đập niêu', 'thi thổi cơm'… mang đến niềm vui, xây dựng tình đoàn kết cho người dân trong làng cũng như du khách đến dự."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Ẩm thực quanh chùa Láng",
        "content": [
          "Ốc luộc Chùa Láng: Món ăn đặc trưng của Chùa Láng mà bạn nhất định không thể bỏ qua chính là ốc luộc. Với việc luộc chung ốc với lá chanh, sả, ớt giúp tạo nên mùi thơm đặc trưng, hấp dẫn khó cưỡng.",
          "Thịt xiên nướng: Món thịt xiên nướng tại Chùa Láng được ví như là món ăn 'vạn người mê', trong đó có Hoàng Đức là quán thịt xiên nổi tiếng nhất tại đây.",
          "Bánh xèo: Các quán bánh xèo ở Chùa Láng đặc biệt được giới trẻ yêu thích và thường xuyên ghé thăm.",
          "Bún sườn chua: Mùi thơm dịu nhẹ thoang thoảng của bún kết hợp với miếng sườn mềm ngọt và nước dùng đậm đà.",
          "Mì hải sản: Khác với bún hải sản, mỳ hải sản sẽ đem đến cho bạn một trải nghiệm ẩm thực mới lạ và độc đáo hơn."
        ]
      }
    ]
  },
  "BA TRIEU TEMPLE": {
    "name": "ĐỀN BÀ TRIỆU",
    "map": "làng Phú Điền, huyện Hậu Lộc, Thanh Hóa",
    "type": "Di tích lịch sử, Địa điểm tâm linh",
    "introduction": "Đền Bà Triệu là một di tích lịch sử nổi tiếng, gần với nhiều địa điểm du lịch Thanh Hóa. Ngôi đền linh thiêng trải qua thời gian đã nhuốm màu phong sương, cổ kính, tuy nhiên, đây vẫn là điểm dừng chân lý tưởng để chiêm bái, vãn cảnh và khám phá kiến trúc độc đáo.",
    "location": "trên ngọn núi Gai, thuộc địa phận làng Phú Điền, huyện Hậu Lộc, Thanh Hóa",
    "description": [
      {
        "title": "Thông tin chung",
        "content": [
          "Đền thờ Bà Triệu, hay còn có tên gọi khác là đền thờ bà Triệu Thị Trinh – một trong những vị tướng anh hùng có công lao rất lớn trong việc đánh đuổi giặc Trung Quốc đến xâm chiếm bờ cõi nước ta vào thế kỷ III (TCN).",
          "Ngôi đền được xây dựng theo đúng kiến trúc của Bắc Trung Bộ, vừa trầm mặc, cổ kính nhưng cũng rất tinh tế. Hiện tại, nơi đây còn lưu giữ nhiều cổ vật, các kho tàng sự tích, ca dao, huyền thoại và cả những hiện vật hiếm có.",
          "Giá vé tham quan tham khảo: Miễn phí"
        ]
      },
      {
        "title": "Lịch sử đền Bà Triệu Thanh Hóa",
        "content": [
          "Đền Bà Triệu được vua Lý Nam Đế xây dựng vào thế kỷ VI. Công trình là nơi tưởng nhớ Bà Triệu Thị Trinh - vị nữ tướng anh hùng có công lao trong cuộc khởi nghĩa năm 248 chống quân Ngô xâm lược.",
          "Dưới thời vua Minh Mạng (thế kỷ XVIII), công trình này được chuyển tới vị trí hiện tại và giữ nguyên cho tới bây giờ. Trải qua thời gian, công trình cũng nhuốm màu phong sương, cổ kính, tuy nhiên, địa phương cũng có những dự án tu sửa hằng năm nhằm đáp ứng nhu cầu tham quan của khách trong và ngoài tỉnh."
        ]
      },
      {
        "title": "Kiến trúc đền Bà Triệu Hậu Lộc",
        "content": [
          "Di tích lịch sử đền Bà Triệu có kiến trúc độc đáo, mỗi khu vực đều có kiểu thiết kế riêng, tựu trung lại là một công trình quy mô, mang đậm nét văn hóa truyền thống của Bắc Trung Bộ. Cụ thể:",
          "Nghi môn ngoại: Khu vực này được xây bằng đá nguyên khối với kiểu tứ trụ độc đáo. Đỉnh cột có chim phượng lá lật, chi tiết lồng đèn được chạm hình tứ linh, bức tường hai bên được chạm nổi tượng voi chầu.",
          "Hồ nước: Chiều dài và chiều rộng của hồ lần lượt là 29.8m và 42.2m. Hồ tọa lạc đối diện với Nghi môn nội, có bậc thang lên xuống để thuận tiện cho việc tham quan.",
          "Bình phong: Chi tiết này được làm bằng đá nguyên khối, đặt ở phía trước Nghi môn trung.",
          "Nghi môn trung: Xây dựng theo kiến trúc tứ trụ, tương tự như kiến trúc của nghi môn ngoại.",
          "Sân dưới: Toạ lạc ở phần trước của nghi môn nội, chiều dài và chiều rộng lần lượt là 49.8m và 12m.",
          "Nghi môn nội: Được thiết kế tương tự như khu vực Tam Quan, hai bên cửa chính được đặt 2 bức tượng nghê chầu cổ bằng đá rất cổ kính.",
          "Tả/Hữu mạc: Tạo lạc ở khu vực sân trước của Tiền đường, mỗi nhà được xây dựng 5 gian, kèo làm bằng gỗ lim, nền lát gạch bát cổ.",
          "Tiền đường: Cấu trúc 3 gian 2 chái, từng chi tiết bên trong nhà, nóc nhá đều được chạm khắc tinh tế, trang trí đẹp mắt.",
          "Trung đường: Xây dựng theo kiến trúc gỗ 5 gian 2 tầng và có phần mái cong, nằm ngăn cách với khu vực nhà Tiền đường ở sân thượng. Công trình được trang trí với hoa lá, rồng hóa, đá vân mây đặc sắc…",
          "Hậu cung: Kiến trúc 3 gian 2 chái, chiều dài 2.45m và chiều rộng 6.9m. Hệ khung vì là ở hậu cung cũng được trang trí với nhiều bức tranh chạm nổi cầu kỳ, đẹp mắt."
        ]
      },
      {
        "title": "Lễ hội đền Bà Triệu",
        "content": [
          "Không chỉ là điểm du lịch tâm linh, chiêm bái, đền Bà Triệu còn là địa điểm tổ chức nhiều lễ hội Thanh Hóa nổi tiếng. Cụ thể, các lễ hội thường được tổ chức vào khoảng từ 21 – 24/2 âm lịch hằng năm, chứa đựng nhiều hoạt động văn hóa truyền thống của người Việt.",
          "Trong những sự kiện lễ hội, du khách và người dân có thể tham gia nhiều hoạt động như: rước kiệu, tế lễ, tế nữ quan… hay các trò chơi dân gian như: thổi cơm, thi đấu vật, đánh cờ tướng…"
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Địa điểm du lịch gần đền Bà Triệu",
        "content": [
          "Khu lăng mộ Bà Triệu: Nằm trên đỉnh núi Tùng, thuộc địa phận, địa phận xã Triệu Lộc, huyện Hậu Lộc, Thanh Hóa",
          "Núi Hàm Rồng: Địa phận làng Dương Xá, thuộc xã Thiệu Dương, huyện Thiệu Hóa, Thanh Hóa",
          "Bãi biển Hải Tiến: Thuộc địa phận của huyện Hoằng Hóa, tỉnh Thanh Hóa",
          "Bãi biển Sầm Sơn: Thuộc địa phận của thành phố Sầm Sơn, tỉnh Thanh Hóa"
        ]
      }
    ]
  },
  "DUONG LAM ANCIENT VILLAGE": {
    "name": "LÀNG CỔ ĐƯỜNG LÂM",
    "map": "X.Đường Lâm, Sơn Tây, Hà Nội",
    "type": "Làng cổ, Di tích lịch sử",
    "introduction": "Làng cổ Đường Lâm - ngôi làng cổ lâu đời ở Hà Nội. Đến du lịch Hà Nội, tham quan các công trình kiến trúc, khám phá nét văn hóa đặc sắc thì làng cổ Đường Lâm chính là địa điểm bạn nhất định phải ghé.",
    "location": "X.Đường Lâm, Sơn Tây, Hà Nội",
    "description": [
      {
        "title": "Thông tin chung",
        "content": [
          "Làng cổ Đường Lâm thuộc địa phận thị xã Sơn Tây, chỉ cách trung tâm Thủ đô Hà Nội khoảng 44km. Ngôi làng cổ ở Hà Nội này nằm ở phía Nam sông Hồng, ngay cạnh ngã ba giao giữa đường mòn Hồ Chí Minh với quốc lộ 32.",
          "Nằm cách Thủ đô không quá xa, việc di chuyển đến làng cổ Đường Lâm cũng rất thuận tiện, dễ dàng."
        ]
      },
      {
        "title": "Di chuyển",
        "content": [
          "Xe buýt: là cách di chuyển đến Đường Lâm an toàn và tiết kiệm nhất. Từ Hà Nội bạn có thể lựa chọn 1 trong các tuyến xe buýt đến làng cổ Đường Lâm là xe số 71 (Mỹ Đình - bến xe Sơn Tây), xe số 73 (Mỹ Đình - chùa Thầy), xe số 89 (bến xe Yên Nghĩa - bến xe Sơn Tây)... Giá vé rất phải chăng chỉ từ 9.000 - 20.000 VNĐ/lượt.",
          "Xe máy, ô tô cá nhân: đây là lựa chọn phù hợp với những bạn thích chủ động. Cung đường đến làng cổ cũng khá dễ đi, thuận tiện.",
          "Xe khách: đây cũng là một trong những hình thức di chuyển được nhiều du khách lựa chọn. Xuất phát từ Hà Nội, bạn có thể bắt tuyến xe Mỹ Đình - Phú Thọ để đến làng cổ Đường Lâm."
        ]
      },
      {
        "title": "Điểm tham quan nổi bật",
        "content": [
          "Cổng làng Mông Phụ: Nơi đây được xây dựng vào năm 1833 với kiến trúc vòm và lớp đá ong tổ mang đậm nét văn hóa kiến trúc thời nhà Lê. Bên cạnh cổng còn có cây đa hơn 300 năm tuổi.",
          "Đình làng cổ Đường Lâm: Được xây dựng từ năm 1684 mang đậm nét kiến trúc Việt – Mường với nhà sàn và sàn gỗ cách đất. Nơi này gồm Nghi Môn, sân đình, 2 tòa Tả Mạc và Hữu Mạc hai bên, ở giữa là tòa Đại đình.",
          "Giếng cổ Đường Lâm: Du lịch làng cổ Đường Lâm bạn có thể bắt gặp rất nhiều giếng cổ. Nước ở đây rất trong và cũng là nơi người dân lấy nước sinh hoạt hằng ngày.",
          "Nhà thờ Thám hoa Giang Văn Minh: Nơi đây được xây dựng từ thời vua Tự Đức, là nơi thờ phụng và tưởng nhớ công ơn của Thám hoa Giang Văn Minh.",
          "Nhà cổ bà Điền: Ngôi nhà có tuổi đời 200 năm, in đậm dấu ấn của thời gian qua những lớp rêu bám, những viên ngói vỡ, nhạt màu hay thậm chí phong cách trang trí nhà cũng mang đậm nét cổ xưa.",
          "Nhà cổ ông Hùng: Nơi đây có tuổi đời gần 400 năm và đã trải qua 12 thế hệ sinh sống.",
          "Lăng và đền thờ Ngô Quyền: Quần thể đền và lăng Ngô Quyền được xây dựng trên đồi Cấm, tuy có diện tích nhỏ nhưng khuôn viên được chăm sóc tỉ mỉ."
        ]
      },
      {
        "title": "Ẩm thực",
        "content": [
          "Gà mía: loại gà có chân nhỏ, lông vàng, khi luộc chín thịt có màu trắng, da vàng và giòn.",
          "Thịt quay đòn: nổi tiếng không chỉ về hương vị khác biệt mà còn bởi cách chế biến vô cùng độc đáo và cầu kỳ.",
          "Chè kho: làm từ đỗ xanh đã được đồ lên, rồi cho thêm đường vào, dùng đũa cái to đảo thật đều tới khi những hạt đỗ nát ra, láng mịn.",
          "Tương gạo: là món ăn dân dã, phổ biến được làm từ gạo, đỗ tương, muối, nước lấy từ giếng làng…",
          "Kẹo vừng, dồi, lạc: loại kẹo được làm từ các nguyên liệu dân dã như: lạc, vừng, đường, mạch nha…",
          "Bánh tẻ: bánh tẻ ở đâu cũng có nhưng ở Đường Lâm lại có nhiều nét khác biệt so với những vùng miền khác."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Thông tin tham quan",
        "content": [
          "Giá vé vào làng cổ Đường lâm là 20.000 VNĐ/người lớn, 20.000 VNĐ/trẻ em trên 14 tuổi, miễn phí trẻ em dưới 14 tuổi.",
          "Thời điểm nên đi: bạn có thể đến tham quan làng cổ Đường Lâm bất cứ thời điểm nào trong năm. Tuy nhiên, mùa lễ hội và mùa lúa chín là thời điểm lý tưởng, đẹp và thú vị nhất."
        ]
      }
    ]
  },
  "BAT TRANG POTTERY VILLAGE": {
    "name": "LÀNG GỐM BÁT TRÀNG",
    "map": "xã Bát Tràng, huyện Gia Lâm, Hà Nội",
    "type": "Làng nghề truyền thống",
    "introduction": "Làng gốm Bát Tràng được hình thành từ thời Lý, nằm ở tả ngạn sông Hồng. Sau gần 1000 năm tồn tại và phát triển, Làng gốm Bát Tràng ngày nay trở thành trung tâm sản xuất gốm sứ có quy mô chuyên nghiệp, với nhiều công ty lớn được thành lập bên cạnh những đơn vị sản xuất nhỏ theo hộ gia đình.",
    "location": "xã Bát Tràng, huyện Gia Lâm, Hà Nội",
    "description": [
      {
        "title": "Giới thiệu chung",
        "content": [
          "Theo Đại Việt sử ký toàn thư và Dư địa chí của Nguyễn Trãi, Làng gốm Bát Tràng được hình thành từ thời Lý.",
          "Ngoài các mặt hàng phục vụ đời sống tâm linh, cúng bái của người Việt, các lò gốm ở Bát Tràng còn làm ra sản phẩm tiêu dùng, trang trí, trưng bày với mẫu mã, kiểu dáng, và chất liệu hiện đại hơn.",
          "Các tuyệt phẩm gốm Bát Tràng hiện nay đã có mặt khắp nơi trên thị trường Việt Nam, và còn được xuất khẩu sang nhiều nước ở châu Âu, châu Á.",
          "Điều thú vị nhất khi đến Làng gốm Bát Tràng là được xem các nghệ nhân thực hiện quy trình chế tạo gốm hết sức cầu kỳ, tỉ mỉ. Ngoài ra, bạn còn được trải nghiệm làm những sản phẩm gốm mà mình yêu thích."
        ]
      },
      {
        "title": "Lịch sử",
        "content": [
          "Làng gốm Bát Tràng nằm tại xã Bát Tràng, bao gồm thôn Giang Cao và thôn Bát Tràng, thuộc huyện Gia Lâm, thành phố Hà Nội.",
          "Theo các ghi chép lịch sử, khi nhà Lý dời đô từ Hoa Lư về Thăng Long, dân Bát tràng đã di cư theo. Khi đến gần kinh đô, thấy vùng đất bồi ven sông Hồng màu mỡ, họ quyết định định cư ở đó và cùng nhau tạo ra nghề làm gốm.",
          "Suốt gần 1000 năm lịch sử, làng gốm đã trải qua nhiều biến cố và thăng trầm. Tuy nhiên, nhờ sự bền vững và sự chăm chỉ của những người dân và nghệ nhân tại đây, làng gốm vẫn tồn tại và phát triển cho đến ngày nay."
        ]
      },
      {
        "title": "Điểm tham quan",
        "content": [
          "Làng Cổ Bát Tràng: Dạo quanh khu vực làng cổ, đi dọc đường đê, hay len vào những con ngõ nhỏ là một trong những điều thú vị khi đến Làng gốm Bát Tràng.",
          "Chợ Gốm Bát Tràng: Khu chợ rộng 6.000m2 này bày bán rất nhiều các sản phẩm gốm sứ, từ đồ trang trí mỹ nghệ, quà lưu niệm, cho đến đồ tiêu dùng, thờ cúng, tiểu cảnh non bộ.",
          "Nhà Cổ Vạn Vân: Là nơi lưu giữ sản phẩm của các làng nghề, nhiều nhất là gốm sứ Bát Tràng. Nằm ở cuối làng Bát Tràng, ngôi nhà cổ thích hợp để bạn ghé đến nghỉ chân, chiêm ngưỡng bộ sưu tập hơn 400 món đồ gốm sứ cổ quý giá có niên đại khoảng 500 năm.",
          "Bảo Tàng Gốm Bát Tràng: Tọa lạc ở thôn 5, xã Bát Tràng, Bảo tàng gốm Bát Tràng là một địa điểm check-in mới với 7 xoáy ốc khổng lồ đấu vào nhau, dựa trên ý tưởng bàn xoay vuốt gốm.",
          "Lò Bầu Cổ: Ngày nay, trong làng gốm Bát Tràng vẫn còn tồn tại 5 lò bầu lâu đời, đã tồn tại hơn gần 100 năm và được coi là những di sản cuối cùng của làng gốm này."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Trải nghiệm",
        "content": [
          "Trải nghiệm làm gốm: Đăng ký chơi làm gốm với giá khoảng 10.000đ/lượt. Với chiếc bàn gốm xoay, và được chỉ dẫn tận tình về cách tạo hình, tạo mẫu, bạn đã có thể thử tài nặn gốm, và sáng tạo theo ý mình.",
          "Tham quan quy trình sản xuất gốm: Để làm ra một sản phẩm gốm sứ Bát Tràng hoàn hảo, các nghệ nhân Bát Tràng phải trải qua hai công đoạn chính: tạo cốt gốm và họa tiết, sau đó là phủ men.",
          "Thưởng thức ẩm thực: Bát Tràng không chỉ có đặc sản đồ gốm, mà còn được biết với món canh măng mực - một món ăn 'lên rừng xuống biển' khi kết hợp giữa măng và mực rất đặc sắc."
        ]
      },
      {
        "title": "Di chuyển",
        "content": [
          "Xe Buýt: Từ khu vực trung tâm (bến xe Long Biên), bạn bắt xe buýt số 47A hoặc xe buýt điện Ecopark 02, cả hai tuyến đều có điểm dừng ngay tại cổng làng Bát Tràng.",
          "Ô Tô Hoặc Xe Máy: Từ quận Cầu Giấy, bạn nên chọn hướng đi qua cầu Long Biên hoặc cầu Chương Dương. Đi qua hết cầu, bạn rẽ phải và tiếp tục đi dọc theo đường đường đê sông Hồng là đến cổng làng Bát Tràng."
        ]
      }
    ]
  },
  "VAN PHUC SILK VILLAGE": {
    "name": "LÀNG LỤA VẠN PHÚC",
    "map": "phường Vạn Phúc, quận Hà Đông, Hà Nội",
    "type": "Làng nghề truyền thống",
    "introduction": "Làng Vạn Phúc là làng nghề ở Hà Nội, mang vẻ đẹp cổ kính, nổi tiếng với các sản phẩm lụa dệt tơ tằm chất lượng và sở hữu nhiều điểm check-in sống ảo thu hút giới trẻ cùng khách du lịch.",
    "location": "phường Vạn Phúc, quận Hà Đông, Hà Nội",
    "description": [
      {
        "title": "Giới thiệu chung",
        "content": [
          "Làng dệt lụa Vạn Phúc thuộc phường Hà Đông, Hà Nội. Làng lụa đã tồn tại hơn 1000 năm và nằm trong số những làng dệt lụa nổi tiếng, đẹp nhất Việt Nam.",
          "Đường di chuyển đến làng Vạn Phúc là đường bê tông nên bạn có thể dễ dàng đến đây. Từ trung tâm thành phố, bạn có thể lựa chọn cung đường đi Nguyễn Trãi - Bưu điện Hà Đông rồi rẽ phải sẽ đến làng."
        ]
      },
      {
        "title": "Lịch sử",
        "content": [
          "Là một trong những làng nghề truyền thống nổi tiếng ở Hà Nội, làng lụa Vạn Phúc có lịch sử lâu đời, tồn tại hơn 1000 năm. Tên gọi trước kia của làng là Vạn Bảo, nhưng do kỵ húy nên đã được đổi thành Vạn Phúc.",
          "Năm 1931 là dấu mốc đánh dấu lần đầu tiên sản phẩm lụa dệt ở làng được quảng bá, giới thiệu ra thị trường quốc tế. Ở lần đầu tiên giới thiệu, sản phẩm lụa dệt của làng Vạn Phúc đã được người Pháp đánh giá cao, nhận xét là một trong những dòng lụa tinh xảo nhất của Đông Dương.",
          "Vào năm 1958, sản phẩm tơ lụa của làng đã chính thức được xuất khẩu tới các nước Đông Âu."
        ]
      },
      {
        "title": "Sản phẩm",
        "content": [
          "Theo dòng lịch sử lâu đời, các sản phẩm của làng lụa Vạn Phúc đến nay vẫn duy trì vẻ đẹp truyền thống và được biến tấu, cải tiến mỗi ngày một đa dạng, bắt mắt hơn.",
          "Sản phẩm tơ lụa Vạn Phúc luôn được đánh giá tốt, vừa đẹp vừa bền. Nguyên liệu của sản phẩm chủ yếu làm từ tơ tằm nên có độ mềm mại, dẻo dai đặc trưng.",
          "Hoa văn trang trí trên lụa được thể hiện tinh tế, sáng tạo qua tay nghề người thợ như long phượng, đũi hoa, vân thọ đỉnh, tứ quế, mây bay,…",
          "Mỗi năm, tơ lụa Vạn Phúc Hà Đông xuất khẩu khoảng 2,5 đến 3 triệu mét vuông vải."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Trải nghiệm",
        "content": [
          "Check-in con đường ô: Con đường ô lung linh, rực rỡ sắc màu ngay đầu cổng làng. Phía trên đầu của con đường 100m được trang trí bằng những chiếc ô nhựa đầy đủ màu sắc.",
          "Tham quan chùa Vạn Phúc: Ngôi chùa nằm ở vị trí ngay sát bên trái cổng làng với lối kiến trúc cổ kính của những ngôi chùa miền Bắc.",
          "Chụp ảnh với bức tường bích họa: Những bức tường trong làng được các cô giáo mầm non khoác lên một màu áo mới đầy sắc màu.",
          "Khám phá chợ lụa Vạn Phúc: Khu chợ là nơi giới thiệu, quảng bá các sản phẩm tơ lụa của làng tới du khách.",
          "Tham gia lễ hội: Lễ hội ở làng tổ chức theo 3 phần chính là phần lễ, phần hội và phần quảng bá, diễn ra từ 26/10 đến 2/11 hằng năm."
        ]
      }
    ]
  },
  "BELL VILLAGE": {
    "name": "LÀNG CHUÔNG",
    "map": "xã Phương Trung, huyện Thanh Oai, Hà Nội",
    "type": "Làng nghề truyền thống",
    "introduction": "Làng Chuông là một làng nghề nổi tiếng cả nước với truyền thống làm nón lâu đời thông qua sản phẩm nón lá. Người dân làng Chuông sống chủ yếu bằng nghề làm nón lá còn hoạt động làm nông nghiệp không nhiều vì nơi đây đất chật người đông.",
    "location": "xã Phương Trung, huyện Thanh Oai, Hà Nội",
    "description": [
      {
        "title": "Giới thiệu chung",
        "content": [
          "Làng nón Chuông tọa lạc tại xã Quốc Trung huyện Thanh Oai cách trung tâm thủ đô Hà Nội khoảng 30 km. Làng Chuông thường được biết với tên gọi khác là làng nón lá Thanh Oai với diện tích trên 481 ha gồm 8 thôn dân cư.",
          "Làng Chuông có hai hướng đi đến là quốc lộ 21B phía Đông ranh giới làng và đường đê sông Đáy phía Tây ranh giới làng."
        ]
      },
      {
        "title": "Lịch sử làng nghề",
        "content": [
          "Là một làng nghề ở Hà Nội lâu đời, không ai biết chính xác làng Chuông làm nón cụ thể từ năm nào. Tuy nhiên theo lời những cụ bô lão trong làng, từ thế kỉ thứ 8 thì làng đã bắt đầu sản xuất nón.",
          "Thuở đó, làng Chuông có tên gọi là Trang Thì Trung, chuyên làm các loại nón cho hầu hết mọi tầng lớp khác nhau trong xã hội.",
          "Trong thời kỳ phát triển, làng Chuông Hà Nội là nơi cung cấp nhiều loại nón truyền thống như nón quai thao, nón lá giá ghép sống.",
          "Hiện tại, có hơn 4000 hộ dân ở làng Chuông đan nón lá đem đến những sản phẩm giá rẻ, mẫu mã phong phú cho khách hàng trong nước và quốc tế."
        ]
      },
      {
        "title": "Đặc điểm nón làng Chuông",
        "content": [
          "Nguyên liệu chính để làm cái nón lá là lá cọ tươi nhập từ một số tỉnh Quảng Bình, Quảng Trị, còn chỉ và khung nón đan bằng nan tre có ở địa phương.",
          "Lá cọ tươi khá nặng và có hàm lượng cao cho nên người thợ cần phơi khoảng 3 nắng to làm nước bay hơi thì mới bắt tay vào sản xuất.",
          "Để tạo ra nón đẹp trước hết cần có khung vững chắc. Khung chủ yếu được đan bởi nan nứa và vật liệu này có nhiều dọc hai bờ đê sông Đáy.",
          "Cái tài của người thợ làng Chuông là các mối kết nối dây đan đều giấu kín bằng từng đường chỉ tinh tế.",
          "Trong khi làm nón, các cô gái làng Chuông trang trí thêm bằng việc dán vào thân nón những họa tiết hoa bằng giấy đủ màu."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Trải nghiệm",
        "content": [
          "Tham gia các lễ hội: Lễ hội hàng năm lớn nhất của làng Chuông nón lá là lễ hội vào ngày 10 tháng 3 âm lịch, kéo dài ba ngày từ mồng 9 đến 11 tháng 3.",
          "Tham quan chợ Chuông: Chợ làng Chuông ngày nào cũng mở, riêng chợ nón một tháng có sáu phiên, vào các dịp mùng 4, 10, 14, 20, 24 và 30 âm lịch.",
          "Tham quan Đình làng Chuông: Ngôi đình làng Chuông được xây dựng từ lâu đời vào năm Giáp Ngọ 1894, dưới thời vua Thành Thái thứ 6.",
          "Dạo quanh chùa làng nón Chuông: Làng nón Chuông khoác trên mình một nét cổ kính nhuộm màu thời gian mang đặc trưng của những ngôi làng cổ ở Hà Nội."
        ]
      },
      {
        "title": "Ẩm thực",
        "content": [
          "Bánh cuốn làng Chuông: Làng nón Chuông có món bánh cuốn rất nổi tiếng khắp vùng.",
          "Bánh đúc lạc: Tại chợ Chuông còn có món bánh đúc lạc cũng được bán nhiều trong mỗi buổi chợ."
        ]
      },
      {
        "title": "Di chuyển",
        "content": [
          "Từ Hà Nội du khách đi theo đường quốc lộ 6 theo hướng đi Hoà Bình. Sau khi đi theo hướng Chùa Hương cách thị trấn Kim Bài vào khoảng 2km rồi rẽ phải vào tại ngã ba là đã tới Làng nón Chuông ngay bên bờ sông Đáy."
        ]
      }
    ]
  },
  "PHU DONG VILLAGE": {
    "name": "LÀNG PHÙ ĐỔNG",
    "map": "xã Phù Đổng, huyện Gia Lâm, Hà Nội",
    "type": "Di tích lịch sử, Địa điểm tâm linh",
    "introduction": "Đền Gióng Phù Đổng là ngôi đền cổ kính mang đậm chất kiến trúc truyền thống Việt Nam. Nơi đây gắn liền với truyền thuyết về vị anh hùng dân tộc Thánh Gióng. Mỗi không gian trong đền đều gợi lên niềm tự hào về lịch sử dân tộc trong lòng du khách.",
    "location": "xã Phù Đổng, huyện Gia Lâm, Hà Nội",
    "description": [
      {
        "title": "Giới thiệu chung",
        "content": [
          "Đền Gióng Phù Đổng (Đền Phù Đổng) nằm ở xã Phù Đổng, huyện Gia Lâm, Hà Nội. Đây là một vùng đất giàu truyền thống lịch sử ở Thủ đô.",
          "Ngôi đền hướng mặt về phía Nam, nằm tựa lưng đê sông Đuống, tạo nên khung cảnh vừa nên thơ vừa cổ kính.",
          "Ngôi đền là quần thể kiến trúc gồm nhiều hạng mục như cổng ngũ môn, thủy đình, tiền đường, trung đường và hậu cung.",
          "Đền Phù Đổng còn là ngôi đền biểu tượng gắn liền với truyền thuyết Thánh Gióng nổi tiếng."
        ]
      },
      {
        "title": "Lịch sử hình thành",
        "content": [
          "Đền Gióng Phù Đổng thuộc khu di tích lịch sử Phù Đổng và được xây dựng để tưởng nhớ đến Thánh Gióng - Vị anh hùng dân tộc có công đuổi giặc Ân xâm lược.",
          "Thời Vua Hùng Vương: Đền Gióng Phù Đổng được xây dựng để thờ Thánh Gióng. Theo truyền thuyết lưu truyền thì đền được xây dựng trên nền nhà của mẹ Thánh Gióng.",
          "Cuối thế kỷ XI: Dưới triệu đại của Vua Lý Thái Tổ, Đền Gióng Phù Đổng lần đầu tiên được tu bổ. Đền trở thành địa điểm tổ chức lễ hội Gióng hàng năm.",
          "Thế kỷ XVII: Trong thời kỳ Lê Trung Hưng, Thủy đình của đền được xây dựng, ứng dụng nghệ thuật chạm khắc tinh vi.",
          "Hiện nay, Đền Gióng Phù Đổng đang lưu giữ 21 đạo sắc phong từ nhiều triều đại như triều đại Lê, Tây Sơn và Nguyễn."
        ]
      },
      {
        "title": "Truyền thuyết Thánh Gióng",
        "content": [
          "Thánh Gióng, hay còn gọi là Phù Đổng Thiên Vương, là một trong bốn vị thánh bất tử trong tín ngưỡng dân gian Việt Nam.",
          "Truyền thuyết về Thánh Gióng gắn liền với thời Vua Hùng thứ Sáu và được người dân lưu truyền từ bao đời nay.",
          "Chuyện kể rằng, có một người phụ nữ 60 tuổi sau khi bước vào dấu chân khổng lồ đã mang thai và sinh ra cậu bé Gióng. Lên ba tuổi, cậu bé Gióng vẫn không biết nói, biết đi.",
          "Khi giặc Ân xâm lược, Gióng bất ngờ yêu cầu Vua Hùng rèn cho mình ngựa, gươm, giáp sắt. Sau khi được ăn no, Gióng lớn nhanh như thổi và lên đường đánh bại giặc Ân.",
          "Sau khi chiến thắng, ông cởi giáp và bay thẳng lên trời. Về sau, ông được người dân tôn thờ thành biểu tượng anh hùng của dân tộc."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Tham quan",
        "content": [
          "Kiến trúc độc đáo: Kiến trúc của Đền Gióng Phù Đổng mang hình chữ 'công', có quy mô rộng lớn, kết hợp giữa các yếu tố cổ kính và thiên nhiên.",
          "Xem cổ vật: Đền Gióng Phù Đổng là nơi lưu giữ nhiều cổ vật có giá trị lịch sử cao. Trong đó, cổ vật nổi bật trong đền phải nhắc đến là 37 đạo sắc phong, các bia đá, tượng thờ, long ngai, kiệu.",
          "Tham gia lễ hội: Lễ hội Đền Phù Đổng diễn ra từ ngày 6 đến ngày 9 tháng 4 Âm lịch hằng năm, thu hút đông đảo người dân địa phương và du khách tham gia."
        ]
      },
      {
        "title": "Di chuyển",
        "content": [
          "Xe buýt: Bạn có thể chọn đi bằng xe buýt với xe buýt 10B từ Long Biên đến Trung Mầu (điểm kế cuối là Phù Đổng).",
          "Phương tiện cá nhân: Đền Gióng Phù Đổng cách trung tâm thành phố khoảng 17km. Xuất phát từ khu vực Hồ Gươm, di chuyển theo đường Trần Quang Khải, qua cầu Chương Dương, đi thẳng theo Quốc lộ 5 khoảng 8km, rẽ phải vào Quốc lộ 1A (đường Phù Đổng)."
        ]
      },
      {
        "title": "Lưu ý",
        "content": [
          "Trang phục lịch sự khi tham quan đền",
          "Đi nhẹ nói khẽ, giữ yên tĩnh",
          "Không chụp ảnh khu vực điện thờ",
          "Không chạm tay vào hiện vật",
          "Bảo quản tư trang cá nhân cẩn thận"
        ]
      }
    ]
  },
  "SUGAR CANE PAGODA": {
    "name": "CHÙA MÍA",
    "map": "xã Đường Lâm, thị xã Sơn Tây, Hà Nội",
    "type": "Di tích lịch sử, Chùa cổ",
    "introduction": "Chùa Mía Sơn Tây là viên ngọc cổ kính ở làng cổ Đường Lâm. Nơi đây nổi bật với kiến trúc truyền thống và hệ thống tượng Phật phong phú. Không chỉ là điểm đến tâm linh, ngôi chùa còn mang đậm dấu ấn lịch sử và văn hóa.",
    "location": "xã Đường Lâm, thị xã Sơn Tây, Hà Nội",
    "description": [
      {
        "title": "Giới thiệu chung",
        "content": [
          "Chùa Mía hay còn gọi là Sùng Nghiêm Tự tọa lạc trên khu đất cao gần sông Tích. Ngôi chùa quay hướng Tây Nam, mang ý nghĩa vừa hướng đến trí tuệ (Nam) vừa mong thần linh yên vị (Tây).",
          "Đây là một trong những ngôi cổ tự tiêu biểu của xứ Đoài, vẫn giữ được kiến trúc truyền thống nguyên bản đến ngày nay.",
          "Chùa Mía gắn liền với vùng đất sinh ra nhiều danh nhân như Ngô Quyền, Phùng Hưng, Lý Bí.",
          "Chùa còn nổi tiếng là nơi lưu giữ số lượng tượng nghệ thuật lớn nhất Việt Nam với 287 pho tượng."
        ]
      },
      {
        "title": "Lịch sử",
        "content": [
          "Ban đầu, Chùa Mía chỉ là một ngôi chùa nhỏ, có từ rất lâu đời. Đến năm 1632, nơi đây rơi vào tình trạng hoang phế.",
          "Năm 1632, phi tần Ngô Thị Ngọc Diệu (còn gọi là Nguyễn Thị Ngọc Dong) – ở làng Nam Nguyễn (Nam An), đã cùng cha mẹ và người dân trong vùng đứng ra trùng tu, mở rộng quy mô chùa.",
          "Nhờ công lao trùng tu, bà được nhân dân tôn kính gọi là 'Bà Chúa Mía'.",
          "Trải qua nhiều lần tu bổ, nhưng đến nay, kiến trúc từ thời Bà Chúa Mía vẫn được giữ gìn nguyên vẹn."
        ]
      },
      {
        "title": "Kiến trúc",
        "content": [
          "Chùa Mía mang đậm dấu ấn kiến trúc chùa Việt truyền thống, với bố cục hài hòa và quy mô bề thế.",
          "Chùa được xây dựng theo dáng chữ Mục, chia thành ba khu vực riêng biệt: khoảng sân vườn thoáng đãng, khu nội điện trang nghiêm và dãy hành lang La Hán bao quanh.",
          "Bước qua cổng tam quan, du khách sẽ thấy dãy nhà thụ trai – nơi các nhà sư sinh hoạt.",
          "Khu vực chính điện gồm nhiều hạng mục quan trọng như Bái đường, chùa Hạ, chùa Trong và Thượng điện."
        ]
      },
      {
        "title": "Hệ thống tượng Phật",
        "content": [
          "Chùa Mía được xem là một kho tàng điêu khắc Phật giáo quý giá với 287 pho tượng nhiều kích thước và chất liệu khác nhau.",
          "Trong đó, có 6 pho tượng được đúc bằng đồng, 106 pho tượng chạm khắc từ gỗ và 174 pho tượng bằng đất luyện, được sơn son thếp vàng tinh xảo.",
          "Những pho tượng tiêu biểu: Tượng Tuyết Sơn, Tượng Bá Đại Hòa Thượng, Tượng bà Chúa Mía, Tượng Quan Âm Nam Hải."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Tham quan",
        "content": [
          "Chiêm ngưỡng kiến trúc: Khám phá kiến trúc truyền thống độc đáo của chùa Mía",
          "Xem hệ thống tượng: Chiêm ngưỡng 287 pho tượng quý giá",
          "Tham quan tháp Cửu Phẩm Liên Hoa: Tháp cao 13 mét, gồm 9 tầng, được xây dựng để thờ vọng Xá Lợi Đức Phật",
          "Dạo quanh hành lang La Hán: Dãy hành lang dài 140 mét, nơi đặt tượng Thập Bát La Hán"
        ]
      },
      {
        "title": "Lễ hội",
        "content": [
          "Thời điểm sôi động và đông vui nhất là vào tháng Giêng đầu năm",
          "Vào những ngày lễ, rằm lớn, chùa Mía thu hút đông đảo người dân đến chiêm bái, cầu nguyện"
        ]
      },
      {
        "title": "Di chuyển",
        "content": [
          "Xe buýt: Tuyến xe buýt số 70A từ Kim Mã đến Sơn Tây, sau đó chuyển sang tuyến xe buýt số 92 đi Phú Cường",
          "Phương tiện cá nhân: Từ trung tâm Hà Nội di chuyển khoảng 45km về phía Tây"
        ]
      },
      {
        "title": "Lưu ý",
        "content": [
          "Trang phục lịch sự, kín đáo",
          "Giữ gìn vệ sinh và trật tự",
          "Không tự ý chạm vào hiện vật, tượng thờ",
          "Giờ mở cửa: 07:00 đến 17:00 hàng ngày"
        ]
      }
    ]
  },
  "CU DA ANCIENT VILLAGE": {
    "name": "LÀNG CỔ CỰ ĐÀ",
    "map": "xã Cự Khê, huyện Thanh Oai, Hà Nội",
    "type": "Làng cổ, Làng nghề truyền thống",
    "introduction": "Cự Đà là một ngôi làng cổ thuộc xã Cự Khê, huyện Thanh Oai, thành phố Hà Nội. Nằm bên bờ sông Nhuệ thanh bình, làng Cự Đà mang đậm dấu ấn của làng quê Bắc Bộ Việt Nam với những mái đình, cổng làng, cây đa, đặc biệt là lối kiến trúc kiểu Pháp cổ kính.",
    "location": "xã Cự Khê, huyện Thanh Oai, Hà Nội",
    "description": [
      {
        "title": "Giới thiệu chung",
        "content": [
          "Làng Cự Đà cách trung tâm thành phố chỉ khoảng 20km, một khoảng cách không quá xa thích hợp để bạn lựa chọn làm địa điểm vui chơi cuối tuần ở Hà Nội cùng gia đình, bạn bè.",
          "Nếu làng cổ Đường Lâm nổi tiếng với lối kiến trúc nhà kiểu nông thôn 'ba gian hai chái' của vùng cận trung du thì làng Cự Đà lại mang phong cách làng nghề ven đô, ven sông điển hình theo kiến trúc Pháp pha trộn với kiểu nhà Việt cổ truyền thống."
        ]
      },
      {
        "title": "Kiến trúc độc đáo",
        "content": [
          "Làng Cự Đà được quy hoạch theo cấu trúc hình xương cá. Từ đường chính toả ra hàng chục con ngõ nhỏ dẫn vào các xóm.",
          "Trước đây, làng Cự Đà có hàng trăm ngôi nhà cổ nhưng hiện nay chỉ còn lưu giữ khoảng 50 ngôi nhà có tuổi đời hàng trăm năm mang lối kiến trúc độc, lạ.",
          "Với thiết kế 2 tầng, có ban công, mang phong cách phương tây nhưng nhiều ngôi nhà trong làng lại có mái hiên cong vút như mái đình.",
          "Phong cách Pháp cổ điển không hề đối lập với phong cách của những ngôi nhà truyền thống. Trái lại nó tạo ra một lối kiến trúc mà không bất cứ ngôi làng nào Việt Nam có được."
        ]
      },
      {
        "title": "Nghề truyền thống",
        "content": [
          "Nghề làm miến dong: Làng Cự Đà được đánh giá là một trong những làng làm miến lớn nhất miền Bắc. Miến làng Cự Đà được làm hoàn toàn từ bột dong riềng với sợi miến nhỏ, đều, thường có màu vàng óng hoặc trắng mịn nấu lên giòn, dai hương vị thơm ngon đậm đà.",
          "Nghề làm tương: Người dân Cự Đà vẫn luôn tự hào về nghề làm tương đã có từ hàng trăm năm nay với câu ca danh truyền 'Tương Cự Đà, cà làng Đám'. Tương Cự Đà được làm từ hai nguyên liệu chính là nếp và đậu tương, chế thêm nước mưa và muối trắng."
        ]
      },
      {
        "title": "Điểm tham quan",
        "content": [
          "Nhà cổ: Trải qua bao thăng trầm của thời gian, làng cổ Cự Đà dường như vẫn giữ được nguyên vẹn nét thuở ban đầu với những ngôi nhà mái ngói 3 gian, 5 gian lối thiết kế đặc trưng của vùng Bắc Bộ xen kẽ những ngôi nhà 2 tầng mang nét kiến trúc Pháp.",
          "Cổng làng: Đặt chân tới làng cổ Cự Đà, bất cứ ai cũng cảm thấy ấn tượng với những cổng làng mang đậm nét rêu phong cổ kính được đắp nổi chữ Hán.",
          "Đình làng Cự Đà: Kiến trúc đình Cự Đà gồm 5 gian, kết cấu gỗ truyền thống theo kiểu chồng rường, kẻ bảy. Trên các kẻ bảy, xà lách đều tinh tế chạm trổ các hoa văn, hoạ tiết như: hình rồng, hoa lá.",
          "Miếu làng: Miếu làng Cự Đà là bệ thờ trời đất hay còn gọi là Đàn Xã Tắc, nơi thờ vị Thánh Trung Thông.",
          "Chùa Cự Đà: Chùa Cự Đà hay còn gọi là Linh Minh tự, có niên đại hơn 300 năm, đã được công nhận di tích lịch sử văn hoá, xếp hạng di tích quốc gia vào năm 2000."
        ]
      }
    ],
    "image": "",
    "activities": [
      {
        "title": "Trải nghiệm",
        "content": [
          "Dạo quanh làng cổ: Khám phá những ngôi nhà cổ có tuổi đời hàng trăm năm",
          "Tìm hiểu nghề làm miến: Chứng kiến quy trình sản xuất miến truyền thống",
          "Tìm hiểu nghề làm tương: Khám phá bí quyết làm tương nổi tiếng",
          "Check-in cổng làng: Chụp ảnh với những cổng làng rêu phong cổ kính",
          "Tham quan đình, chùa: Tìm hiểu kiến trúc và văn hóa tâm linh"
        ]
      },
      {
        "title": "Di chuyển",
        "content": [
          "Xe máy, ô tô: Trung tâm Hà Nội - Nguyễn Trãi - Láng Hạ - Đê La Thành - Đại Cồ Việt - Tôn Thất Tùng - Phạm Ngũ Lão - Ngô Gia Tự - làng Cự Đà",
          "Xe bus: Các tuyến 103A, 103B, 85 có điểm dừng gần làng Cự Đà"
        ]
      },
      {
        "title": "Mua sắm",
        "content": [
          "Miến dong Cự Đà: Sản phẩm đặc trưng của làng nghề",
          "Tương Cự Đà: Món quà đặc sản độc đáo",
          "Các sản phẩm thủ công truyền thống"
        ]
      }
    ]
  }
}
